-- @Author: baidwwy
-- @Date:   2024-08-04 20:56:39
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-01-03 19:19:06
九黎城攻击技能 = {
	枫影二刃 = 1,
	三荒尽灭 = 1,
	力辟苍穹 = 1,
	铁血生风 = 1,
	一斧开天 = 1,
	魔神之刃 = 1
}
九黎城三次概率 = 15
function 引擎.取技能(jn,lx)
	local jns = {}
	if skill取技能[jn] then
	    for i=1,12 do
	    	if skill取技能[jn]["jns_"..i] then
	    	    jns[i]=skill取技能[jn]["jns_"..i]
	    	end
	    end
	end
	return jns
end

skill取技能={}
-----------------------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------------------
skill取技能["连破"]={
	jns_1 = "横扫千军有几率不进入“休息”状态。"
	,jns_3 = 8
	,jns_5 = "该被动在选择大唐无双战神流派时可获得。"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 1791802465
	,jns_8 = 1791802465
	,jns_11 = "被动"
	}
skill取技能["风刃"]={
	jns_1 = "#R普通攻击时可以对其它随机3个单位造成(百分比)的伤害；"
	,jns_3 = 8
	,jns_5 = "该被动在选择大唐无双战神流派时可获得。"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF97A7093
	,jns_8 = 0xF97A7093
	,jns_11 = "被动"
	}











-----------------------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------------------

skill取技能["九黎战歌"] = {
    jns_1 = "战鼓铿锵，战魂不息，九黎之歌荡涤天地，激昂族人之志。#R其他派技能的等级不能高于本技能。\n#P【学习效果】无效果",
    jns_3 = 8,
    jns_6 = "jmtb.wdf",
    jns_7 = 268435457,
    jns_8 = 268435458,
    jns_11 = "被动"
}

skill取技能["魂枫战舞"] = {
    jns_1 = "魂枫蹁跹，奕奕如战，英气磅礴，永不止息。\n#P【学习效果】按技能等级提高伤害",
    jns_3 = 8,
    jns_6 = "jmtb.wdf",
    jns_7 = 268435459,
    jns_8 = 268435460,
    jns_11 = "被动"
}

skill取技能["兵铸乾坤"] = {
    jns_1 = "九黎魔息，燎天之焰，铸魂成兵，乾坤在握。\n#P【学习效果】按技能等级提高法伤和法防",
    jns_3 = 8,
    jns_6 = "jmtb.wdf",
    jns_7 = 268435461,
    jns_8 = 268435462,
    jns_11 = "被动"
}

skill取技能["燃铁飞花"] = {
    jns_1 = "战意如火，叱咤生花，九黎之子，铁士无畏。\n#P【学习效果】按技能等级提高命中",
    jns_3 = 8,
    jns_6 = "jmtb.wdf",
    jns_7 = 268435463,
    jns_8 = 268435464,
    jns_11 = "被动"
}

skill取技能["战火雄魂"] = {
    jns_1 = "九黎之魂，犹燎原之火，燃万丈烈焰，指胜利之巅。\n#P【学习效果】按技能等级提高防御",
    jns_3 = 8,
    jns_6 = "jmtb.wdf",
    jns_7 = 268435465,
    jns_8 = 268435472,
    jns_11 = "被动"
}

skill取技能["魔神降世"] = {
    jns_1 = "聆听兵主密命，得赐魔神之力，战无不胜，天地可征。\n#P【学习效果】无效果",
    jns_3 = 8,
    jns_6 = "jmtb.wdf",
    jns_7 = 268435473,
    jns_8 = 268435474,
    jns_11 = "被动"
}

skill取技能["风行九黎"] = {
    jns_1 = "风所行处，九黎无阻，越古穿今，无迹不至。\n#P【学习效果】按技能等级提高躲避",
    jns_3 = 8,
    jns_6 = "jmtb.wdf",
    jns_7 = 268435475,
    jns_8 = 268435476,
    jns_11 = "被动"
}

skill取技能["黎魂"] = {
    jns_1 = "每回合可以释放2-3个师门技能。",
    jns_3 = 8,
    jns_5 = "九黎战歌技能达到1级",
    jns_6 = "jmtb.wdf",
    jns_7 = 268435477,
    jns_8 = 268435478,
    jns_11 = "被动"
}

skill取技能["战鼓"] = {
    jns_1 = "使用师门技能攻击敌人时会累加连击值，连击值越大，下回合“黎魂”触发3个技能概率越高。",
    jns_3 = 8,
    jns_5 = "九黎战歌技能达到1级",
    jns_6 = "jmtb.wdf",
    jns_7 = 268435479,
    jns_8 = 268435480,
    jns_11 = "被动"
}

skill取技能["怒哮"] = {
    jns_1 = "使用一斧开天后如果目标没有处于浮空状态，45%概率获得“怒哮”：下一次使用一斧开天和三荒尽灭令目标进入浮空成功率大幅度增加。当使用一斧开天或三荒尽灭令目标成功浮空时，移除该效果。",
    jns_3 = 8,
    jns_5 = "九黎战歌技能达到1级",
    jns_6 = "jmtb.wdf",
    jns_7 = 268435481,
    jns_8 = 268435488,
    jns_66 = "下一次使用‘一斧开天’和‘三荒尽灭’令目标进入浮空成功率大幅度增加",
    jns_11 = "被动"
}

skill取技能["炎魂"] = {
    jns_1 = "全部种族的属性点加成属性统一按照魔族成长。每回合首次使用师门技能前会临时将自身防御的5%-10%转为伤害力。",
    jns_3 = 8,
    jns_5 = "九黎战歌技能达到1级",
    jns_6 = "jmtb.wdf",
    jns_7 = 268435489,
    jns_8 = 268435490,
    jns_11 = "被动"
}

skill取技能["枫影二刃"] = {
    jns_1 = "战歌鸣，怒啸起，枫林迎战舞，英魂影重重。\n#G【功效】对敌方单个目标连续发动2次物理攻击，使用后有概率令自己获得“怒哮”"
    ,jns_3 = 4
    ,jns_4 = "20点魔法"
    ,jns_5 = "魂枫战舞技能达到1级"
    ,jns_6 = "jmtb.wdf"
    ,jns_7 = 268435491
    ,jns_8 = 268435492
}

skill取技能["一斧开天"] = {
    jns_1 = "一斧开天，气破乾坤，以往昔之魂，凝今时之志。\n#G【功效】对敌方目标连续发动2次物理攻击，使用后有概率令目标进入“浮空”状态，持续到你的行动结束。"
    ,jns_3 = 4
    ,jns_4 = "20点魔法"
    ,jns_5 = "兵铸乾坤技能达到30级"
    ,jns_6 = "jmtb.wdf"
    ,jns_7 = 268435495
    ,jns_8 = 268435496
}

skill取技能["三荒尽灭"] = {
    jns_1 = "横空霹雳，惊三荒， 煞四野，昭吾九黎之威。\n#G【功效】对敌方3个目标发动物理攻击，并令所有目标有概率进入“浮空”状态，持续到你的行动结束。"
    ,jns_3 = 4
    ,jns_4 = "20点魔法"
    ,jns_5 = "燃铁飞花技能达到30级"
    ,jns_6 = "jmtb.wdf"
    ,jns_7 = 268435493
    ,jns_8 = 268435494
}

skill取技能["铁血生风"] = {
    jns_1 = "铁血凝矣，挟风而起，敌逢吾威，食尘饮悔。\n#G【功效】对敌方单个目标连续物理攻击，如果目标处于“浮空”状态，额外发动1-2次物理攻击。"
    ,jns_3 = 4
    ,jns_4 = "20点魔法"
    ,jns_5 = "战火雄魂技能达到30级"
    ,jns_6 = "jmtb.wdf"
    ,jns_7 = 268435497
    ,jns_8 = 268435504
}

skill取技能["力辟苍穹"] = {
    jns_1 = "魔神垂祉，上古魔息浩若狂澜。兵主赐威，穹顶之下为吾独行。\n#G【功效】对敌方全部“浮空”目标连续发动2-3次物理攻击，然后取消全部目标的“浮空”状态。"
    ,jns_3 = 4
    ,jns_4 = "20点魔法"
    ,jns_5 = "魔神降世技能达到30级"
    ,jns_6 = "jmtb.wdf"
    ,jns_7 = 268435505
    ,jns_8 = 268435506
}
skill取技能["魔神之刃"] = {
    jns_1 = "使用一次特殊的力辟苍穹，造成的伤害提高10%并且暴击伤害倍率增加100%，但仅作用1个浮空目标。（战斗开始时具有2回合冷却）。\n#P【学习效果】无效果"
    ,jns_3 = 4
    ,jns_4 = "20点魔法"
    ,jns_5 = "经脉技能"
    ,jns_6 = "jmtb.wdf"
    ,jns_7 = 268435457
    ,jns_8 = 268435458
}

skill取技能["故壤归心"] = {
    jns_1 = "疾风骤起，寻归故里，不问天涯，九黎归心。\n#G【功效】平常状态下使用，可以瞬间回到自己的门派，成功率受技能等级影响。"
    ,jns_3 = 0
    ,jns_4 = "10点气血、10点魔法"
    ,jns_5 = "风行九黎技能达到1级"
    ,jns_6 = "jmtb.wdf"
    ,jns_7 = 268435507
    ,jns_8 = 268435508
}
skill取技能["明光"]={
	jns_1 = "你的治疗有18%几率触发暴击，使得技能效果翻倍。"
	,jns_3 = 55
	,jns_5 = "该被动在选择化生杏林妙手、护法金刚流派时可获得。"
	,jns_6 = "wzife.wd3"
	,jns_7 = 2844166683
	,jns_8 = 2844166683
	,jns_11 = "被动"
	}
skill取技能["佛眷"]={
	jns_1 = "活血会使目标受到来自你或来自药品的治疗量提高30%，持续3回合。"
	,jns_3 = 55
	,jns_5 = "该被动在选择化生杏林妙手流派时可获得。"
	,jns_6 = "jntb.wdf"
	,jns_7 = 536870912
	,jns_8 = 536870912
	,jns_11 = "被动"
	}
skill取技能["聚气"]={
	jns_1 = "每次使用非回复类辅助门派法术时，有15%概率使下一次回复法术效果提升30%。"
	,jns_3 = 55
	,jns_5 = "该被动在选择化生护法金刚流派时可获得。"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x86873B99
	,jns_8 = 0x86873B99
	,jns_11 = "被动"
	}
skill取技能["度厄"]={
	jns_1 = "你的唧歪歪和谆谆教诲不会触发法术闪避,但门派法术施加的治疗和“金刚护体、金刚护法、一苇渡江”效果降低50%。"
	,jns_3 = 55
	,jns_5 = "该被动在选择化生无量尊者流派时可获得。"
	,jns_6 = "jntb.wdf"
	,jns_7 = 2231369728
	,jns_8 = 2231369728
	,jns_11 = "被动"
	}
skill取技能["龙骇"]={
	jns_1 = "使用龙卷雨击有25%几率使得你下一次龙腾造成的伤害提高20%；你的龙腾有25%几率使得你下一次龙卷雨击造成的伤害提高10%。"
	,jns_3 = 55
	,jns_5 = "选择经脉龙息后，将失去此被动技能。"
	,jns_6 = "wzife.wd3"
	,jns_7 = 503805650
	,jns_8 = 503805650
	,jns_11 = "被动"
	}
skill取技能["魔冥"]={
	jns_1 = "每次使用飞砂走石，可以使你下次三昧真火或魔焰滔天造成的伤害提高3%（目标为人物则为9%），持续4回合，可叠加4层，层数提升时刷新时间。"
	,jns_3 = 55
	,jns_5 = "该被动在选择魔王平天大圣流派、盖世魔君流派时可获得。"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8BF70190
	,jns_8 = 0x8BF70190
	,jns_11 = "被动"
	}
skill取技能["骤雨"]={
	jns_1 = "每次使用烟雨剑法后都会使你造成的伤害和暴击率提高2%，持续3回合，可叠加3层。"
	,jns_3 = 55
	,jns_5 = "该被动在选择五庄乾坤力士流派时可获得。"
	,jns_6 = "wzife.wd3"
	,jns_7 = 32926751
	,jns_8 = 32926751
	,jns_11 = "被动"
	}
skill取技能["还丹"]={
	jns_1 = "敲金击玉每次攻击后可获得1枚人参娃娃,人参娃娃会在使用敲金击玉时与你一同攻击,额外造成30%伤害。最多持有3枚人参娃娃,持续时间3回合、获得时刷新持续时间。"
	,jns_3 = 55
	,jns_5 = "该被动在选择五庄万寿真仙流派时可获得。"
	,jns_6 = "jntb.wdf"
	,jns_7 = 587202560
	,jns_8 = 587202560
	,jns_11 = "被动"
	}
skill取技能["神迷"]={
	jns_1 = "风华舞圣、迷情妖姬流派效果：被你含情脉脉和魔音摄魂封印命中的单位，吸取4点愤怒；百媚魔姝流派效果：你成功对玩家单位附加天罗地网异常状态时，吸取4点愤怒。"
	,jns_3 = 8
	,jns_6 = "jntb.wdf"
	,jns_7 = 1207959552
	,jns_8 = 1207959552
	,jns_11 = "被动"
	}
skill取技能["吞山"]={
	jns_1 = "你的裂石、断岳式和天崩地裂增加5%的暴击几率。"
	,jns_3 = 55
	,jns_5 = "该被动在选择凌波九天武圣流派时可获得。"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1342177280
	,jns_8 = 1342177280
	,jns_11 = "被动"
	}
skill取技能["战意"]={
	jns_1 = "进入战斗获得2点战意，用于发动门派法术。战意点数将提高自己的物理伤害力。同时提升（战意数量*战意数量÷2）％的抵抗封印几率。战意最多累计6点。战斗中阵亡时，战意值将减半。"
	,jns_3 = 8
	,jns_6 = "jntb.wdf"
	,jns_7 = 1459617792
	,jns_8 = 1459617792
	,jns_11 = "被动"
	}
skill取技能["超级战意"]={
	jns_1 = "获得战意时，有20%的几率获得1点超级战意，最多持有3点超级战意；每点消耗的超级战意，将提高此次攻击20%的伤害。"
	,jns_3 = 8
	,jns_5 = "该被动在选择凌波灵霄斗士流派时可获得"
	,jns_6 = "jntb.wdf"
	,jns_7 = 352321536
	,jns_8 = 352321536
	,jns_11 = "被动"
	}
skill取技能["饮海"]={
	jns_1 = "你的浪涌、惊涛怒和翻江搅海忽略目标一定的防御。"
	,jns_3 = 55
	,jns_5 = "该被动在选择凌波九天武圣流派时可获得。"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1426063360
	,jns_8 = 1426063360
	,jns_11 = "被动"
	}
skill取技能["风灵"]={
	jns_1 = "每偶数回合结束获得1层风灵，每层风灵可以提高10点法术伤害力加成，最高6层。"
	,jns_3 = 8
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x4BB78E6D
	,jns_8 = 0x4BB78E6D
	,jns_11 = "被动"
	}
skill取技能["风萦"]={
	jns_1 = "使用荆棘舞、冰川怒、尘士刃时,若有风灵,会消耗1层风灵使造成的伤害提高5%。"
	,jns_3 = 55
	,jns_5 = "该被动在选择神木灵木神侍流派时可获得。"
	,jns_6 = "jntb.wdf"
	,jns_7 = 419430400
	,jns_8 = 419430400
	,jns_11 = "被动"
	}
skill取技能["木精"]={
	jns_1 = "你消耗的每点风灵有50%几率转化为木精,最多持有3点木精。"
	,jns_3 = 55
	,jns_6 = "jntb.wdf"
	,jns_7 = 922746880
	,jns_8 = 922746880
	}
skill取技能["鞭挞"]={
	jns_1 = "荆棘舞会消耗最多3层“风灵”，每层风灵增加15%伤害结果。"
	,jns_3 = 55
	,jns_5 = "该被动在选择神木通天法王流派、神木巫影祭司流派时可获得。"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x2AAB3A47
	,jns_8 = 0x2AAB3A47
	,jns_11 = "被动"
	}
skill取技能["狮吼"]={
	jns_1 = "狮搏击倒召唤兽或NPC时，额外触发一次狮搏。"
	,jns_3 = 55
	,jns_5 = "该被动在选择狮驼嗜血狂魔流派时可获得。"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xD10DF1DF
	,jns_8 = 0xD10DF1DF
	,jns_11 = "被动"
	}

skill取技能["奔雷"]={
	jns_1 = "五雷咒额外攻击1个目标,但你的封印命中率下降15%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xB490BD29
	,jns_8 = 0xB490BD29
	}
skill取技能["悲恸"]={
	jns_1 = "五雷咒对召唤兽造成的伤害提高30%。"
	,jns_3 = 8
	,jns_6 = "jntb.wdf"
	,jns_7 = 318767104
	,jns_8 = 318767104
	}
skill取技能["咒符"]={
	jns_1 = "回合开始时,会随机获得1-5枚符咒,雷法会消耗当前所有符咒来强化你的下一个五雷正法。"
	,jns_3 = 55
	,jns_6 = "jntb.wdf"
	,jns_7 = 1493172224
	,jns_8 = 1493172224
	}
skill取技能["自矜"]={
	jns_1 = "绝代妖娆流派效果 ：每次使用单体封印技能失败时，有40%几率获得临时封印能力提升，使得下次单体封印时成功率提高基础值的48%（总的命中率最高不超过100%，不对一笑倾城首目标有效）。到下一次命中时清空该效果。花间美人流派效果：使用葬玉焚花和满天花雨时，40%几率获得“自矜”状态，使你下一次使用对应技能必定触发以下效果：1）使用葬玉焚花时，每次攻击目标后追加一次额外攻击2）使用满天花雨时，攻击目标后追加一次额外攻击"
	,jns_3 = 55
	,jns_5 = "该被动在选择女儿绝代妖娆流派、女儿花间美人流派时可获得。"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x22A77A43
	,jns_8 = 0x22A77A43
	,jns_11 = "被动"
	}
skill取技能["电芒"]={
	jns_1 = "被雷霆万钧击中的目标将被附加“电芒”状态。带有“电芒”的目标再次受到雷霆万钧打击时额外承受8%的伤害,“电芒”持续3回合(不可叠加，可以被刷新）。自身封印命中率减少15%。"
	,jns_3 = 55
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x7B970F69
	,jns_8 = 0x7B970F69
	,jns_11 = "被动"
	}
skill取技能["返璞"]={
	jns_1 = "作为物理攻击的大师,门派法术造成的物理伤害提高,但封印命中率和造成的法术伤害降低。"
	,jns_3 = 55
	,jns_6 = "jntb.wdf"
	,jns_7 = 385875968
	,jns_8 = 385875968
	,jns_11 = "被动"
	}
skill取技能["五行感应"]={
	jns_1 = "与你武器五行相同的五行攻击提高10%的伤害"
	,jns_3 = 55
	,jns_5 = "五行扭转技能≥120级，需飞升"
	,jns_6 = "jntb.wdf"
	,jns_7 = 2466250752
	,jns_8 = 2466250752
	,jns_11 = "被动"
	}
skill取技能["五行珠"]={
	jns_1 = "非“剑意莲心”状态下:五行攻击后有50%几率获得1枚五行珠,如果克制了对面五行,则几率增加至100%;“剑意莲心”状态下:五行攻击消耗1枚五行珠,将额外攻击一次。你门派法术造成的治疗效果降低50%。"
	,jns_3 = 55
	,jns_6 = "jntb.wdf"
	,jns_7 = 1358954496
	,jns_8 = 1358954496
	,jns_11 = "被动"
	}
skill取技能["金莲"]={
	jns_1 = "你的地涌金莲额外作用1-2个单位（在技能等级为45或105时），封印命中率减少30%"
	,jns_3 = 55
	,jns_5 = "该被动在选择无底洞妙谛金莲流派时获得。"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 2897057227
	,jns_8 = 2897057227
	,jns_11 = "被动"
	}
skill取技能["缚魂"]={
	jns_1 = "与NPC战斗时:你的夺魄令可以封印目标的物理攻击。"
	,jns_3 = 55
	,jns_5 = "该被动在选择无底洞摄魂迷影流派时获得。"
	,jns_6 = "jntb.wdf"
	,jns_7 = 2264924160
	,jns_8 = 2264924160
	,jns_11 = "被动"
	}
skill取技能["侵蚀"]={
	jns_1 = "与NPC战斗时:你的夺魄令可以封印目标的物理攻击。"
	,jns_3 = 55
	,jns_5 = "该被动在选择无底洞摄魂迷影流派时获得。"
	,jns_6 = "jntb.wdf"
	,jns_7 = 2264924160
	,jns_8 = 2264924160
	,jns_11 = "被动"
	}
skill取技能["裂魂"]={
	jns_1 = "追魂刺有几率使目标的一部分魂魄脱离自己的身体。目标为非玩家单位时,造成额外伤害;目标为玩家单位时,击出目标魂魄。追魂刺和夺命咒对目标造成伤害时,若其魂魄在场、则会造成额外伤害。（魂魄属于本方增益状态)"
	,jns_3 = 55
	,jns_5 = "该被动在选择无底洞幽冥巫煞流派时获得。"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x7B970F69
	,jns_8 = 0x7B970F69
	,jns_11 = "被动"
	}
skill取技能["如意神通"]={
	jns_1 = "每回合开始时，花果山弟子只能使用随机的3个“如意神通”。与NPC的战斗中，普通攻击将会额外攻击一个目标。"
	,jns_3 = 55
	,jns_5 = ""
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300019
	,jns_8 = 0xE7300019
	,jns_11 = "被动"
	}
skill取技能["牛刀小试"]={
	jns_1 = "兄弟吃我一发小菜刀"
	,jns_3 = 4
	,jns_4 = "20魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3416022732
	,jns_8 = 3416022732
	--新增宝宝技能
	}
skill取技能["风起龙游"]={
	jns_1 = "攻击速度低于自身的目标，提升10%的伤害效果。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000323
	,jns_8 = 0x1000323
	}
skill取技能["神来气旺"]={
	jns_1 = "使用“地狱烈火”时：初始目标伤害提高；作用目标数每回合有50％概率+1，可叠加，成功触发后递减"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000323
	,jns_8 = 0x1000323
	}
skill取技能["北冥之渊"]={
	jns_1 = "令友方所有召唤兽、孩子的攻击五行变为水，水属性攻击五行的召唤兽、孩子造成伤害提升30%，持续1回合，鲲鹏专属技能"
	,jns_3 = 2
	,jns_4 = "作用人数*20点魔法"
	,jns_6 = "kkjn.wdf"
	,jns_7 = 0x00000001
	,jns_8 = 0x00000001
	}
skill取技能["扶摇万里"]={
	jns_1 = "法术攻击多个目标，按等级附加一定的法术伤害，鲲鹏专属技能"
	,jns_3 = 4
	,jns_4 = "100点魔法"
	,jns_5 = "作用人数=技能等级÷15+1,最多10人"
	,jns_6 = "kkjn.wdf"
	,jns_7 = 0x00000002
	,jns_8 = 0x00000002
	}
skill取技能["水击三千"]={
	jns_1 = "临时提升物理伤害结果和暴击倍率进行一次物理攻击，鲲鹏专属技能"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_6 = "kkjn.wdf"
	,jns_7 = 0x00000003
	,jns_8 = 0x00000003
	}
skill取技能["逍遥游"]={
	jns_1 = "提升自身20%速度，每回合首次受到的物法伤害降低20%，受到的物理、法术伤害暴击倍率降低50%\n第二回合后进场时，对血量百分比最低的单位释放水击三千或扶摇万里，若场上无其他超级鲲鹏，则出场伤害提升150%，鲲鹏专属技能"
	,jns_3 = 12
	,jns_6 = "kkjn.wdf"
	,jns_7 = 0x00000004
	,jns_8 = 0x00000004
	---大唐官府技能
	}
skill取技能["为官之道"]={
	jns_1 = "“官场如战场，万事休鲁莽”。精学为官道，万事皆无妄。官府弟子在任何时候，都要讲究自己的品行和修为。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2338752455
	,jns_8 = 2050205097
	}
skill取技能["十方无敌"]={
	jns_1 = "学习效果：提高角色的伤害。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1137925403
	,jns_8 = 4107877611
	}
skill取技能["无双一击"]={
	jns_1 = "学习效果：提高角色的命中。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2203124248
	,jns_8 = 2998720398
	}
skill取技能["神兵鉴赏"]={
	jns_1 = "平时状态下使用，可以鉴定武器和铠甲/女衣。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 743065692
	,jns_8 = 4243999668
	}
skill取技能["疾风步"]={
	jns_1 = "学习效果：提高角色的躲避。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2104231936
	,jns_8 = 552299472
	}
skill取技能["紫薇之术"]={
	jns_1 = "学习效果：提高角色的法伤和法防。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3941011754
	,jns_8 = 1942519774
	}
skill取技能["文韬武略"]={
	jns_1 = "学习效果：提高角色的防御。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1708888521
	,jns_8 = 3150772814
	}
skill取技能["杀气诀"]={
	jns_1 = "战斗中临时提高自己或队友的命中。"
	,jns_3 = 2
	,jns_4 = "40点魔法"
	,jns_5 = "为官之道技能达到15级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1673396685
	,jns_8 = 1326507976
	}
skill取技能["翩鸿一击"]={
	jns_1 = "使用该技能攻击目标，下回合提高自身15%的速度。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "需要技能等级达到45"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x30E001D4
	,jns_8 = 0x30E001D4
	,jns_12 = "6回合"
	}
skill取技能["披坚执锐"]={
	jns_1 = "【功效】每回合随机1种你装备上的追加法术。使用披坚执锐后,视为你装备当回合随机的追加法术。"
	,jns_3 = 4
	,jns_4 = "【消耗】100点魔法"
	,jns_5 = "身上5件装备都带有追加法术,且种类≥2"
	,jns_6 = "jntb.wdf"
	,jns_7 = 939524096
	,jns_8 = 939524096
	}
skill取技能["兵器谱"]={
	jns_1 = "能够鉴定武器和铠甲，学习后也可在长安书店制作相应等级的“神兵图鉴”。"
	,jns_3 = 12
	,jns_4 = "一定的活力，视装备等级而定"
	,jns_5 = "神兵鉴赏技能等级达到5级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1814276494
	,jns_8 = 4262913816
	}
skill取技能["千里神行"]={
	jns_1 = "平时状态下使用，可以瞬间回到自己的门派。"
	,jns_3 = 0
	,jns_4 = "消耗10点气血和10点魔法"
	,jns_5 = "疾风步技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 13494159
	,jns_8 = 1717996623
	}
skill取技能["斩龙诀"]={
	jns_1 = "克制龙宫弟子的必杀技，使用后需要休息1回合，成功率受技能等级与目标等级之差影响。"
	,jns_3 = 4
	,jns_4 = "150点愤怒值"
	,jns_5 = "需要技能等级达到25"
	,jns_6 = "wzife.wdf"
	,jns_7 = 40028053
	,jns_8 = 1152390271
	}
skill取技能["反间之计"]={
	jns_1 = "使敌方NPC目标陷入混乱状态，随意攻击其友方目标（不能对玩家及召唤兽使用），持续3回合。成功率受技能等级与目标等级之差影响。"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "文韬武略技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 146786390
	,jns_8 = 841319996
	}
skill取技能["横扫千军"]={
	jns_1 = "对敌方单个目标连续发动3次物理攻击，使用后需休息一回合。【条件】当前气血比例≥50%。"
	,jns_3 = 4
	,jns_4 = "最大气血*5%"
	,jns_5 = "十方无敌技能达到30级以上"
	,jns_6 = "wzife.wdf"
	,jns_7 = 151046561
	,jns_8 = 2967724427
	}
skill取技能["侵蚀·横扫千军·刻骨"]={
	jns_1 = "对敌方单个目标连续发动3次物理攻击，使用后需休息一回合。【条件】当前气血比例≥50%。"
	,jns_3 = 4
	,jns_4 = "最大气血*10%"
	,jns_5 = "十方无敌技能达到30级以上"
	,jns_6 = "wzife.wdf"
	,jns_7 = 151046561
	,jns_8 = 2967724427
	}
skill取技能["侵蚀·横扫千军·钻心"]={
	jns_1 = "对敌方单个目标连续发动3次物理攻击，使用后需休息一回合。【条件】当前气血比例≥50%。"
	,jns_3 = 4
	,jns_4 = "最大气血*10%"
	,jns_5 = "十方无敌技能达到30级以上"
	,jns_6 = "wzife.wdf"
	,jns_7 = 151046561
	,jns_8 = 2967724427
	}
skill取技能["侵蚀·横扫千军·噬魂"]={
	jns_1 = "对敌方单个目标连续发动3次物理攻击，使用后需休息一回合。【条件】当前气血比例≥50%。"
	,jns_3 = 4
	,jns_4 = "最大气血*10%"
	,jns_5 = "十方无敌技能达到30级以上"
	,jns_6 = "wzife.wdf"
	,jns_7 = 151046561
	,jns_8 = 2967724427
	}
skill取技能["披挂上阵"]={
	jns_1 = "使用仅造成80%伤害的横扫千军攻击目标，每次攻击均有几率触发套装追加法术。"
	,jns_3 = 4
	,jns_4 = "最大气血*5%"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1996488704
	,jns_8 = 1996488704
	,jns_12 = "10回合，战斗开始时具有5回合冷却"
	}
skill取技能["破釜沉舟"]={
	jns_1 = "对敌方3个目标发动物理攻击，使用后需休息一回合。当前气血比例≥10%(敌方为NPC)、10%≤当前气血比例<50%(敌方为玩家)，方可使用。"
	,jns_3 = 4
	,jns_4 = "最大气血*10%"
	,jns_5 = "人物飞升且“十方无敌”技能达到120级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1580308746
	,jns_8 = 619017033
	}
skill取技能["安神诀"]={
	jns_1 = "【功效】提高自身的法伤和法防,持续7回合。"
	,jns_3 = 2
	,jns_4 = "30点魔法"
	,jns_5 = "人物飞升且“文韬武略”技能达到120级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 3150617611
	,jns_8 = 2204689180
	}
skill取技能["嗜血"]={
	jns_1 = "平时状态下使用，临时赋予项链提升体质的功效，下线后消失。"
	,jns_3 = 12
	,jns_4 = "和技能等级数相同的活力"
	,jns_5 = "文韬武略技能达到35级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 2341356120
	,jns_8 = 831906636
	}
skill取技能["后发制人"]={
	jns_1 = "使用当回合提高自身的防御和法防，下回合临时提高命中、伤害和速度并对敌方单个目标发动物理攻击。"
	,jns_3 = 4
	,jns_4 = "当前气血*5%"
	,jns_5 = "无双一击技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3809037555
	,jns_8 = 1112380505
	}
skill取技能["长驱直入"]={
	jns_1 = "使用该技能攻击时，目标无法被保护。伤害结果为普通攻击的110%；同时60%几率对目标附加“重创”状态：回复效果降低30%并且受到施法者的伤害增加10%。法术驱动的物理攻击，持续2回合。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xAB6EA7B4
	,jns_8 = 0xAB6EA7B4
	,jns_12 = "6回合"
	}
skill取技能["惊天动地"]={
	jns_1 = "瞬间对5个单位造成伤害。"
	,jns_3 = 4
	,jns_4 ="使用后仅保留1点气血和气血上限，休息2回合。"
	,jns_5 = "本方≥2名玩家单位倒地、自身当前气血≥90%"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1879048192
	,jns_8 = 1879048192
	}
skill取技能["摧枯拉朽"]={
	jns_1 = "对目标发动—次必定触发套装追加法术的物理攻击。"
	,jns_3 = 4
	,jns_4 = "300点魔法"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1711276032
	,jns_8 = 1711276032
	,jns_12 = "30回合，战斗开始时具有15回合冷却"
}
	--方寸山技能
skill取技能["磐龙灭法"]={
	jns_1 = "学习效果:提高角色的伤害"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 423192983
	,jns_8 = 1962038233
	}
skill取技能["黄庭经"]={
	jns_1 = "玄妙道学日太清，炼丹修气心自明。云松紫阁仙府内，正有仙人诵黄庭。这是阐述道学基本原理的经书，也是方寸山弟子必学的内功心法。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2680262225
	,jns_8 = 1501050246
	}
skill取技能["霹雳咒"]={
	jns_1 = "九天雷部流传下来的《五雷书》中记载的秘术，借助上天雷神的威力来辅助自己。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 53930907
	,jns_8 = 300592749
	}
skill取技能["符之术"]={
	jns_1 = "方寸山的独家技能，能够将法术咒语用特殊的符号表现出来，附加在普通的符纸上。"
	,jns_3 = 1
	,jns_6 = "wzife.wdf"
	,jns_7 = 3599571341
	,jns_8 = 921854792
	}
skill取技能["归元心法"]={
	jns_1 = "学习效果:提高角色的防御"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3444112895
	,jns_8 = 2996031232
	}
skill取技能["神道无念"]={
	jns_1 = "学习效果:提高角色的法伤和法防"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1749937072
	,jns_8 = 3852659463
	}
skill取技能["斜月步"]={
	jns_1 = "学习效果:提高角色的躲避"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 769022309
	,jns_8 = 2124205828
	}
skill取技能["三星灭魔"]={
	jns_1 = "克制魔王寨弟子的必杀技"
	,jns_3 = 4
	,jns_4 = "150点愤怒值"
	,jns_5 = "黄庭经技能达到25级，人物等级达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1209970630
	,jns_8 = 84450076
	}
skill取技能["五雷咒"]={
	jns_1 = "对敌方敌方目标造成法术伤害。"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "霹雳咒技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3103307429
	,jns_8 = 1116134864
	}
skill取技能["侵蚀·五雷咒·刻骨"]={
	jns_1 = "对敌方敌方目标造成法术伤害。"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "霹雳咒技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3103307429
	,jns_8 = 1116134864
	}
skill取技能["侵蚀·五雷咒·噬魂"]={
	jns_1 = "对敌方敌方目标造成法术伤害。"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "霹雳咒技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3103307429
	,jns_8 = 1116134864
	}
skill取技能["侵蚀·五雷咒·钻心"]={
	jns_1 = "对敌方敌方目标造成法术伤害。"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "霹雳咒技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3103307429
	,jns_8 = 1116134864
	}
skill取技能["飞行符"]={
	jns_1 = "制作飞行符"
	,jns_3 = 0
	,jns_4 = "50点魔法、6点活力"
	,jns_5 = "符之术技能达到21级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1788221468
	,jns_8 = 1798664293
	}
skill取技能["兵解符"]={
	jns_1 = "一定几率逃离战场回到自己的门派。"
	,jns_3 = 5
	,jns_4 = "当前气血*90%、全部魔法"
	,jns_5 = "当前魔法≥10"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1268134129
	,jns_8 = 2026082073
	}
skill取技能["催眠符"]={
	jns_1 = "此符能召唤大量令人昏昏欲睡的嗑睡虫，在不知不觉中将对方催眠。"
	,jns_3 = 4
	,jns_4 = "45点魔法"
	,jns_5 = "符之术技能达到10级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3523869082
	,jns_8 = 104771547
	}
skill取技能["失心符"]={
	jns_1 = "使敌方目标无法使用法术，并降低其法伤和法防，持续6回合。"
	,jns_3 = 4
	,jns_4 = "60点魔法"
	,jns_5 = "符之术技能达到40级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1506622772
	,jns_8 = 3407760722
	}
skill取技能["落魄符"]={
	jns_1 = "使敌方目标无法使用法术，并在普通攻击时出现偏差。持续6回合。"
	,jns_3 = 4
	,jns_4 = "40点魔法"
	,jns_5 = "符之术技能达到15级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1553239295
	,jns_8 = 2036240644
	}
skill取技能["失忆符"]={
	jns_1 = "方寸山的神秘法术，抛出写有箴言的符咒，令敌人无法再施展特技。持续7回合。"
	,jns_3 = 4
	,jns_4 = "55点魔法"
	,jns_5 = "符之术技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1562829683
	,jns_8 = 2704552245
	}
skill取技能["追魂符"]={
	jns_1 = "使敌方目标无法使用普通攻击，并降低其防御，持续7回合。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "符之术技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1021060099
	,jns_8 = 2404071232
	}
skill取技能["离魂符"]={
	jns_1 = "令对手一定回合内无法使用法术，并降低躲避力，持续6回合。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "符之术技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 30806
	,jns_8 = 3355342391
	}
skill取技能["失魂符"]={
	jns_1 = "令对手一定回合无法使用法术攻击，并降低物理防御力，持续6回合。"
	,jns_3 = 4
	,jns_4 = "60点魔法"
	,jns_5 = "符之术技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2029120895
	,jns_8 = 2414938178
	}
skill取技能["侵蚀·失魂符·刻骨"]={
	jns_1 = "令对手一定回合无法使用法术攻击，并降低物理防御力，持续6回合。"
	,jns_3 = 4
	,jns_4 = "60点魔法"
	,jns_5 = "符之术技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2029120895
	,jns_8 = 2414938178
	}
skill取技能["侵蚀·失魂符·钻心"]={
	jns_1 = "令对手一定回合无法使用法术攻击，并降低物理防御力，持续6回合。"
	,jns_3 = 4
	,jns_4 = "60点魔法"
	,jns_5 = "符之术技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2029120895
	,jns_8 = 2414938178
	}
skill取技能["侵蚀·失魂符·噬魂"]={
	jns_1 = "令对手一定回合无法使用法术攻击，并降低物理防御力，持续6回合。"
	,jns_3 = 4
	,jns_4 = "60点魔法"
	,jns_5 = "符之术技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2029120895
	,jns_8 = 2414938178
	}
skill取技能["定身符"]={
	jns_1 = "使敌方目标无法使用普通攻击，并降低其防御和法防，持续7回合。"
	,jns_3 = 4
	,jns_4 = "60点魔法"
	,jns_5 = "符之术技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 170590832
	,jns_8 = 2539497909
	}
skill取技能["落雷符"]={
	jns_1 = "对敌方3个目标造成法术伤害。(对玩家使用时伤害为1)"
	,jns_3 = 4
	,jns_4 = "作用人数*30点魔法"
	,jns_5 = "“符之术”技能达到20级 "
	,jns_6 = "wzife.wd1"
	,jns_7 = 3476452217
	,jns_8 = 3226830020
	}
skill取技能["碎甲符"]={
	jns_1 = "降低敌方4个目标的防御和法防，持续5回合。"
	,jns_3 = 4
	,jns_4 = "50点魔法*目标数"
	,jns_5 = "人物飞升且“符之术”技能达到120级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 417555669
	,jns_8 = 3175526110
	}
skill取技能["归元咒"]={
	jns_1 = "消耗魔法值来补充自己的气血"
	,jns_3 = 2
	,jns_4 = "20点魔法"
	,jns_5 = "归元心法技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2473529751
	,jns_8 = 3090930843
	}
skill取技能["凝神术"]={
	jns_1 = "提高自身的封印成功率与封印成功率上限。"
	,jns_3 = 2
	,jns_4 = "50点魔法"
	,jns_5 = "归元心法技能达到100级"
	,jns_6 = "wzife.wd1"
	,jns_7 = 3869803971
	,jns_8 = 3077203266
	}
skill取技能["乾天罡气"]={
	jns_1 = "消耗气血来补充自己的魔法值"
	,jns_3 = 5
	,jns_4 = "20点气血"
	,jns_5 = "神道无念技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3309202999
	,jns_8 = 2018341630
	}
skill取技能["神兵护法"]={
	jns_1 = "平时状态下使用，临时赋予头盔/发钗提高命中的功效，下线后消失。"
	,jns_3 = 12
	,jns_4 = "和技能等级数相同的活力"
	,jns_5 = "神道无念技能达到35级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1217133207
	,jns_8 = 3100160960
	}
skill取技能["否极泰来"]={
	jns_1 = "复制敌方目标的部分增益状态。"
	,jns_3 = 4
	,jns_4 = "100点魔法，消耗一个金鸦火羽"
	,jns_6 = "wzife.wd3"
	,jns_7 = 2494574845
	,jns_8 = 2171889511
	,jns_12 = "12回合"
	}
skill取技能["分身术"]={
	jns_1 = "使自身免疫每回合的首次攻击，持续6回合。"
	,jns_3 = 2
	,jns_4 = "80点魔法"
	,jns_5 = "人物飞升且“神道无念”技能达到120级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 2099222596
	,jns_8 = 1436233235
	}
skill取技能["乙木仙遁"]={
	jns_1 = "平时状态下使用，可以瞬间回到自己的门派"
	,jns_3 = 0
	,jns_4 = "10点气血和10点魔法"
	,jns_5 = "斜月步技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 71432172
	,jns_8 = 436091648
	}
skill取技能["五雷正法"]={
	jns_1 = "浩然真气,感通天地。行持此符,可驱雷电。消耗所有“雷法”加持,使用五雷咒攻击目标。"
	,jns_3 = 4
	,jns_4 = "150点魔法"
	,jns_5 = "人物飞升且“神道无念”技能达到120级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 3103307429
	,jns_8 = 1116134864
	}
skill取技能["侵蚀·五雷正法·刻骨"]={
	jns_1 = "浩然真气,感通天地。行持此符,可驱雷电。消耗所有“雷法”加持,使用五雷咒攻击目标。"
	,jns_3 = 4
	,jns_4 = "150点魔法"
	,jns_5 = "人物飞升且“神道无念”技能达到120级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 3103307429
	,jns_8 = 1116134864
	}
skill取技能["侵蚀·五雷正法·噬魂"]={
	jns_1 = "浩然真气,感通天地。行持此符,可驱雷电。消耗所有“雷法”加持,使用五雷咒攻击目标。"
	,jns_3 = 4
	,jns_4 = "150点魔法"
	,jns_5 = "人物飞升且“神道无念”技能达到120级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 3103307429
	,jns_8 = 1116134864
	}
skill取技能["侵蚀·五雷正法·钻心"]={
	jns_1 = "浩然真气,感通天地。行持此符,可驱雷电。消耗所有“雷法”加持,使用五雷咒攻击目标。"
	,jns_3 = 4
	,jns_4 = "150点魔法"
	,jns_5 = "人物飞升且“神道无念”技能达到120级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 3103307429
	,jns_8 = 1116134864
	}
skill取技能["雷法·崩裂"]={
	jns_1 = "【功效】使用五雷咒攻击目标。转化当前的符咒为“雷法·崩裂”加持,每转化一枚符咒，五雷正法对主目标造成的伤害提高25%。"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "人物飞升且“神道无念”技能达到120级 "
	,jns_6 = "jntb.wdf"
	,jns_7 = 335544320
	,jns_8 = 335544320
	}
skill取技能["雷法·震煞"]={
	jns_1 = "【功效】使用五雷咒攻击目标。转化当前的符咒为“雷法震煞”加持,每转化一枚符咒，五雷正法攻击目标增加1个。"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "人物飞升且“神道无念”技能达到120级 "
	,jns_6 = "jntb.wdf"
	,jns_7 = 1476395008
	,jns_8 = 1476395008
	}
skill取技能["雷法·坤伏"]={
	jns_1 = "【功效】使用五雷咒攻击目标。转化当前的符咒为“雷法·坤伏”加持,每转化一枚符咒，五雷正法的法术暴击几率提升8%。"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "人物飞升且“神道无念”技能达到120级 "
	,jns_6 = "jntb.wdf"
	,jns_7 = 855638016
	,jns_8 = 855638016
	}
skill取技能["雷法·轰天"]={
	jns_1 = "【功效】使用五雷咒攻击目标。转化当前的符咒为“雷法·轰天”加持,每转化一枚符咒、五雷正法几率驱散目标的随机一个增益状态。"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "人物飞升且“神道无念”技能达到120级 "
	,jns_6 = "jntb.wdf"
	,jns_7 = 1946157056
	,jns_8 = 1946157056
	}
skill取技能["雷法·翻天"]={
	jns_1 = "【功效】使用五雷咒攻击目标。转化当前的符咒，每转化一枚符咒，五雷正法对召唤兽造成的伤害提高35%。"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "人物飞升且“神道无念”技能达到120级 "
	,jns_6 = "sjm.wdf"
	,jns_7 = 1424
	,jns_8 = 1424
	}
skill取技能["雷法·倒海"]={
	jns_1 = "【功效】使用五雷咒攻击目标。转化当前的符咒，每转化一枚符咒，五雷正法对玩家单位造成的伤害提高8%。"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "人物飞升且“神道无念”技能达到120级 "
	,jns_6 = "sjm.wdf"
	,jns_7 = 1417
	,jns_8 = 1417
	}
skill取技能["顺势而为"]={
	jns_1 = "精于封印的方寸弟子可以耗费一定的愤怒值对目标施加强大的法力，100％封印住那些没有抗封技能目标的法术能力，封印效果持续2回合"
	,jns_3 = 4
	,jns_4 = "60点愤怒"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x9E6FFF66
	,jns_8 = 0x9E6FFF66
	,jns_12 = "6回合"
	}
skill取技能["钟馗论道"]={
	jns_1 = "经脉介绍:为自己附加“钟馗论道”状态，获得下述效果，持续5回合:1)五雷咒伤害提高70%;2)该效果不会被驱散;3)回合结束时减少自身“锢魂术”“死亡召唤”1回合持续时间;。"
	,jns_2 = "【消耗】80点魔法，使用后仅保留1点气血【冷却】8回合，战斗开始时具有4回合冷却"
	,jns_3 = 2
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xB7CDB6AA
	,jns_8 = 0xB7CDB6AA
	,jns_12 = "8回合，战斗开始时具有4回合冷却"
	--花果山技能
	}
skill取技能["神通广大"]={
	jns_1 = "齐天大圣降妖伏魔，嫉恶如仇，其法术之高，神通广大，无所不能。通晓此技能，是本门修行的基础。"
	,jns_3 = 8
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300005
	,jns_8 = 0xE7300005
	}
skill取技能["如意金箍"]={
	jns_1 = "学习效果:提高角色的伤害"
	,jns_3 = 8
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300004
	,jns_8 = 0xE7300004
	}
skill取技能["齐天逞胜"]={
	jns_1 = "齐天大圣之名方可遂悟空之意，闹凌霄、撼东海、戏阎王，无一不为逞胜之举。花果山弟子均继承了此等威仪自信。"
	,jns_3 = 8
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300001
	,jns_8 = 0xE7300001
	}
skill取技能["金刚之躯"]={
	jns_1 = "学习效果:提高角色的防御"
	,jns_3 = 8
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300002
	,jns_8 = 0xE7300002
	}
skill取技能["灵猴九窍"]={
	jns_1 = "学习效果:提高角色的命中"
	,jns_3 = 8
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300003
	,jns_8 = 0xE7300003
	}
skill取技能["七十二变"]={
	jns_1 = "学习效果:提高角色的法伤和法防"
	,jns_3 = 8
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300009
	,jns_8 = 0xE7300009
	}
skill取技能["腾云驾霧"]={
	jns_1 = "以云雾飞行于天穹，自在无穷。"
	,jns_3 = 8
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300010
	,jns_8 = 0xE7300010
	}
skill取技能["威震凌霄"]={
	jns_1 = "灵霄宝殿惊玉皇，十万天军无可挡。被大圣选定的攻击目标，其勇气和攻势将大大减弱。对目标造成伤害，并降低目标物理/法术暴击等级。"
	,jns_3 = 4
	,jns_4 = "100点魔法"
	,jns_5 = "“神通广大”技能达到120级且角色飞升。"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300016
	,jns_8 = 0xE7300016
	}
skill取技能["气慑天军"]={
	jns_1 = "大闹天宫之际，虽有天军名将，仍震慑于大圣之气势，众人攻势均不能近其要害。对自己使用，大量提升抗物理/法术暴击等级。"
	,jns_3 = 2
	,jns_4 = "100点魔法"
	,jns_5 = "“神通广大”技能达到120级且角色飞升。"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300023
	,jns_8 = 0xE7300023
	}
skill取技能["当头一棒"]={
	jns_1 = "【如意神通】临时提升伤害攻击一个敌方单位，若目标气血百分比若处于60%至70%之间，则伤害加倍。"
	,jns_3 = 4
	,jns_4 = "75点魔法"
	,jns_5 = "“如意金箍”技能达到1级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300027
	,jns_8 = 0xE7300027
	,jns_9 = 1
	}
skill取技能["侵蚀·当头一棒·刻骨"]={
	jns_1 = "使用一次当头一棒，若目标气血比例为60%至70%之间，伤害提高至2.5（刻骨）/3（钻心）/4（噬魂）倍。随着侵蚀程度额外提高伤害。"
	,jns_3 = 4
	,jns_4 = "75点魔法"
	,jns_5 = "“如意金箍”技能达到1级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300027
	,jns_8 = 0xE7300027
	,jns_9 = 1
	}
skill取技能["侵蚀·当头一棒·钻心"]={
	jns_1 = "使用一次当头一棒，若目标气血比例为60%至70%之间，伤害提高至2.5（刻骨）/3（钻心）/4（噬魂）倍。随着侵蚀程度额外提高伤害。"
	,jns_3 = 4
	,jns_4 = "75点魔法"
	,jns_5 = "“如意金箍”技能达到1级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300027
	,jns_8 = 0xE7300027
	,jns_9 = 1
	}
skill取技能["侵蚀·当头一棒·噬魂"]={
	jns_1 = "使用一次当头一棒，若目标气血比例为60%至70%之间，伤害提高至2.5（刻骨）/3（钻心）/4（噬魂）倍。随着侵蚀程度额外提高伤害。"
	,jns_3 = 4
	,jns_4 = "75点魔法"
	,jns_5 = "“如意金箍”技能达到1级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300027
	,jns_8 = 0xE7300027
	,jns_9 = 1
	}
skill取技能["神针撼海"]={
	jns_1 = "【如意神通】对敌方5个目标发动物理攻击。"
	,jns_3 = 4
	,jns_4 = "75点魔法"
	,jns_5 = "“如意金箍”技能达到1级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 3878682665
	,jns_8 = 3878682665
	,jns_9 = 1
	}
skill取技能["杀威铁棒"]={
	jns_1 = "【如意神通】临时提高伤害，攻击敌方单个目标，并降低目标对自身造成的伤害，持续1回合。不会触发金甲仙衣、蟠龙玉璧等法宝效果。"
	,jns_3 = 4
	,jns_4 = "75点魔法"
	,jns_5 = "“如意金箍”技能达到1级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300025
	,jns_8 = 0xE7300025
	,jns_9 = 1
	}
skill取技能["泼天乱棒"]={
	jns_1 = "【如意神通】临时提高伤害，攻击敌方单个目标，若目标未阵亡。则额外溅射敌方3个单位，该效果不会触发保护。"
	,jns_3 = 4
	,jns_4 = "75点魔法"
	,jns_5 = "“如意金箍”技能达到1级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300026
	,jns_8 = 0xE7300026
	,jns_9 = 1
	}
skill取技能["九幽除名"]={
	jns_1 = "【如意神通】回合结束时，若自身处于倒地状态，则有几率复活(不受锢魂术影响)。成功率与技能等级相关。"
	,jns_3 = 2
	,jns_4 = "75点魔法"
	,jns_5 = "“齐天逞胜”技能达到1级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300024
	,jns_8 = 0xE7300024
	,jns_9 = 1
	}
skill取技能["移星换斗"]={
	jns_1 = "消耗气血恢复自身的魔法。"
	,jns_3 = 3
	,jns_4 = "30点气血"
	,jns_5 = "“齐天逞胜”技能达到15级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300028
	,jns_8 = 0xE7300028
	}
skill取技能["云暗天昏"]={
	jns_1 = "对敌方多个目标造成固定伤害，并提高自身的速度，持续2回合。"
	,jns_3 = 4
	,jns_4 = "75点魔法"
	,jns_5 = "“齐天逞胜”技能达到1级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300020
	,jns_8 = 0xE7300020
	,jns_9 = 1
	}
skill取技能["担山赶月"]={
	jns_1 = "力拔山河，肩挑日月，以盖世之力为项链附加力量。"
	,jns_3 = 3
	,jns_4 = "和技能等级相同点数的活力"
	,jns_5 = "“金刚之躯”技能达到35级且角色等级达到30级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300030
	,jns_8 = 0xE7300030
	}
skill取技能["铜头铁臂"]={
	jns_1 = "为自身施加一个护盾。护盾存在时间内，提高自身的伤害结果；通天行者流派效：提高自身的法术伤害结果。"
	,jns_3 = 2
	,jns_4 = "75点魔法"
	,jns_5 = "“金刚之躯”技能达到1级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300007
	,jns_8 = 0xE7300007
	,jns_9 = 1
	}
skill取技能["无所遁形"]={
	jns_1 = "效果:提高自身的暴击率和忽视防御的能力；通天行者行者流派:提高自身的法术暴击几率和忽视法术减免的能力。可叠加3层，持续8回合。"
	,jns_3 = 2
	,jns_4 = "75点魔法"
	,jns_5 = "“灵猴九窍”技能达到1级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300011
	,jns_8 = 0xE7300011
	,jns_9 = 1
	}
skill取技能["除光息焰"]={
	jns_1 = "克制女魅墓弟子的必杀技。"
	,jns_3 = 4
	,jns_4 = "150点愤怒"
	,jns_5 = "“灵猴九窍”技能达到25级且角色等级达到20级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300012
	,jns_8 = 0xE7300012
	}
skill取技能["呼子唤孙"]={
	jns_1 = "拔下一撮毫毛，一口仙气吹去，猴子猴孙纷纷来助。"
	,jns_3 = 2
	,jns_4 = "30点魔法"
	,jns_5 = "“七十二变”技能达到10级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300021
	,jns_8 = 0xE7300021
	}
skill取技能["八戒上身"]={
	jns_1 = "使敌方单个目标变身成一只可爱的小猪，并驱散目标的一个良性状态。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "“七十二变”技能达到45级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300022
	,jns_8 = 0xE7300022
	}
skill取技能["筋斗云"]={
	jns_1 = "一个筋斗十万八千里，无论在三界任一角落均可瞬间回到门派。"
	,jns_3 = 0
	,jns_4 = "10点气血、10点魔法"
	,jns_5 = "“腾云驾雾”技能达到1级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300013
	,jns_8 = 0xE7300013
	}
skill取技能["天地洞明"]={
	jns_1 = "(场地法术)使双方所有目标的气血条对敌方可见并缩短双方下达指令的时间。"
	,jns_3 = 2
	,jns_4 = "50点魔法，消耗一个金鸦火羽"
	,jns_5 = "化圣技能"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300017
	,jns_8 = 0xE7300017
	,jns_12 = "16回合"
	}
skill取技能["棒掀北斗"]={
	jns_1 = "【如意神通】大圣举棒掀翻北斗宫,回首振开南极院。霸道神威令对手闻风丧胆。【功效】对敌方单个目标造成法术伤害,暴击时额外造成伤害。"
	,jns_3 = 4
	,jns_4 = "75点魔法"
	,jns_6 = "jntb.wdf"
	,jns_7 = 301989888
	,jns_8 = 301989888
	,jns_9 = 1
	}
skill取技能["侵蚀·棒掀北斗·刻骨"]={
	jns_1 = "使用一次棒掀北斗，暴击几率增加10%（刻骨）/16%（钻心）/20%（噬魂）。随着侵蚀程度额外提高伤害。"
	,jns_3 = 4
	,jns_4 = "75点魔法"
	,jns_6 = "jntb.wdf"
	,jns_7 = 301989888
	,jns_8 = 301989888
	,jns_9 = 1
	}
skill取技能["侵蚀·棒掀北斗·钻心"]={
	jns_1 = "使用一次棒掀北斗，暴击几率增加10%（刻骨）/16%（钻心）/20%（噬魂）。随着侵蚀程度额外提高伤害。"
	,jns_3 = 4
	,jns_4 = "75点魔法"
	,jns_6 = "jntb.wdf"
	,jns_7 = 301989888
	,jns_8 = 301989888
	,jns_9 = 1
	}
skill取技能["侵蚀·棒掀北斗·噬魂"]={
	jns_1 = "使用一次棒掀北斗，暴击几率增加10%（刻骨）/16%（钻心）/20%（噬魂）。随着侵蚀程度额外提高伤害。"
	,jns_3 = 4
	,jns_4 = "75点魔法"
	,jns_6 = "jntb.wdf"
	,jns_7 = 301989888
	,jns_8 = 301989888
	,jns_9 = 1
	}
skill取技能["灵彻太虚"]={
	jns_1 = "【功效】对敌方单个目标造成法术伤害,并降低其物理暴击等级和法术暴击等级,持续3回合。"
	,jns_3 = 4
	,jns_4 = "100点魔法"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300018
	,jns_8 = 0xE7300018
	}
skill取技能["兴风作浪"]={
	jns_1 = "【功效】对敌方5个目标造成法术伤害,对首目标造成额外伤害。"
	,jns_3 = 4
	,jns_4 = "75点魔法"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1392508928
	,jns_8 = 1392508928
	,jns_9 = 1
	}
skill取技能["棍打诸神"]={
	jns_1 = "【功效】对所有敌方单位造成法术伤害。"
	,jns_3 = 4
	,jns_4 = "75点魔法"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300014
	,jns_8 = 0xE7300014
	,jns_9 = 1
	}
skill取技能["意马心猿"]={
	jns_1 = "【功效】对敌方单个目标造成法术伤害,并驱散1个持续回合最短的增益状态。若目标未阵亡,则额外对敌方3个单位造成溅射伤害。"
	,jns_3 = 4
	,jns_4 = "75点魔法"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300015
	,jns_8 = 0xE7300015
	,jns_9 = 1
	}
skill取技能["棒打雄风"]={
	jns_1 = "【如意神通】替换技能:杀威铁棒。临时提升伤害力攻击一个敌方单位，同时驱散目标的─个持续时间最短的增益状态。"
	,jns_3 = 4
	,jns_4 = "75点魔法"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1660944384
	,jns_8 = 1660944384
	,jns_9 = 1
	}
skill取技能["齐天神通"]={
	jns_1 = "花果山弟子逆天而立，战天斗地，每回合使用如意神通均有50%的几率额外释放—次，但临时降低30%的抵抗封印能力，状态持续8回合。(消耗60点愤怒值)"
	,jns_3 = 2
	,jns_4 = "60点愤怒"
	,jns_6 = "jntb.wdf"
	,jns_7 = 2013265920
	,jns_8 = 2013265920
	,jns_12 = "8回合"
	--化生寺技能
	}
skill取技能["金刚伏魔"]={
	jns_1 = "学习效果:提高角色的伤害"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2566898861
	,jns_8 = 3862994147
	}
skill取技能["佛法无边"]={
	jns_1 = "使我方单个目标使用某些法术时有几率连续释放两次，持续5回合。"
	,jns_3 = 3
	,jns_4 = "150点魔法"
	,jns_5 = "人物飞升且“金刚伏魔”技能达到120级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 2286663605
	,jns_8 = 3100187427
	}
skill取技能["小乘佛法"]={
	jns_1 = "学习效果:提高角色的法伤和法防"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2925047058
	,jns_8 = 1573500785
	}
skill取技能["紫气东来"]={
	jns_1 = "克制普陀山弟子的必杀技"
	,jns_3 = 4
	,jns_4 = "150点愤怒值"
	,jns_5 = "小乘佛法技能达到25级，人物等级达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3576748561
	,jns_8 = 3918273363
	}
skill取技能["诵经"]={
	jns_1 = "佛家弟子大量的诵读经书，经书读多了，见了万事万物都想度化，不免会有些罗里罗嗦、唠里唠叨的。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1921499236
	,jns_8 = 3515981629
	}
skill取技能["唧唧歪歪"]={
	jns_1 = "类似“凡事都要以理服人，所以我不仅动手，还要动口。你听我细细道来……”这样的啰嗦，具有巨大的威力。"
	,jns_3 = 4
	,jns_4 = "5点气血，30点魔法，作用于多人时消耗魔法增加"
	,jns_5 = "诵经技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1856916618
	,jns_8 = 2374732908
	}
skill取技能["侵蚀·唧唧歪歪·刻骨"]={
	jns_1 = "类似“凡事都要以理服人，所以我不仅动手，还要动口。你听我细细道来……”这样的啰嗦，具有巨大的威力。"
	,jns_3 = 4
	,jns_4 = "5点气血，20点魔法，作用于多人时消耗魔法增加"
	,jns_5 = "诵经技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1856916618
	,jns_8 = 2374732908
	}
skill取技能["侵蚀·唧唧歪歪·钻心"]={
	jns_1 = "类似“凡事都要以理服人，所以我不仅动手，还要动口。你听我细细道来……”这样的啰嗦，具有巨大的威力。"
	,jns_3 = 4
	,jns_4 = "5点气血，20点魔法，作用于多人时消耗魔法增加"
	,jns_5 = "诵经技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1856916618
	,jns_8 = 2374732908
	}
skill取技能["侵蚀·唧唧歪歪·噬魂"]={
	jns_1 = "类似“凡事都要以理服人，所以我不仅动手，还要动口。你听我细细道来……”这样的啰嗦，具有巨大的威力。"
	,jns_3 = 4
	,jns_4 = "5点气血，20点魔法，作用于多人时消耗魔法增加"
	,jns_5 = "诵经技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1856916618
	,jns_8 = 2374732908
	}
skill取技能["佛光普照"]={
	jns_1 = "精研佛典，渐渐掌握其中的佛法神通，可为普渡众生、降伏妖魔打下良好的基础。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3599571341
	,jns_8 = 921854792
	}
skill取技能["达摩护体"]={
	jns_1 = "战斗中临时提高自己或队友的气血上限"
	,jns_3 = 3
	,jns_4 = "30点魔法"
	,jns_5 = "佛光普照技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1415107827
	,jns_8 = 3131800459
	}
skill取技能["功德无量"]={
	jns_1 = "佛语真言无量,智义无边,诵之能破封解印,救人渡己。【功效】使用后获得以下效果: 1)为目标友方解除一个封印异常;2)其造成的法术伤害提高,持续3回合,对自身使用时回合翻倍。"
	,jns_3 = 3
	,jns_4 = "400点魔法，消耗一个金鸦火羽"
	,jns_5 = "佛光普照技能达到30级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 2281701376
	,jns_8 = 2281701376
	,jns_12 = "12回合"
	}
skill取技能["六尘不染"]={
	jns_1 = "【功效】移除自身所有增益效果，每个增益效果回复自身一定气血。"
	,jns_3 = 3
	,jns_4 = "100点魔法"
	,jns_5 = "佛光普照技能达到30级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 2415919104
	,jns_8 = 2415919104
	}
skill取技能["金刚护法"]={
	jns_1 = "战斗中临时提高自己或队友的伤害力，技能等级较高后可作用于多人"
	,jns_3 = 3
	,jns_4 = "40点魔法"
	,jns_5 = "佛光普照技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 479962043
	,jns_8 = 3700736796
	}
skill取技能["侵蚀·嗔怒金刚·刻骨"]={
	jns_1 = "战斗中临时提高己方全体物理暴击率一回合"
	,jns_3 = 3
	,jns_4 = "40点魔法"
	,jns_5 = "佛光普照技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 479962043
	,jns_8 = 3700736796
	}
skill取技能["侵蚀·嗔怒金刚·钻心"]={
	jns_1 = "战斗中临时提高己方全体物理暴击率一回合"
	,jns_3 = 3
	,jns_4 = "40点魔法"
	,jns_5 = "佛光普照技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 479962043
	,jns_8 = 3700736796
	}
skill取技能["侵蚀·嗔怒金刚·噬魂"]={
	jns_1 = "战斗中临时提高己方全体物理暴击率一回合"
	,jns_3 = 3
	,jns_4 = "40点魔法"
	,jns_5 = "佛光普照技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 479962043
	,jns_8 = 3700736796
	}
skill取技能["韦陀护法"]={
	jns_1 = "战斗中临时提高自己或队友的命中，技能达到一定等级后可用于多人"
	,jns_3 = 3
	,jns_4 = "35点魔法"
	,jns_5 = "佛光普照技能等级达到20级以上"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2121060262
	,jns_8 = 2888289425
	}
skill取技能["歧黄之术"]={
	jns_1 = "为了让众生免受“生老病死”之困扰，化生寺的弟子苦心学习医术，以期拯救世人于水火"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2055755507
	,jns_8 = 93243227
	}
skill取技能["金刚护体"]={
	jns_1 = "战斗中临时提高自己或队友的防御力，技能达到一定等级后可用于多人"
	,jns_3 = 3
	,jns_4 = "30点魔法"
	,jns_5 = "佛光普照技能等级达到35级以上"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1377178114
	,jns_8 = 3453377621
	}
skill取技能["拈花妙指"]={
	jns_1 = "平时状态下使用，临时赋予靴子提升速度的功效，下线后消失。"
	,jns_3 = 12
	,jns_4 = "和技能等级数相同的活力"
	,jns_5 = "佛光普照技能达到35级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 177955034
	,jns_8 = 2841407500
	}
skill取技能["一苇渡江"]={
	jns_1 = "战斗中临时提高自己或队友的速度，技能达到一定等级后可用于多人"
	,jns_3 = 3
	,jns_4 = "30点魔法"
	,jns_5 = "佛光普照技能等级达到30级以上"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2822966564
	,jns_8 = 1136663058
	}
skill取技能["醍醐灌顶"]={
	jns_1 = "恢复友方目标的气血、气血上限，解除一个封印效果，增加少量愤怒并移除药性。"
	,jns_3 = 4
	,jns_4 = "400点魔法，消耗一个金鸦火羽"
	,jns_6 = "wzife.wd3"
	,jns_7 = 220585988
	,jns_8 = 47783851
	,jns_12 = "12回合"
	}
skill取技能["大慈大悲"]={
	jns_1 = "学习效果:提高角色的防御"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1267473253
	,jns_8 = 3966881348
	}
skill取技能["我佛慈悲"]={
	jns_1 = "复活倒地的的友方玩家。"
	,jns_3 = 3
	,jns_4 = "150点魔法"
	,jns_5 = "大慈大悲技能达到40级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1545297145
	,jns_8 = 266298194
	}
skill取技能["舍生取义"]={
	jns_1 = "效法佛祖舍身饲鹰，不顾自己的安危竭尽全力拯救世人，牺牲自身的防御和法防，恢复友方目标当前气血至气血上限。每使用一次降低自身法伤、法防与防御，直至战斗结束。"
	,jns_3 = 3
	,jns_4 = "150点魔法"
	,jns_5 = "人物飞升且“歧黄之术”技能达到120级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 1135928864
	,jns_8 = 1707332905
	}
skill取技能["妙悟"]={
	jns_1 = "【被动】醍瑚灌]顶额外在回合结束时回复目标损失的10%速度，持续3回合。\n【主动】回复目标一定气血(效果与大慈大悲等级、治疗能力相关)，同时回合结束回复目标损失的10%速度，持续3回合。"
	,jns_3 = 3
	,jns_4 = "50点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x2F3B9A81
	,jns_8 = 0x2F3B9A81
	,jns_12 = "2回合"
	}
skill取技能["推拿"]={
	jns_1 = "使用后可以恢复自身的气血和气血上限"
	,jns_3 = 5
	,jns_4 = "50点魔法，非战斗时减半"
	,jns_5 = "歧黄之术技能达到10级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 404486915
	,jns_8 = 4289032145
	}
skill取技能["妙手回春"]={
	jns_1 = "使用后可以恢复多人的气血上限"
	,jns_3 = 6
	,jns_4 = "80点魔法，非战斗时减半"
	,jns_5 = "歧黄之术技能达到40级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 416089174
	,jns_8 = 2939581056
	}
skill取技能["活血"]={
	jns_1 = "使用后可以恢复队友的气血和气血上限"
	,jns_3 = 3
	,jns_4 = "70点魔法，非战斗时减半"
	,jns_5 = "歧黄之术技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2432822176
	,jns_8 = 2865439591
	}
skill取技能["推气过宫"]={
	jns_1 = "本着仁慈之心的化生寺弟子，为普渡世人，研习医疗之术。可以恢复多人的状态。"
	,jns_3 = 3
	,jns_4 = "100点魔法，非战斗时减半"
	,jns_5 = "歧黄之术技能达到35级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 971215069
	,jns_8 = 2227035198
	}
skill取技能["救死扶伤"]={
	jns_1 = "使用后可以恢复多人的气血和气血上限"
	,jns_3 = 5
	,jns_4 = "150点魔法，非战斗时减半"
	,jns_5 = "歧黄之术技能达到50级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2043895215
	,jns_8 = 4157454265
	}
skill取技能["解毒"]={
	jns_1 = "解除友方目标中毒的状态"
	,jns_3 = 3
	,jns_4 = "40点魔法"
	,jns_5 = "歧黄之术技能达到15级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1966642136
	,jns_8 = 546423120
	}
skill取技能["渡世步"]={
	jns_1 = "按技能等级提高躲避力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2399184502
	,jns_8 = 2261339260
	}
skill取技能["佛门普渡"]={
	jns_1 = "平时状态下使用，可以瞬间回到自己的门派"
	,jns_3 = 0
	,jns_4 = "10点气血和10点魔法"
	,jns_5 = "渡世步技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2996697873
	,jns_8 = 3423122163
	}
skill取技能["谆谆教诲"]={
	jns_1 = "对敌方单个目标造成较高的法术伤害。"
	,jns_3 = 4
	,jns_4 = "45点魔法、20点愤怒"
	,jns_5 = "渡世步技能达到1级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1627389952
	,jns_8 = 1627389952
	,jns_12 = "8回合"
	}
skill取技能["渡劫金身"]={
	jns_1 = "给目标附加—个状态，持续2个回合或目标死亡。状态消失时，恢复目标一定气血、气血上限(效果与“大慈大悲”等级、治疗能力相关)。"
	,jns_3 = 8
	,jns_4 = "10点愤怒"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x3819B112
	,jns_8 = 0x3819B112
	,jns_12 = "4回合"
	}
skill取技能["诸天看护"]={
	jns_1 = "虔诚的信仰会带来更强大的力量。移除目标身上的来自于你的“金刚护法、金刚护体、一苇渡江”效果，增加目标单位1.5%×(1+被移除的状态数量)的物法伤害，持续到战斗结束。(最多增加12%)"
	,jns_3 = 3
	,jns_4 = "100点魔法，10点愤怒"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xED073209
	,jns_8 = 0xED073209
	,jns_12 = "8回合"
	--凌波城技能
	}
skill取技能["天地无极"]={
	jns_1 = "天地无极，浩气长舒。这是学习本门其他技能的基础。"
	,jns_3 = 8
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 2616462789
	,jns_8 = 3629430297
	}
skill取技能["九转玄功"]={
	jns_1 = "九转神功乃是玉虚道人亲授于二郎神杨战的神妙道法，修习此功法大成者，有刀枪不入，万法不侵之能。"
	,jns_3 = 8
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 1837364177
	,jns_8 = 1720159516
	}
skill取技能["武神显圣"]={
	jns_1 = "凌波城弟子可召唤上古神勇之力助战，其英豪勇武之气，可驱策风云，震慑三界妖异。"
	,jns_3 = 8
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 3229675127
	,jns_8 = 2285367568
	}
skill取技能["啸傲"]={
	jns_1 = "学习效果:提高角色的法伤和法防"
	,jns_3 = 8
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 1753145086
	,jns_8 = 796505945
	}
skill取技能["气吞山河"]={
	jns_1 = "学习效果:提高角色的伤害"
	,jns_3 = 8
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 4005775594
	,jns_8 = 1613219782
	}
skill取技能["诛魔"]={
	jns_1 = "学习效果:提高角色的防御"
	,jns_3 = 8
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 150136690
	,jns_8 = 2802612826
	}
skill取技能["法天象地"]={
	jns_1 = "学习效果:提高角色的命中"
	,jns_3 = 8
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 2858795509
	,jns_8 = 3937616310
	}
skill取技能["踏山裂石"]={
	jns_1 = "临时提升必杀几率对单个敌人进行物理攻击"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "“气吞山河”技能达到25级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0xF4DCF38F
	,jns_8 = 0x1C603FAE
	}
skill取技能["裂石"]={
	jns_1 = "对敌方单个目标发动物理攻击。增加1点战意。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "“气吞山河”技能达到25级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0xF4DCF38F
	,jns_8 = 0x1C603FAE
	}
skill取技能["断岳势"]={
	jns_1 = "对敌方单个目标发动2次物理攻击。"
	,jns_3 = 4
	,jns_4 = "50点魔法、1点战意"
	,jns_5 = "“气吞山河”技能达到35级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x5AA54949
	,jns_8 = 0x5C95AF41
	}
skill取技能["天崩地裂"]={
	jns_1 = "对敌方单个目标发动3次物理攻击，最后1次攻击不会触发保护。"
	,jns_3 = 4
	,jns_4 = "50点魔法、3点战意"
	,jns_5 = "“气吞山河”技能达到45级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x9ADAEA80
	,jns_8 = 0x3FB03390
	}
skill取技能["侵蚀·天崩地裂·刻骨"]={
	jns_1 = "无视战意使用一次天崩地裂，增加10%（刻骨）/16%（钻心）/20%（噬魂）的暴击几率。随着侵蚀程度额外提高伤害。"
	,jns_3 = 4
	,jns_4 = "50点魔法、3点战意"
	,jns_5 = "“气吞山河”技能达到45级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x9ADAEA80
	,jns_8 = 0x3FB03390
	}
skill取技能["侵蚀·天崩地裂·钻心"]={
	jns_1 = "无视战意使用一次天崩地裂，增加10%（刻骨）/16%（钻心）/20%（噬魂）的暴击几率。随着侵蚀程度额外提高伤害。"
	,jns_3 = 4
	,jns_4 = "50点魔法、3点战意"
	,jns_5 = "“气吞山河”技能达到45级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x9ADAEA80
	,jns_8 = 0x3FB03390
	}
skill取技能["侵蚀·天崩地裂·噬魂"]={
	jns_1 = "无视战意使用一次天崩地裂，增加10%（刻骨）/16%（钻心）/20%（噬魂）的暴击几率。随着侵蚀程度额外提高伤害。"
	,jns_3 = 4
	,jns_4 = "50点魔法、3点战意"
	,jns_5 = "“气吞山河”技能达到45级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x9ADAEA80
	,jns_8 = 0x3FB03390
	}
skill取技能["浪涌"]={
	jns_1 = "对敌方3个目标发动物理攻击，伤害倍率为65%。增加1点战意。"
	,jns_3 = 4
	,jns_4 = "作用目标数*20+10点魔法"
	,jns_5 = "“气吞山河”技能达到25级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0xCE61D91C
	,jns_8 = 0x1A289BEA
	}
skill取技能["惊涛怒"]={
	jns_1 = "对敌方4个目标发动物理攻击，伤害倍率为100%"
	,jns_3 = 4
	,jns_4 = "作用目标数*20点魔法+10、1点战意"
	,jns_5 = "“气吞山河”技能达到35级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0xB91C6953
	,jns_8 = 0xBE11779C
	}
skill取技能["翻江搅海"]={
	jns_1 = "对敌方6个目标发动物理攻击，伤害倍率为100%"
	,jns_3 = 4
	,jns_4 = "作用目标数*20点魔法+10、3点战意"
	,jns_5 = "“气吞山河”技能达到45级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x26419C11
	,jns_8 = 0x11879028
	}
skill取技能["腾雷"]={
	jns_1 = "对敌方单个目标发动物理攻击，并降低目标受到的气血和魔法回复效果。成功率受技能等级与目标等级之差影响。"
	,jns_3 = 4
	,jns_4 = "60点魔法、1点战意"
	,jns_5 = "“诛魔”技能达到120级，且人物飞升"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x569D01F7
	,jns_8 = 0x956BA0A2
	}
skill取技能["指地成钢"]={
	jns_1 = "克制无底洞弟子的必杀技"
	,jns_3 = 4
	,jns_4 = "150点愤怒"
	,jns_5 = "“诛魔”技能达到25级，人物等级达到20级。"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0xF4DCF38F
	,jns_8 = 0x1C603FAE
	}
skill取技能["不动如山"]={
	jns_1 = "使用后减少自身受到的法术伤害与物理伤害。持续1回合。"
	,jns_3 = 2
	,jns_4 = "150点魔法"
	,jns_5 = "“九转玄功”技能达到25级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0xD96F2331
	,jns_8 = 0x38C47290
	,jns_12 = "2回合"
	}
skill取技能["碎星诀"]={
	jns_1 = "提升物理伤害结果，持续一定回合。不能与镇魂诀同时存在。"
	,jns_3 = 2
	,jns_4 = "30点魔法"
	,jns_5 = "“武神显圣”技能达到30级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x136442C0
	,jns_8 = 0x5F8D7935
	}
skill取技能["天眼神通"]={
	jns_1 = "在天眼、智眼、怒眼中随机获得至少一个状态。智眼:回合结束时有概率额外获得一点战意;怒眼:惊涛怒、断岳式、翻江搅海、天崩地裂造成的伤害提高;天眼:暴击几率增加"
	,jns_3 = 2
	,jns_4 = "300点魔法、1点战意"
	,jns_5 = "天地无极技能≥30级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1224736768
	,jns_8 = 1224736768
	,jns_12 = "8回合"
	}
skill取技能["耳目一新"]={
	jns_1 = "经脉介绍:移除当前天眼神通的增益效果，并再次使用天眼神通，会优先获得不同的增益效果。"
	,jns_3 = 2
	,jns_4 = "300点魔法、30点愤怒、1点战意"
	,jns_5 = "天地无极技能≥30级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1744830464
	,jns_8 = 1744830464
	,jns_12 = "24回合"
	}
skill取技能["镇魂诀"]={
	jns_1 = "提升物理必杀几率，持续一定回合。 不能与碎星诀同时存在。"
	,jns_3 = 2
	,jns_4 = "5%的当前气血"
	,jns_5 = "“武神显圣”技能达到120级，且人物飞升"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x9E1580AA
	,jns_8 = 0xF808DCC6
	}
skill取技能["无穷妙道"]={
	jns_1 = "一定几率解除我方单个目标已中的无底洞封类状态。"
	,jns_3 = 5
	,jns_4 = "60点魔法"
	,jns_5 = "“法天象地”技能达到30级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0xAFDB81A4
	,jns_8 = 0x76FBBEEC
	}
skill取技能["纵地金光"]={
	jns_1 = "平时状态下使用，可以瞬间回到自己的门派。"
	,jns_3 = 0
	,jns_4 = "10点气血和10点魔法"
	,jns_5 = "“法天象地”技能达到1级。"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0xE6A2AA59
	,jns_8 = 0xFEF5D678
	}
skill取技能["无双战魂"]={
	jns_1 = "随机获得1~3点战意战意为0时效果更好。"
	,jns_3 = 2
	,jns_4 = "100点魔法，消耗一个金鸦火羽"
	,jns_6 = "wzife.wd3"
	,jns_7 = 679069867
	,jns_8 = 3525938545
	,jns_12 = "10回合"
	}
skill取技能["穿云破空"]={
	jns_1 = "平时状态下使用，临时赋予腰带提高物理伤害结果的功效，下线后消失。"
	,jns_3 = 9
	,jns_4 = "和技能等级相同的活力"
	,jns_5 = "“啸傲”技能达到35级，人物等级达到30级。 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 3294906395
	,jns_8 = 3294906395
	}
skill取技能["天神怒斩"]={
	jns_1 = "天神盛怒，以开天辟地之势，挥刀怒斩：1.增加25%暴击几率、忽略目标25%防御发动─次物理攻击，命中后驱散目标随机个增益状态。⒉.若自身战意为1，造成额外50%伤害，否则造成25%额外伤害。3.每次使用后本场战斗该技能伤害永久提高25%(目标为NPC时为50%)4.使用天崩地裂和翻江搅海会减少这个技能1回合的冷却回合。"
	,jns_3 = 4
	,jns_4 = "300点魔法"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0xA8AF3DC0
	,jns_8 = 0xA8AF3DC0
	,jns_4 = "10回合，战斗开始时具有5回合冷却"
	}
skill取技能["真君显灵"]={
	jns_1 = "经脉介绍:敲动战鼓，一鼓作气拿下敌人。消耗自身所有(≥1)战意进入“真君显灵”状态，持续3回合(不可驱散)︰使自己造成的物理伤害增加(20%×使用时消耗战意数)﹔消耗的超级战意使该效果翻倍。回合结束时获得1点战意。"
	,jns_4 = "100点魔法，自身所有战意"
	,jns_3 = 2
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x4017404F
	,jns_8 = 0x4017404F
	,jns_12 = "8回合"
	--龙宫技能
	}
skill取技能["破浪诀"]={
	jns_1 = "学习效果:提高角色的伤害"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 4132491653
	,jns_8 = 3313121721
	}
skill取技能["龙附术"]={
	jns_1 = "做为“四灵”之首的龙，本身就有着不可思议的力量，同时也有着一些神秘的技能。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3715378746
	,jns_8 = 3758617445
	}
skill取技能["神龙摆尾"]={
	jns_1 = "持续一定回合的防御性法术，拥有该效果时施法者减少20%所承受的物理伤害。"
	,jns_3 = 2
	,jns_4 = "100点魔法"
	,jns_5 = "人物飞升且“破浪诀”技能达到120级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1562612473
	,jns_8 = 2539345287
	}
skill取技能["九龙诀"]={
	jns_1 = "学习效果:提高角色的法伤和法防"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 140291603
	,jns_8 = 923894374
	}
skill取技能["清心"]={
	jns_1 = "解除我方单个目标的中毒状态。成功率受技能等级与目标等级之差影响。"
	,jns_3 = 3
	,jns_4 = "30点魔法"
	,jns_5 = "九龙诀技能达到15级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 22613468
	,jns_8 = 3563353856
	}
skill取技能["二龙戏珠"]={
	jns_1 = "对敌方2个目标造成法术伤害。"
	,jns_3 = 4
	,jns_4 = "70点魔法"
	,jns_5 = "人物飞升且“九龙诀”技能达到120级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1266218218
	,jns_8 = 630766288
	}
skill取技能["解封"]={
	jns_1 = "解除我方单个目标已中的女儿村封类状态。成功率受技能等级与目标等级之差影响。"
	,jns_3 = 3
	,jns_4 = "60点魔法"
	,jns_5 = "九龙诀技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2555181368
	,jns_8 = 1807191850
	}
skill取技能["呼风唤雨"]={
	jns_1 = "“行云布雨，泽润万物”可以说是龙宫弟子最基本的手段，也是防身御敌的有利武器。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 438165716
	,jns_8 = 1919875705
	}
skill取技能["龙卷雨击"]={
	jns_1 = "施展法术攻击对方，技能达到一定等级后可攻击多人"
	,jns_3 = 4
	,jns_4 = "20*作用目标数点魔法"
	,jns_5 = "呼风唤雨技能达到15级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 201672841
	,jns_8 = 842454497
	}
skill取技能["侵蚀·龙卷雨击·刻骨"]={
	jns_1 = "使用一次龙卷雨击，对气血越低的单位造成的伤害提高，最多提升20%。随着侵蚀程度额外提高伤害。"
	,jns_3 = 4
	,jns_4 = "20*作用目标数点魔法"
	,jns_5 = "呼风唤雨技能达到15级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 201672841
	,jns_8 = 842454497
	}
skill取技能["侵蚀·龙卷雨击·钻心"]={
	jns_1 = "使用一次龙卷雨击，对气血越低的单位造成的伤害提高，最多提升32%。随着侵蚀程度额外提高伤害。"
	,jns_3 = 4
	,jns_4 = "20*作用目标数点魔法"
	,jns_5 = "呼风唤雨技能达到15级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 201672841
	,jns_8 = 842454497
	}
skill取技能["侵蚀·龙卷雨击·噬魂"]={
	jns_1 = "使用一次龙卷雨击，对气血越低的单位造成的伤害提高，最多提升40%。随着侵蚀程度额外提高伤害。"
	,jns_3 = 4
	,jns_4 = "20*作用目标数点魔法"
	,jns_5 = "呼风唤雨技能达到15级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 201672841
	,jns_8 = 842454497
	}
skill取技能["龙战于野"]={
	jns_1 = "降低自身法防并提高法伤，使用龙卷雨击、龙腾、亢龙归海时额外消耗350点魔法并提高16%伤害结果。"
	,jns_3 = 2
	,jns_4 = "100点魔法，消耗一个金鸦火羽"
	,jns_6 = "wzife.wd3"
	,jns_7 = 830551480
	,jns_8 = 3422758826
	,jns_12 = "16回合"
	}
skill取技能["龙腾术"]={
	jns_1 = "“龙者，万物之灵也。”龙宫的弟子在战斗中可以借助龙神的力量强化自己。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3471484278
	,jns_8 = 2151837087
	}
skill取技能["龙腾"]={
	jns_1 = "对敌方单个目标造成法术伤害。"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "龙腾术技能达到50级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2093346600
	,jns_8 = 3650312562
	}
skill取技能["逆鳞术"]={
	jns_1 = "学习效果:提高角色的防御"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3104091414
	,jns_8 = 3406230011
	}
skill取技能["逆鳞"]={
	jns_1 = "提高自身的伤害，持续8回合(与目标等级相关)"
	,jns_3 = 2
	,jns_4 = "40点魔法"
	,jns_5 = "逆鳞技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1493556934
	,jns_8 = 3804853170
	}
skill取技能["游龙术"]={
	jns_1 = "学习效果:提高角色的躲避"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1730135660
	,jns_8 = 316450658
	}
skill取技能["水遁"]={
	jns_1 = "平时或战斗中使用，可以瞬间回到自己的门派"
	,jns_3 = 0
	,jns_4 = "战斗时消耗当前所有魔法，非战斗时消耗10点气血、魔法"
	,jns_5 = "游龙术技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 596614171
	,jns_8 = 2671300567
	}
skill取技能["乘风破浪"]={
	jns_1 = "战斗中增加自己或队友的躲避力"
	,jns_3 = 3
	,jns_4 = "40点魔法"
	,jns_5 = "游龙术技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 90073709
	,jns_8 = 3228417140
	}
skill取技能["龙吟"]={
	jns_1 = "龙啸九天，使用后可以减少对方全体队员一定的气血和魔法值"
	,jns_3 = 2
	,jns_4 = "30点魔法"
	,jns_5 = "龙附技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1318499395
	,jns_8 = 2137943042
	}
skill取技能["龙啸九天"]={
	jns_1 = "克制盘丝洞弟子的必杀技"
	,jns_3 = 4
	,jns_4 = "150点愤怒值"
	,jns_5 = "龙附技能达到25级，人物等级达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3644673853
	,jns_8 = 2124753589
	}
skill取技能["龙附"]={
	jns_1 = "平时状态下使用，临时赋予武器提高伤害的功效，下线后消失。"
	,jns_3 = 12
	,jns_4 = "和技能等级数相同的活力"
	,jns_5 = "龙附技能达到35级，人物等级达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2888970157
	,jns_8 = 1784954158
	}
skill取技能["亢龙归海"]={
	jns_1 = "矫健的神龙翻腾四海的英姿很少有人目睹，而之后更无人能够道出其中的神威。使用龙腾连续攻击2次目标，每次造成龙腾伤害的95%，使用后休息1回合。"
	,jns_3 = 4
	,jns_4 = "200点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xCE07792D
	,jns_8 = 0xCE07792D
	,jns_12 = "6回合，战斗开始时具有3回合冷却"
	}
skill取技能["雷浪穿云"]={
	jns_1 = "当那天地间卷起的白浪与电闪中的云彩揉成一片，任谁都无力承当神龙见首不见尾的后续打击。对目标使用后，目标在5回合内遭受的所有法术伤害增加30%，使用法术技能消耗MP增加100%+30点。"
	,jns_3 = 4
	,jns_4 = "60点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x77EC444B
	,jns_8 = 0x77EC444B
	}
skill取技能["潜龙在渊"]={
	jns_1 = "移除自身“龙魂”和“龙骇”状态，每个被移除状态使你获得1层以下对应增益，持续到战斗结束:龙魂:造成的法术伤害提高1%。龙骇:对应被增益的龙腾或龙卷雨击伤害提高2%。(不可驱散)"
	,jns_3 = 2
	,jns_4 = "100点魔法"
	,jns_6 = "jntb.wdf"
	,jns_7 = 2030043136
	,jns_8 = 2030043136
	,jns_12 = "8回合"
	---魔王寨技能
	}
skill取技能["震天诀"]={
	jns_1 = "学习效果:提高角色的伤害"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1449209742
	,jns_8 = 1917106392
	}
skill取技能["牛逼神功"]={
	jns_1 = "俗话说“兔子急了也会咬人”，况乎牛哉。当牛魔被逼到绝境时，往往能够激发出巨大的潜能。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3975126128
	,jns_8 = 2741787302
	}
skill取技能["魔王护持"]={
	jns_1 = "平时状态下使用，临时赋予武器提高气血上限的功效，下线后消失。"
	,jns_3 = 12
	,jns_4 = "和技能等级数相同的活力"
	,jns_5 = "牛逼神功技能达到35级，人物等级达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 937481251
	,jns_8 = 3778438121
	}
skill取技能["风云变色"]={
	jns_1 = "释放一次强力的飞砂走石，额外作用一个单位。"
	,jns_3 = 4
	,jns_4 = "30点魔法，攻击多人时消耗增加"
	,jns_6 = "jntb.wdf"
	,jns_7 = 2248146944
	,jns_8 = 2248146944
	,jns_12="4回合"
	}
skill取技能["火云术"]={
	jns_1 = "烈火燎天，狂风盘旋。通过驱风御火来攻击对手，是魔王赛的独门技能。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 4166858964
	,jns_8 = 909252202
	}
skill取技能["飞砂走石"]={
	jns_1 = "使用后可以攻击对方多个对象"
	,jns_3 = 4
	,jns_4 = "30点魔法，攻击多人时消耗增加"
	,jns_5 = "火云术技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 706133968
	,jns_8 = 746568918
	}
skill取技能["火甲术"]={
	jns_1 = "使自身受到法术攻击时，会使用三昧真火反击，持续6回合。"
	,jns_3 = 66
	,jns_4 = "60点魔法"
	,jns_5 = "人物飞升且“火云术”技能达到120级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 2418820008
	,jns_8 = 3223806685
	}
skill取技能["三昧真火"]={
	jns_1 = "魔王修炼而成的三昧真火，由一点丹田元气化成，威力非凡间火可比。"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "火云术技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 626159438
	,jns_8 = 290397996
	}
skill取技能["魔火焚世"]={
	jns_1 = "自身气血≥50%方可使用，临时提高自身法伤使用一次飞砂走石。"
	,jns_3 = 4
	,jns_4 = "400点魔法，消耗一个金鸦火羽"
	,jns_6 = "wzife.wd3"
	,jns_7 = 3167155447
	,jns_8 = 0x82933a2e
	,jns_12 = "6回合"
	}
skill取技能["火牛阵"]={
	jns_1 = "学习效果:提高角色的法伤和法防"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1917391753
	,jns_8 = 1358009688
	}
skill取技能["牛劲"]={
	jns_1 = "牛被激怒后往往爆发出可怕的力量，这就是牛劲的恐怖之处"
	,jns_3 = 2
	,jns_4 = "20点魔法"
	,jns_5 = "火牛阵技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3521936089
	,jns_8 = 1080213476
	}
skill取技能["踏山裂石"]={
	jns_1 = "克制化生寺弟子的必杀技"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "火牛阵技能达到120级，且人物飞升"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4060498152
	,jns_8 = 2813097952
	}
skill取技能["牛虱阵"]={
	jns_1 = "牛魔有了一定修为以后，身上密密麻麻的牛虱也会变幻成特殊的生灵，有着非同一般的力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1129585606
	,jns_8 = 2492840335
	}
skill取技能["摇头摆尾"]={
	jns_1 = "对敌方目标施放一个持续燃烧的火焰，持续5回合:随后发动一次法术攻击，随机触发三昧真火或飞砂走石。"
	,jns_3 = 4
	,jns_4 = "80点魔法"
	,jns_5 = "人物飞升且“牛虱阵”技能达到120级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 3051115375
	,jns_8 = 1777991632
	}
skill取技能["无敌牛虱"]={
	jns_1 = "召唤使用普通攻击的牛虱协助战斗"
	,jns_3 = 4
	,jns_4 = "40点魔法"
	,jns_5 = "牛虱阵技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3889342201
	,jns_8 = 901977927
	}
skill取技能["无敌牛妖"]={
	jns_1 = "召唤使用法术攻击的牛妖协助战斗"
	,jns_3 = 5
	,jns_4 = "40点魔法"
	,jns_5 = "牛虱阵技能达到25级"
	,jns_6 = "wzife.wd1"
	,jns_7 = 526953932
	,jns_8 = 2771934779
	}
skill取技能["回身击"]={
	jns_1 = "学习效果:提高角色的防御"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1224508814
	,jns_8 = 2667913913
	}
skill取技能["魔王回首"]={
	jns_1 = "使用后可以在受到物理攻击的时候自动反击"
	,jns_3 = 2
	,jns_4 = "30点魔法"
	,jns_5 = "回身击技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 995890213
	,jns_8 = 3043919056
	}
skill取技能["裂石步"]={
	jns_1 = "学习效果:提高角色的躲避"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 4286232830
	,jns_8 = 3339537828
	}
skill取技能["牛屎遁"]={
	jns_1 = "平时状态下使用，可以瞬间回到自己的门派"
	,jns_3 = 0
	,jns_4 = "10点气血和10点魔法"
	,jns_5 = "裂石步技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2481624731
	,jns_8 = 668274006
	}
skill取技能["秘传三昧真火"]={
	jns_1 = "牛魔王的秘传法术之一，修炼至极致的丹田元气，威力非普通的三昧真火可比拟。对单个敌方目标造成极高的法术伤害。"
	,jns_3 = 4
	,jns_4 = "60点魔法"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1375731712
	,jns_8 = 1375731712
	,jns_12="8回合，战斗开始时具有4回合冷却"
	}
skill取技能["烈火真言"]={
	jns_1 = "【被动】进入战斗后，随机获得一个“秘传法术”:替换你的三昧真火为秘传三昧真火，或替换你的飞砂走石为秘传飞砂走石;其冷却回合皆增加至10回合。【主动】通过刻苦的练习，能够在战斗中灵活的切换激活的秘传法术，但切换后秘传法术会立即进入冷却。"
	,jns_3 = 2
	,jns_4 = "100点魔法"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1979711488
	,jns_8 = 1979711488
	}
skill取技能["风火燎原"]={
	jns_1 = "经脉介绍:聆听牛魔王的秘传之咒，让魔王的意志降临于你。获得持续5回合的“牛劲”和“风火燎原”状态。风火燎原:回合结束时，秘传三昧真火或秘传飞砂走石冷却时间减少1。"
	,jns_3 = 2
	,jns_4 = "50点魔法"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1761607680
	,jns_8 = 1761607680
	,jns_12="8回合，战斗开始时具有4回合冷却"
	}
skill取技能["秘传飞砂走石"]={
	jns_1 = "牛魔王的秘传法术之一，可以卷起狂风砂石，甚至可以摧毁山峰。施放一次强力的飞砂走石。"
	,jns_3 = 4
	,jns_4 = "(60×作用人数)点魔法"
	,jns_6 = "jntb.wdf"
	,jns_7 = 905969664
	,jns_8 = 905969664
	,jns_12="8回合，战斗开始时冷却4回合"
	}
--	jns_1 = ""
	-- ,jns_3 = 108
	-- ,jns_6 = "wzife.wdf"
	-- ,jns_7 = 867595182
	-- ,jns_8 = 3889225756
	-- }
skill取技能["魔焰滔天"]={
	jns_1 = "经脉介绍：为了能给敌人造成更大的伤害，魔王寨的弟子是不怕赌上自己运气的。使用法术攻击目标，70％几率造成三昧真火法术伤害×175％，30％几率造成三昧真火法术伤害×25％。不受佛法无边影响。"
	,jns_3 = 4
	,jns_4 = "60点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x525B9DB0
	,jns_8 = 0x525B9DB0
	,jns_12="6回合，战斗开始时具有3回合冷却"
	--女儿村技能
	}
skill取技能["毒经"]={
	jns_1 = "学习效果:提高角色的伤害"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3161058590
	,jns_8 = 1458078261
	}
skill取技能["倾国倾城"]={
	jns_1 = "古代美女赵飞燕在汉宫所创舞蹈，非常美丽的舞姿，惋若雏燕腾空，仙鹤起舞。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 594113044
	,jns_8 = 3862994147
	}
skill取技能["楚楚可怜"]={
	jns_1 = "使自身进入隐身状态但也无法进行多数行动"
	,jns_3 = 2
	,jns_4 = "30点魔法"
	,jns_5 = "倾国倾城技能达到10级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3842255938
	,jns_8 = 952615752
	}
skill取技能["一笑倾城"]={
	jns_1 = "使敌方3个目标无法使用法术，持续2回合。"
	,jns_3 = 4
	,jns_4 = "60点魔法"
	,jns_5 = "人物飞升且“倾国倾城”技能达到120级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 3266381545
	,jns_8 = 522280593
	}
skill取技能["红袖添香"]={
	jns_1 = "提高我方多个目标的躲避。"
	,jns_3 = 3
	,jns_4 = "30点魔法"
	,jns_5 = "倾国倾城技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 547746768
	,jns_8 = 1757842178
	}
skill取技能["情天恨海"]={
	jns_1 = "克制五庄观弟子的必杀技"
	,jns_3 = 4
	,jns_4 = "150点愤怒值"
	,jns_5 = "沉鱼落雁技能达到25级，人物等级达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1898550998
	,jns_8 = 2472450541
	}
skill取技能["雨落寒沙"]={
	jns_1 = "消耗一定魔法对目标造成暗器伤害。"
	,jns_3 = 4
	,jns_4 = "作用人数*20点魔法"
	,jns_5 = "沉鱼落雁技能达到20级"
	,jns_6 = "wzife.wd1"
	,jns_7 = 2465624576
	,jns_8 = 562574867
	}
skill取技能["沉鱼落雁"]={
	jns_1 = "根据古代宫廷舞女的舞姿演化而来，以轻盈优美的身形，幻化出勾人心魄的魅力，令人如醉如痴。随着技能提升增加暗器伤害和作用目标数。当队伍中女儿村弟子数大于等于3目自身处于被封印法术状态时，暗器只会作用一个目标。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 370722733
	,jns_8 = 1052773261
	}
skill取技能["满天花雨"]={
	jns_1 = "提高自身伤害力(最多叠加3次，持续到战斗结束)攻击敌方单个目标，有几率使目标中毒。"
	,jns_3 = 4
	,jns_4 = "40点魔法"
	,jns_5 = "沉鱼落雁技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2270504354
	,jns_8 = 1714354841
	}
skill取技能["花谢花飞"]={
	jns_1 = "经脉介绍:连续使用2次满天花雨攻击目标。"
	,jns_4 = "100点魔法"
	,jns_3 = 4
	,jns_6 = "jntb.wdf"
	,jns_7 = 603979776
	,jns_8 = 603979776
	,jns_12 = "16回合，战斗开始时具有8回合冷却"
	}
skill取技能["子母神针"]={
	jns_1 = "使用暗器随机攻击两个敌方目标。"
	,jns_3 = 4
	,jns_4 = "35点魔法、30点愤怒"
	,jns_5 = "沉鱼落雁技能达到25级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1644167168
	,jns_8 = 1644167168
	}
skill取技能["闭月羞花"]={
	jns_1 = "生长在女儿村这个物华天宝之地，吸取大地百花之精华，所拥有的独有技能，会有一些特别的神奇功能。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3321056507
	,jns_8 = 4213596062
	}
skill取技能["娉婷袅娜"]={
	jns_1 = "使敌方目标无法使用特技且被动法宝无法起效"
	,jns_3 = 4
	,jns_4 = "40点魔法"
	,jns_5 = "闭月羞花技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 768000231
	,jns_8 = 1404049159
	}
skill取技能["似玉生香"]={
	jns_1 = "令对手一定回合无法使用法术和普通攻击"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "闭月羞花技能等级达到40级以上"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2732466496
	,jns_8 = 3524410344
	}
skill取技能["侵蚀·似玉生香·刻骨"]={
	jns_1 = "临时提高封印命中率和额外1回合令对手一定回合无法使用法术和普通攻击"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "闭月羞花技能等级达到40级以上"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2732466496
	,jns_8 = 3524410344
	}
skill取技能["侵蚀·似玉生香·钻心"]={
	jns_1 = "临时提高封印命中率和额外2回合令对手一定回合无法使用法术和普通攻击"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "闭月羞花技能等级达到40级以上"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2732466496
	,jns_8 = 3524410344
	}
skill取技能["侵蚀·似玉生香·噬魂"]={
	jns_1 = "临时提高封印命中率和额外3回合令对手一定回合无法使用法术和普通攻击"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "闭月羞花技能等级达到40级以上"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2732466496
	,jns_8 = 3524410344
	}
skill取技能["如花解语"]={
	jns_1 = "令对手一定回合无法使用普通攻击"
	,jns_3 = 4
	,jns_4 = "35点魔法"
	,jns_5 = "闭月羞花技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1912374008
	,jns_8 = 1283470548
	}
skill取技能["莲步轻舞"]={
	jns_1 = "令对手一定回合无法使用法术"
	,jns_3 = 4
	,jns_4 = "40点魔法"
	,jns_5 = "闭月羞花技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3508375370
	,jns_8 = 4243867972
	}
skill取技能["月下霓裳"]={
	jns_1 = "令敌方目标3回合内无法召唤召唤兽"
	,jns_3 = 4
	,jns_4 = "100点魔法"
	,jns_6 = "wzife.wd3"
	,jns_7 = 4257633385
	,jns_8 = 3293272905
	,jns_12 = "6回合"
	}
skill取技能["香飘兰麝"]={
	jns_1 = "学习效果:提高角色的法伤和法防"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3531606030
	,jns_8 = 1383632532
	}
skill取技能["轻如鸿毛"]={
	jns_1 = "平时状态下使用，临时赋予武器提高魔法上限的功效，下线后消失。"
	,jns_3 = 12
	,jns_4 = "和技能等级数相同的活力"
	,jns_5 = "香飘兰麝技能达到35级，人物等级达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 33492847
	,jns_8 = 367093981
	}
skill取技能["玉质冰肌"]={
	jns_1 = "学习效果:提高角色的防御"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3438751351
	,jns_8 = 2264853140
	}
skill取技能["百毒不侵"]={
	jns_1 = "解毒并在一定回合内避免中毒"
	,jns_3 = 2
	,jns_4 = "30点魔法"
	,jns_5 = "玉质冰肌技能达到10级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 45388430
	,jns_8 = 938983833
	}
skill取技能["清歌妙舞"]={
	jns_1 = "学习效果:提高角色的速度"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1027945253
	,jns_8 = 2444515719
	}
skill取技能["飞花摘叶"]={
	jns_1 = "轻舒巧手，变化万千，能吸取对方的魔法为我方队员所使用。"
	,jns_3 = 4
	,jns_4 = "60点魔法"
	,jns_5 = "人物飞升且“清歌妙舞”技能达到120级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4065673057
	,jns_8 = 1962869359
	}
skill取技能["移形换影"]={
	jns_1 = "平时状态下使用，可以瞬间回到自己的门派"
	,jns_3 = 0
	,jns_4 = "10点气血和10点魔法"
	,jns_5 = "清歌妙舞技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2099222596
	,jns_8 = 1436233235
	}
skill取技能["花飞柳舞"]={
	jns_1 = "【功效】对目标发动一次强力攻击,每有一层“满天花雨”都将提高本次攻击的伤害,使用后清空层数;带有“自矜”时,伤害额外提高。"
	,jns_3 = 4
	,jns_4 = "100点魔法，消耗一个金鸦火羽"
	,jns_5 = "化圣技能"
	,jns_6 = "jntb.wdf"
	,jns_7 = 2298478592
	,jns_8 = 2298478592
	,jns_12 = "12回合"
	}
skill取技能["鸿渐于陆"]={
	jns_1 = "经脉介绍:伤其十指，不如断其一指，必要的时刻可町以将伤害凝聚起来,给予敌方一次致命的攻击。附加(武器伤害×130%)的伤害，对敌方单体进行暗器攻击，使目标100%几率中暗器每。"
	,jns_4 = "100点魔法"
	,jns_3 = 4
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x18D93692
	,jns_8 = 0x18D93692
	,jns_12 = "4回合"
	}
skill取技能["葬玉焚花"]={
	jns_1 = "一舞残花渐落,一念神消魂断。飞花化作无影利器,穿梭敌人之间。【功效】对4个目标造成物理伤害。"
	,jns_3 = 4
	,jns_4 = "(20*作用目标数+10)点魔法"
	,jns_5 = "清歌妙舞技能达到20级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1442840576
	,jns_8 = 1442840576
	}
skill取技能["侵蚀·葬玉焚花·刻骨"]={
	jns_1 = "一舞残花渐落,一念神消魂断。飞花化作无影利器,穿梭敌人之间。【功效】对4个目标造成物理伤害。"
	,jns_3 = 4
	,jns_4 = "(20*作用目标数+10)点魔法"
	,jns_5 = "清歌妙舞技能达到20级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1442840576
	,jns_8 = 1442840576
	}
skill取技能["侵蚀·葬玉焚花·噬魂"]={
	jns_1 = "一舞残花渐落,一念神消魂断。飞花化作无影利器,穿梭敌人之间。【功效】对4个目标造成物理伤害。"
	,jns_3 = 4
	,jns_4 = "(20*作用目标数+10)点魔法"
	,jns_5 = "清歌妙舞技能达到20级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1442840576
	,jns_8 = 1442840576
	}
skill取技能["侵蚀·葬玉焚花·钻心"]={
	jns_1 = "一舞残花渐落,一念神消魂断。飞花化作无影利器,穿梭敌人之间。【功效】对4个目标造成物理伤害。"
	,jns_3 = 4
	,jns_4 = "(20*作用目标数+10)点魔法"
	,jns_5 = "清歌妙舞技能达到20级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1442840576
	,jns_8 = 1442840576
	}
skill取技能["碎玉弄影"]={
	jns_1 = "“宁为玉碎，不为瓦全”，又有多少敌方可以从女儿村弟子曼妙的舞姿身影中体味那一份决绝呢？连续对敌方使用2次似玉生香。"
	,jns_3 = 4
	,jns_4 = "40点愤怒"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x347D755D
	,jns_8 = 0x347D755D
	,jns_12 = "5回合"
	--盘丝技能
	}
skill取技能["摄魄"]={
	jns_1 = "吸取敌方单个目标的魔法来恢复自身魔法，成功率受自身命中与目标躲避影响。"
	,jns_3 = 4
	,jns_4 = "35点魔法"
	,jns_5 = "秋波暗送技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2754572873
	,jns_8 = 103370656
	}
skill取技能["侵蚀·幻魇谜雾·刻骨"]={
	jns_1 = "使敌方所有目标本回合受到的来自玩家伤害提高15%（刻骨）/24%（钻心）/30%（噬魂）。随着侵蚀程度额外提高目标受到来自玩家的伤害。"
	,jns_3 = 4
	,jns_4 = "60点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x77EC444B
	,jns_8 = 0x77EC444B
	}
skill取技能["侵蚀·幻魇谜雾·噬魂"]={
	jns_1 = "使敌方所有目标本回合受到的来自玩家伤害提高15%（刻骨）/24%（钻心）/30%（噬魂）。随着侵蚀程度额外提高目标受到来自玩家的伤害。"
	,jns_3 = 4
	,jns_4 = "60点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x77EC444B
	,jns_8 = 0x77EC444B
	}
skill取技能["侵蚀·魔化万灵·钻心"]={
	jns_1 = "使敌方所有目标本回合受到的来自玩家伤害提高15%（刻骨）/24%（钻心）/30%（噬魂）。随着侵蚀程度额外提高目标受到来自玩家的伤害。"
	,jns_3 = 4
	,jns_4 = "60点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x77EC444B
	,jns_8 = 0x77EC444B
	}
skill取技能["秋波暗送"]={
	jns_1 = "学习效果:提高角色的命中"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1698608098
	,jns_8 = 975668103
	}
skill取技能["勾魂"]={
	jns_1 = "吸取敌方单个目标的气血来恢复自身气血，成功率受自身命中与目标躲避影响。"
	,jns_3 = 4
	,jns_4 = "40点魔法"
	,jns_5 = "秋波暗送技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3333121941
	,jns_8 = 802455732
	}
skill取技能["天外魔音"]={
	jns_1 = "学习效果:提高角色的法伤和法防"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3819811307
	,jns_8 = 2331712128
	}
skill取技能["蛛丝阵法"]={
	jns_1 = "学习效果:提高角色的防御"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 487492946
	,jns_8 = 2233726885
	}
skill取技能["盘丝舞"]={
	jns_1 = "平时状态下使用，临时赋予武器提高防御的功效。下线后消失。"
	,jns_3 = 12
	,jns_4 = "和技能等级数相同的活力"
	,jns_5 = "蛛丝阵法技能达到35级，人物等级达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2082714040
	,jns_8 = 382164728
	}
skill取技能["夺命蛛丝"]={
	jns_1 = "克制方寸山弟子的必杀技"
	,jns_3 = 4
	,jns_4 = "150点愤怒值"
	,jns_5 = "蛛丝阵法技能达到25级，人物等级达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 227632678
	,jns_8 = 3268216546
	}
skill取技能["迷情大法"]={
	jns_1 = "利用敌人迷茫的一面，配以媚惑的目光和悦耳的声音，能够引起对手深深的困惑和无限遐想。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2410267095
	,jns_8 = 3102396352
	}
skill取技能["含情脉脉"]={
	jns_1 = "令对手一定回合内概率无法使用普通攻击和法术"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "催情大法技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4111305818
	,jns_8 = 2589491420
	}
skill取技能["瘴气"]={
	jns_1 = "临时降低对手接受治疗的效果"
	,jns_3 = 4
	,jns_4 = "30点魔法×作用人数"
	,jns_5 = "人物飞升且“迷情大法”技能达到120级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3039047760
	,jns_8 = 3862934535
	}
skill取技能["魔音摄魂"]={
	jns_1 = "使敌方目标无法接受气血和气血上限治疗"
	,jns_3 = 4
	,jns_4 = "40点魔法"
	,jns_5 = "迷情大法技能达到45级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 32064057
	,jns_8 = 1554838399
	}
skill取技能["盘丝大法"]={
	jns_1 = "学习效果:提高角色的伤害"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2544956347
	,jns_8 = 136964443
	}
skill取技能["盘丝阵"]={
	jns_1 = "提升自身的防御力"
	,jns_3 = 2
	,jns_4 = "40点魔法"
	,jns_5 = "盘丝大法技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2395356970
	,jns_8 = 1769215086
	}
skill取技能["复苏"]={
	jns_1 = "解除我方单个目标已中的天宫封类状态，并使目标不会再中相应状态"
	,jns_3 = 5
	,jns_4 = "60点魔法"
	,jns_5 = "盘丝大法技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 141266175
	,jns_8 = 2870523056
	}
skill取技能["媚眼如丝"]={
	jns_1 = "(场地法术)每回合结束时，将双方所有单位部分魔法转为气血并使所有单位造成的伤害减少10%，持续3回合。"
	,jns_3 = 2
	,jns_4 = "50点魔法，消耗一个金鸦火羽"
	,jns_6 = "wzife.wd3"
	,jns_7 = 1413976393
	,jns_8 = 3300168132
	,jns_12 = "16回合"
	}
skill取技能["盘丝步"]={
	jns_1 = "学习效果:提高角色的躲避"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3406981495
	,jns_8 = 337337940
	}
skill取技能["天罗地网"]={
	jns_1 = "对敌方1(3个目标造成固定伤害(括号中是以NPC为目标时的效果)；同时有几率使目标速度降低，持续4回合。"
	,jns_3 = 4
	,jns_4 = "30点魔法，攻击多人时消耗增加"
	,jns_5 = "盘丝步技能达到15级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1653509465
	,jns_8 = 1457394081
	}
skill取技能["幻镜术"]={
	jns_1 = "将部分法术攻击转移至敌方随机目标上，持续1回合。"
	,jns_3 = 2
	,jns_4 = "50点愤怒"
	,jns_5 = "人物飞升且“盘丝步”技能达到120级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1134668132
	,jns_8 = 605963427
	}
skill取技能["天蚕丝"]={
	jns_1 = "平时状态下使用，可以瞬间回到自己的门派"
	,jns_3 = 0
	,jns_4 = "10点气血和10点魔法"
	,jns_5 = "盘丝步技能达到1级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 1283246148
	,jns_8 = 1806917376
	}
skill取技能["姊妹相随"]={
	jns_1 = "云影，云霓姐妹携手所创的技能，当年她们就是用这一技艺合战力大无穷的牛魔王的。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3177731283
	,jns_8 = 597142503
	}
skill取技能["姐妹同心"]={
	jns_1 = "战斗中使用，可以减少对手的魔法值"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "姊妹相随技能达到20级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 42398851
	,jns_8 = 502149406
	}
skill取技能["千蛛噬魂"]={
	jns_1 = "【功效】对3个目标造成物理伤害;对带有你的“天罗地网”状态的目标造成额外伤害。"
	,jns_3 = 4
	,jns_4 = "(20*作用目标数+10)点魔法"
	,jns_5 = "蛛丝大法技能达到10级 "
	,jns_6 = "jntb.wdf"
	,jns_7 = 1107296256
	,jns_8 = 1107296256
	}
skill取技能["侵蚀·千蛛噬魂·刻骨"]={
	jns_1 = "使用一次千蛛噬魂，造成的伤害提高15%（刻骨）/24%（钻心）/30%（噬魂）。随着侵蚀程度额外提高伤害。;对带有你的“天罗地网”状态的目标造成额外伤害。"
	,jns_3 = 4
	,jns_4 = "(20*作用目标数+10)点魔法"
	,jns_5 = "蛛丝大法技能达到10级 "
	,jns_6 = "jntb.wdf"
	,jns_7 = 1107296256
	,jns_8 = 1107296256
	}
skill取技能["侵蚀·千蛛噬魂·钻心"]={
	jns_1 = "使用一次千蛛噬魂，造成的伤害提高15%（刻骨）/24%（钻心）/30%（噬魂）。随着侵蚀程度额外提高伤害。;对带有你的“天罗地网”状态的目标造成额外伤害。"
	,jns_3 = 4
	,jns_4 = "(20*作用目标数+10)点魔法"
	,jns_5 = "蛛丝大法技能达到10级 "
	,jns_6 = "jntb.wdf"
	,jns_7 = 1107296256
	,jns_8 = 1107296256
	}
skill取技能["侵蚀·千蛛噬魂·噬魂"]={
	jns_1 = "使用一次千蛛噬魂，造成的伤害提高15%（刻骨）/24%（钻心）/30%（噬魂）。随着侵蚀程度额外提高伤害。;对带有你的“天罗地网”状态的目标造成额外伤害。"
	,jns_3 = 4
	,jns_4 = "(20*作用目标数+10)点魔法"
	,jns_5 = "蛛丝大法技能达到10级 "
	,jns_6 = "jntb.wdf"
	,jns_7 = 1107296256
	,jns_8 = 1107296256
	}
skill取技能["蛛丝缠绕"]={
	jns_1 = "攻击单个目标,并对其附加属于你的“天罗地网”状态,持续4回合。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "蛛丝大法技能达到10级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1610612736
	,jns_8 = 1610612736
	}
skill取技能["牵魂蛛丝"]={
	jns_1 = "对目标附加持续1回合的“天罗地网”状态，随后对所有带有你“天罗地网”的单位发动1次攻击。"
	,jns_4 = "100点魔法"
	,jns_3 = 4
	,jns_6 = "jntb.wdf"
	,jns_7 = 1124073472
	,jns_8 = 1124073472
	,jns_12 = "8回合"
	}
skill取技能["绝命毒牙"]={
	jns_1 = "经脉介绍:对目标发动一次致命攻击。1)对目标造成125%的伤害;2)激发目标身上的“天罗地网”状态，提高(天罗地网剩余回合数×10%)的伤害。"
	,jns_4 = "50点魔法"
	,jns_3 = 4
	,jns_6 = "jntb.wdf"
	,jns_7 = 822083584
	,jns_8 = 822083584
	,jns_12 = "10回合，战斗开始时具有5回合冷却"
	}
skill取技能["落花成泥"]={
	jns_1 = "靡靡之音进入敌人耳际，使目标下回合彷徨不知所措、额外受到24%伤害，同时100%几率无法进行除灵宝以外的任何行动。(不受化生寺门派特色影响)"
	,jns_3 = 4
	,jns_4 = "20点愤怒"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4D94B673
	,jns_8 = 0x4D94B673
	,jns_12 = "4回合"
	}
skill取技能["偷龙转凤"]={
	jns_1 = "经脉介绍:这是集天地玄妙的大成之技，修习此技，不仅要有绝代风华的女儿身，更要有一颗玲珑剔透的七窍心。对目标施法后（可以是本方或敌方)，目标立刻损失所有魔法，但在回合结束时会回复损失魔法的10%，持续8回合。"
	,jns_3 = 99
	,jns_4 = "80点愤怒"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xC3BF2DE7
	,jns_8 = 0xC3BF2DE7
	,jns_12 = '8回合'
	--普陀山技能
	}
skill取技能["护法金刚"]={
	jns_1 = "学习效果:提高角色的伤害"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 223144262
	,jns_8 = 84328029
	}
skill取技能["金刚经"]={
	jns_1 = "是记述佛祖在舍卫国的语录，教世人发三邈三婆罗密心，能够引发世人善念的佛法。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2444843522
	,jns_8 = 4122844852
	}
skill取技能["普渡众生"]={
	jns_1 = "恢复我方单个目标的气血和气血上限"
	,jns_3 = 3
	,jns_4 = "50点魔法"
	,jns_5 = "金刚经技能达到15级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 688650727
	,jns_8 = 3407231441
	}
skill取技能["灵动九天"]={
	jns_1 = "妙法万千，唤九天神威为队友临时增加法伤和法防"
	,jns_3 = 3
	,jns_4 = "30点魔法"
	,jns_5 = "人物飞升且“金刚经”技能达到120级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2299324564
	,jns_8 = 1921901005
	}
skill取技能["莲华妙法"]={
	jns_1 = "平时状态下使用，临时赋予项链提升法伤的功效，下线后消失。"
	,jns_3 = 12
	,jns_4 = "和技能等级数相同的活力"
	,jns_5 = "金刚经技能达到35级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4050867699
	,jns_8 = 2277699794
	}
skill取技能["观音咒"]={
	jns_1 = "观世音菩萨为了拯救苦海中的众生，怀着仁慈之心独创了这一咒语，有着强大的力量，能让沉沦的人们翻然醒悟。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1410587972
	,jns_8 = 1911562650
	}
skill取技能["紧箍咒"]={
	jns_1 = "一定回合内每回合减少对方的气血和气血上限"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "观音咒技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1573115441
	,jns_8 = 956876360
	}
skill取技能["杨柳甘露"]={
	jns_1 = "复活倒地的友方玩家目标。(可提前2回合复活处于“锢魂术”与“死亡召唤”状态下的目标)"
	,jns_3 = 3
	,jns_4 = "150点魔法"
	,jns_5 = "观音咒技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3757213330
	,jns_8 = 794491517
	}
skill取技能["灵性"]={
	jns_1 = "学习效果:提高角色的法伤和法防"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3949490866
	,jns_8 = 3143201775
	}
skill取技能["自在心法"]={
	jns_1 = "清除己方单个目标的“普渡众生”状态，同时将该状态剩余回合可增加的气血与气血上限结算进行恢复。"
	,jns_3 = 3
	,jns_4 = "30点魔法"
	,jns_5 = "灵性技能达到60级"
	,jns_6 = "wzife.wd1"
	,jns_7 = 1199130784
	,jns_8 = 3420028880
	}
skill取技能["清静菩提"]={
	jns_1 = "(场地法术)每回合结束时，随机移除双方各一个单位的增益状态和各一个单位的异常状态并增加所有单位20%抵抗封印能力，持续3回合"
	,jns_3 = 2
	,jns_4 = "50点魔法，消耗一个金鸦火羽"
	,jns_6 = "wzife.wd2"
	,jns_7 = 2617009923
	,jns_8 = 2617009923
	,jns_12 = "16回合"
	}
skill取技能["莲心剑意"]={
	jns_1 = "使用此法术后进入进攻状态，增加（法术修炼等级*3%)的固定伤害结果(只对首目标有效)，降低10%的回复效果。(再次使用此技能进入正常状态)"
	,jns_3 = 2
	,jns_4 = "30点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xC2D6BBD3
	,jns_8 = 0xC2D6BBD3
	}
skill取技能["五行学说"]={
	jns_1 = "学习之后能够领悟“金木水火士”的奥妙，充分了解五行之间的相生与相克。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3646722626
	,jns_8 = 733606302
	}
skill取技能["日光华"]={
	jns_1 = "对敌方1(6)个目标造成固定伤害(括号中是以NPC为目标时的效果)。若目标防御五行为木，则同时减少气血上限。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到10级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2064123225
	,jns_8 = 877019458
	}
skill取技能["侵蚀·日光华·刻骨"]={
	jns_1 = "对敌方1(6)个目标造成固定伤害(括号中是以NPC为目标时的效果)。若目标防御五行为木，则同时减少气血上限。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到10级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2064123225
	,jns_8 = 877019458
	}
skill取技能["侵蚀·日光华·钻心"]={
	jns_1 = "对敌方1(6)个目标造成固定伤害(括号中是以NPC为目标时的效果)。若目标防御五行为木，则同时减少气血上限。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到10级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2064123225
	,jns_8 = 877019458
	}
skill取技能["侵蚀·日光华·噬魂"]={
	jns_1 = "对敌方1(6)个目标造成固定伤害(括号中是以NPC为目标时的效果)。若目标防御五行为木，则同时减少气血上限。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到10级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2064123225
	,jns_8 = 877019458
	}
skill取技能["靛沧海"]={
	jns_1 = "对敌方1(6个目标造成固定伤害(括号中是以NPC为目标时的效果)。如果目标防御五行为火，则同时减少气血上限。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到11级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2679663466
	,jns_8 = 1783445565
	}
skill取技能["侵蚀·靛沧海·噬魂"]={
	jns_1 = "对敌方1(6个目标造成固定伤害(括号中是以NPC为目标时的效果)。如果目标防御五行为火，则同时减少气血上限。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到11级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2679663466
	,jns_8 = 1783445565
	}
skill取技能["侵蚀·靛沧海·刻骨"]={
	jns_1 = "对敌方1(6个目标造成固定伤害(括号中是以NPC为目标时的效果)。如果目标防御五行为火，则同时减少气血上限。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到11级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2679663466
	,jns_8 = 1783445565
	}
skill取技能["侵蚀·靛沧海·钻心"]={
	jns_1 = "对敌方1(6个目标造成固定伤害(括号中是以NPC为目标时的效果)。如果目标防御五行为火，则同时减少气血上限。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到11级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2679663466
	,jns_8 = 1783445565
	}
skill取技能["巨岩破"]={
	jns_1 = "对敌方1(6)个目标造成固定伤害(括号中是以NPC为目标时的效果)。如果目标防御五行为水，则同时减少气血上限。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到12级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3218559640
	,jns_8 = 3817801025
	}
skill取技能["侵蚀·巨岩破·钻心"]={
	jns_1 = "对敌方1(6)个目标造成固定伤害(括号中是以NPC为目标时的效果)。如果目标防御五行为水，则同时减少气血上限。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到12级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3218559640
	,jns_8 = 3817801025
	}
skill取技能["侵蚀·巨岩破·刻骨"]={
	jns_1 = "对敌方1(6)个目标造成固定伤害(括号中是以NPC为目标时的效果)。如果目标防御五行为水，则同时减少气血上限。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到12级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3218559640
	,jns_8 = 3817801025
	}
skill取技能["侵蚀·巨岩破·噬魂"]={
	jns_1 = "对敌方1(6)个目标造成固定伤害(括号中是以NPC为目标时的效果)。如果目标防御五行为水，则同时减少气血上限。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到12级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3218559640
	,jns_8 = 3817801025
	}
skill取技能["苍茫树"]={
	jns_1 = "对敌方1(6)个目标造成固定伤害(括号中是以NPC为目标时的效果)。如果目标防御五行为土，则同时减少气血上限。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到13级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1228860567
	,jns_8 = 2355974251
	}
skill取技能["侵蚀·苍茫树·刻骨"]={
	jns_1 = "对敌方1(6)个目标造成固定伤害(括号中是以NPC为目标时的效果)。如果目标防御五行为土，则同时减少气血上限。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到13级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1228860567
	,jns_8 = 2355974251
	}
skill取技能["侵蚀·苍茫树·噬魂"]={
	jns_1 = "对敌方1(6)个目标造成固定伤害(括号中是以NPC为目标时的效果)。如果目标防御五行为土，则同时减少气血上限。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到13级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1228860567
	,jns_8 = 2355974251
	}
skill取技能["侵蚀·苍茫树·钻心"]={
	jns_1 = "对敌方1(6)个目标造成固定伤害(括号中是以NPC为目标时的效果)。如果目标防御五行为土，则同时减少气血上限。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到13级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1228860567
	,jns_8 = 2355974251
	}
skill取技能["地裂火"]={
	jns_1 = "对敌方1(6)个目标造成固定伤害(括号中是以NPC为目标时的效果)。如果目标防御五行为金，则同时减少气血上限。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到14级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4132171079
	,jns_8 = 75104423
	}
skill取技能["侵蚀·地裂火·钻心"]={
	jns_1 = "对敌方1(6)个目标造成固定伤害(括号中是以NPC为目标时的效果)。如果目标防御五行为金，则同时减少气血上限。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到14级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4132171079
	,jns_8 = 75104423
	}
skill取技能["侵蚀·地裂火·刻骨"]={
	jns_1 = "对敌方1(6)个目标造成固定伤害(括号中是以NPC为目标时的效果)。如果目标防御五行为金，则同时减少气血上限。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到14级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4132171079
	,jns_8 = 75104423
	}
skill取技能["侵蚀·地裂火·噬魂"]={
	jns_1 = "对敌方1(6)个目标造成固定伤害(括号中是以NPC为目标时的效果)。如果目标防御五行为金，则同时减少气血上限。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到14级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4132171079
	,jns_8 = 75104423
	}
skill取技能["侵蚀·五行攻击·刻骨"]={
	jns_1 = "随机五行发起一次攻击。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到13级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1677721600
	,jns_8 = 1677721600
	}
skill取技能["侵蚀·五行攻击·钻心"]={
	jns_1 = "随机五行发起一次攻击。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到13级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1677721600
	,jns_8 = 1677721600
	}
skill取技能["侵蚀·五行攻击·噬魂"]={
	jns_1 = "随机五行发起一次攻击。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到13级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1677721600
	,jns_8 = 1677721600
	}
skill取技能["日光耀"]={
	jns_1 = "以金五行发起一次攻击。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到10级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 2147483648
	,jns_8 = 2147483648
	}
skill取技能["靛沧啸"]={
	jns_1 = "以水五行发起一次攻击。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到11级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1694498816
	,jns_8 = 1694498816
	}
skill取技能["巨岩击"]={
	jns_1 = "以土五行发起一次攻击。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到12级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1895825408
	,jns_8 = 1895825408
	}
skill取技能["苍茫刺"]={
	jns_1 = "以木五行发起一次攻击。。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到13级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1677721600
	,jns_8 = 1677721600
	}
skill取技能["地裂焚"]={
	jns_1 = "以火五行发起一次攻击。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到14级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1728053248
	,jns_8 = 1728053248
	}
skill取技能["莲花心音"]={
	jns_1 = "普陀弟子以莲花苞为躯，引魂入体，则可以复活在战斗中死亡的鬼魂幻兽。复活场上—个处于死亡状态的鬼魂宠，被复活目标获得60%的气血上限与当前48%的魔法。【消耗】60点魔法"
	,jns_3 = 3
	,jns_4 = "60点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x07DEBF4F
	,jns_8 = 0x07DEBF4F
	}
skill取技能["波澜不惊"]={
	jns_1 = "普陀山弟子由于精通五行造化，方可布下这吸收一切伤害的结界阵法。为目标吸收受到的前4次攻击的伤害，持续2回合；并且将吸收的伤害转化为目标的当前气血回复，最高可吸收（(普度众生首回合治疗量×2)点气血伤害。这亦是五行学派的不传之秘，只有核心弟子方能习得。"
	,jns_3 = 3
	,jns_4 = "60点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xAED0F931
	,jns_8 = 0xAED0F931
	}
skill取技能["五行制化"]={
	jns_1 = "普陀弟子可以在临敌之际运用五行之力，其所耗不过一个手印口诀，而随之而来的自然生克之力却往往令人绝望。你的“颠倒五行”获得下述加成:1)法术躲避率增加15%;2)带有该状态的单位不会被五行克制;3）持续回合数增加3。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF46EB09D
	,jns_8 = 0xF46EB09D
	}
skill取技能["五行扭转"]={
	jns_1 = "学习效果:提高角色的防御"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3256679059
	,jns_8 = 3457635171
	}
skill取技能["颠倒五行"]={
	jns_1 = "提高友方目标的四系法术吸收率及法术闪避率"
	,jns_3 = 3
	,jns_4 = "80点魔法"
	,jns_5 = "“五行扭转”技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1849998950
	,jns_8 = 3616521026
	}
skill取技能["五行错位"]={
	jns_1 = "克制女儿村弟子的必杀技"
	,jns_3 = 4
	,jns_4 = "150点愤怒值"
	,jns_5 = "五行扭转技能达到25级，人物等级达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 322760356
	,jns_8 = 3739244200
	}
skill取技能["莲花宝座"]={
	jns_1 = "学习效果:提高角色的躲避"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 37911440
	,jns_8 = 2202511971
	}
skill取技能["坐莲"]={
	jns_1 = "平时状态下使用，可以瞬间回到自己的门派"
	,jns_3 = 0
	,jns_4 = "10点气血和10魔法"
	,jns_5 = "莲花宝座技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2462764859
	,jns_8 = 3850121742
	}
skill取技能["剑意莲心"]={
	jns_1 = "莲心问剑意如何,五行珠佑便可得。在五行珠的庇佑下念动此咒,予以对手额外打击。【功效】进入“剑意莲心”状态:五行攻击会消耗1枚五行珠,但额外攻击一次。"
	,jns_3 = 2
	,jns_4 = "30点魔法"
	,jns_6 = "jntb.wdf"
	,jns_7 = 654311424
	,jns_8 = 654311424
	-- 神木林技能
	}
skill取技能["瞬息万变"]={
	jns_1 = "领悟天地自然变化之道后掌握的法术。这是学习本门其他技能的基础。"
	,jns_3 = 8
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 91138644
	,jns_8 = 3611723828
	}
skill取技能["万灵诸念"]={
	jns_1 = "学习效果:提高角色的法伤和法防"
	,jns_3 = 8
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 1673295044
	,jns_8 = 3633730222
	}
skill取技能["巫咒"]={
	jns_1 = "学习效果:提高角色的伤害"
	,jns_3 = 8
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 1387740863
	,jns_8 = 3945429798
	}
skill取技能["万物轮转"]={
	jns_1 = "学习效果:提高角色的防御"
	,jns_3 = 8
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 236054114
	,jns_8 = 3548374182
	}
skill取技能["天人庇护"]={
	jns_1 = "学习效果:提高角色的躲避"
	,jns_3 = 8
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 466502506
	,jns_8 = 2656066797
	}
skill取技能["神木恩泽"]={
	jns_1 = "对神木的虔诚敬仰，获得神木之灵的赐福，神木族独有的恩泽。"
	,jns_3 = 8
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 1911264426
	,jns_8 = 785936658
	}
skill取技能["驭灵咒"]={
	jns_1 = "进入战斗后获得技能等级/60层风灵，用于增强特定的门派法术。风灵层数将增加自身的法术伤害力，最多累积6层。学习效果:提高角色的魔法上限。"
	,jns_3 = 8
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 3018347230
	,jns_8 = 1524159458
	}
skill取技能["落叶萧萧"]={
	jns_1 = "使用法术攻击敌方多个目标。 攻击个数=技能等级除以35+1，最多5人。"
	,jns_3 = 4
	,jns_4 = "30点魔法*作用人数"
	,jns_5 = "“瞬息万变”技能达到35级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x2E734F9D
	,jns_8 = 0x0B8CF3A1
	}
skill取技能["荆棘舞"]={
	jns_1 = "对敌方单个目标造成较高的法术伤害。"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "“万灵诸念”技能达到20级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0xDD2AB898
	,jns_8 = 0x6A647570
	}
skill取技能["尘土刃"]={
	jns_1 = "对敌方单个目标造成法术伤害，并减少目标的气血上限。"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "“万灵诸念”技能达到20级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x3FE17E30
	,jns_8 = 0x71C197B0
	}
skill取技能["冰川怒"]={
	jns_1 = "对敌方单个目标造成法术伤害。攻击召唤兽时，有几率冻结目标(不能使用普通攻击、法术)，持续2回合。"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "“万灵诸念”技能达到20级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0xEDF81F56
	,jns_8 = 0x3B12CD18
	}
skill取技能["雾杀"]={
	jns_1 = "对敌方单个目标造成持续伤害，可叠加3层，持续4回合。"
	,jns_3 = 4
	,jns_4 = "150点魔法"
	,jns_5 = "“巫咒”技能达到40级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x1EE55D3C
	,jns_8 = 0x0DA2D8DF
	}
skill取技能["血雨"]={
	jns_1 = "消耗气血，对敌方单个目标造成大量伤害。使用后下回合无法使用法术。 "
	,jns_3 = 4
	,jns_4 = "20%最大气血"
	,jns_5 = "“巫咒”技能达到40级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x126B932F
	,jns_8 = 0x7D52C301
	}
skill取技能["星月之惠"]={
	jns_1 = "恢复自身的气血，若有风灵，会消耗1层风灵使恢复效果加倍。"
	,jns_3 = 2
	,jns_4 = "50点魔法"
	,jns_5 = "“巫咒”技能达到40级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 4284560198
	,jns_8 = 8287795
	}
skill取技能["炎护"]={
	jns_1 = "抵御50%的气血伤害，每抵御1点伤害需消耗1点魔法"
	,jns_3 = 2
	,jns_4 = "100点魔法"
	,jns_5 = "“天人庇护”技能达到50级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0xA215E746
	,jns_8 = 0xC5D73984
	}
skill取技能["叶隐"]={
	jns_1 = "平时状态下使用，可以瞬间回到自己的门派。"
	,jns_3 = 0
	,jns_4 = "10点气血和10点魔法"
	,jns_5 = "“天人庇护”技能达到1级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x64FEA3A4
	,jns_8 = 0x51763883
	}
skill取技能["神木呓语"]={
	jns_1 = "平时状态下使用，临时赋予靴子提高法术伤害结果和固定伤害的功效，下线后消失。"
	,jns_3 = 12
	,jns_4 = "10点气血和10点魔法"
	,jns_5 = "“神木恩泽”技能达到35级，人物等级达到30级。"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x977F5625
	,jns_8 = 0x33CC0A38
	}
skill取技能["蜜润"]={
	jns_1 = "提高友方最多3个目标的法伤（若有风灵会消耗1层风灵，使持续回合数加倍)。 "
	,jns_3 = 2
	,jns_4 = "100点魔法"
	,jns_5 = "“驭灵咒”技能达到20级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x058EE366
	,jns_8 = 0xF83E2272
	}
skill取技能["蝼蚁蚀天"]={
	jns_1 = "克制凌波城弟子的必杀技。"
	,jns_3 = 0
	,jns_4 = "150点愤怒值"
	,jns_5 = "“驭灵咒”技能达到25级，人物等级达到20级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0xAC0B8B61
	,jns_8 = 0xAC574467
	}
skill取技能["花语歌谣"]={
	jns_1 = "使用后随机获得3个效果中的一个:1)落叶萧萧额外作用3个目标；2)尘士刃荆棘舞、冰川怒触发“重光几率增加至4倍；3)自身行动后解除自身封印，触发2次后效果消失。"
	,jns_3 = 2
	,jns_4 = "200点魔法，消耗一个金鸦火羽"
	,jns_6 = "wzife.wd3"
	,jns_7 = 1009005548
	,jns_8 = 764272371
	,jns_12 = "10回合"
	}
skill取技能["蛊木迷瘴"]={
	jns_1 = "使用法术攻击敌方多个目标。有一定几率为目标附加1层“雾杀”。"
	,jns_3 = 4
	,jns_4 = "(3O*作用目标数)点魔法"
	,jns_6 = "jntb.wdf"
	,jns_7 = 570425344
	,jns_8 = 570425344
	}
skill取技能["催化"]={
	jns_1 = "强化目标身上来自你的“雾杀”，使“雾杀”造成的伤害增加100% (300%);若有风灵，会消耗1层强化所有敌方单位身上来自你的“雾杀”。本场战斗中,“雾杀”的基础伤害提高6%%,最多60%。(括号内为目标是NPC时的效果)"
	,jns_3 = 4
	,jns_4 = "100点魔法"
	,jns_6 = "wzife.wd3"
	,jns_7 = 3758466183
	,jns_8 = 3838255137
	}
skill取技能["凋零之歌"]={
	jns_1 = "歌声飘进敌人的耳中，颤动着敌人心窝，在无形中侵袭着敌阵的斗志，埋下毁灭之种。目标接下来2回合受到的法术伤害增加16%，若目标带有雾杀效果，则引爆雾杀效果，否则只能造成100点伤害；并使对手随机3个未带雾杀效果的目标获得雾杀效果。"
	,jns_3 = 4
	,jns_4 = "100点魔法"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x281E732A
	,jns_8 = 0x281E732A
	,jns_12 = "8回合"
	}
skill取技能["风卷残云"]={
	jns_1 = "神木林在觉醒，风在咆哮！大风带着神木林弟子的怒意无情的打击面前的敌人。\n消耗所有风灵使用一次落叶萧萧，伤害结果提高（消耗风灵数×16％）。该技能不触发“重光”，但佩戴“月影”时额外提高12％伤害并消耗1点灵气。"
	,jns_3 = 4
	,jns_4 = "150点魔法"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x3778487D
	,jns_8 = 0x3778487D
	}
skill取技能["侵蚀·魔化万灵·刻骨"]={
	jns_1 = "随机使用2至3次“荆棘舞”、“尘土刃”或“冰川怒”，伤害提高5%（刻骨）/8%（钻心）/10%（噬魂）。随着侵蚀程度更容易触发多次施法。"
	,jns_3 = 4
	,jns_4 = "80点魔法"
	,jns_5 = "人物进入侵蚀状态 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 3051115375
	,jns_8 = 1777991632
	}
skill取技能["侵蚀·魔化万灵·钻心"]={
	jns_1 = "随机使用2至3次“荆棘舞”、“尘土刃”或“冰川怒”，伤害提高5%（刻骨）/8%（钻心）/10%（噬魂）。随着侵蚀程度更容易触发多次施法。"
	,jns_3 = 4
	,jns_4 = "80点魔法"
	,jns_5 = "人物进入侵蚀状态 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 3051115375
	,jns_8 = 1777991632
	}
skill取技能["侵蚀·魔化万灵·噬魂"]={
	jns_1 = "随机使用2至3次“荆棘舞”、“尘土刃”或“冰川怒”，伤害提高5%（刻骨）/8%（钻心）/10%（噬魂）。随着侵蚀程度更容易触发多次施法。"
	,jns_3 = 4
	,jns_4 = "80点魔法"
	,jns_5 = "人物进入侵蚀状态 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 3051115375
	,jns_8 = 1777991632
	}
skill取技能["毒萃"]={
	jns_1 = "使用后你的蛊木迷瘴附加“雾杀”的几率提高100%，持续5回合(包括当前回合)。"
	,jns_2 = "300点魔法，1点风灵"
	,jns_3 = 5
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x72ED61A1
	,jns_8 = 0x72ED61A1
	}
skill取技能["古藤秘咒"]={
	jns_1 = "上古有木,根叶有灵,藤蔓缠绕其上护佑神树,伺机而动。对敌方单个目标造成法术伤害。"
	,jns_3 = 4
	,jns_4 = "30点魔法,2点木精"
	,jns_6 = "jntb.wdf"
	,jns_7 = 553648128
	,jns_8 = 553648128
	}
skill取技能["疾风秋叶"]={
	jns_1 = "疾风卷秋叶,力可撼石壁,无形杀人于动静之间。对敌方多个目标造成法术伤害。"
	,jns_3 = 4
	,jns_4 = "(30*作用目标数)点魔法,1点木精"
	,jns_6 = "jntb.wdf"
	,jns_7 = 637534208
	,jns_8 = 637534208
	}
skill取技能["枯木逢春"]={
	jns_1 = "对敌方所有单位使用一次强大的法术。1.对点选目标造成较高伤害，对其他目标造成少量伤害。⒉使用后获得2点风灵。"
	,jns_4 = "100点魔法、3点木精"
	,jns_3 = 4
	,jns_6 = "jntb.wdf"
	,jns_7 = 1912602624
	,jns_8 = 1912602624
	--狮驼岭技能
	}
skill取技能["生死搏"]={
	jns_1 = "学习效果:提高角色的伤害"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3136073986
	,jns_8 = 1362791032
	}
skill取技能["象形"]={
	jns_1 = "攻击敌万单个目标，并使其无法行动，持续2回合。使用后取消“变身”状态且下回合无法使用法术。"
	,jns_3 = 4
	,jns_4 = "50魔法"
	,jns_5 = "生死搏技能达到20级。"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3175084157
	,jns_8 = 108912467
	}
skill取技能["天魔解体"]={
	jns_1 = "进入“变身”状态，同时提升自身造成的伤害，持续8合。"
	,jns_3 = 2
	,jns_4 = "100点魔法、最大气血*10%"
	,jns_5 = "人物飞升且“生死搏”技能达到120级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2713209956
	,jns_8 = 2477360209
	}
skill取技能["变身"]={
	jns_1 = "提高自身的伤害，是使用象形、鹰击、狮搏和连环击的前提"
	,jns_3 = 2
	,jns_4 = "20点魔法"
	,jns_5 = "魔兽神功技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4282403049
	,jns_8 = 3667711762
	}
skill取技能["鹰击"]={
	jns_1 = "攻击对方多人，使用后需要休息1回合"
	,jns_3 = 4
	,jns_4 = "30点魔法，攻击多人时消耗增加"
	,jns_5 = "生死搏技能达到30级，不允许连续两回合使用"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3219722580
	,jns_8 = 1443303401
	}
skill取技能["侵蚀·鹰击·刻骨"]={
	jns_1 = "攻击对方多人,有50%的概率额外作用一个目标，使用后需要休息1回合"
	,jns_3 = 4
	,jns_4 = "30点魔法，攻击多人时消耗增加"
	,jns_5 = "生死搏技能达到30级，不允许连续两回合使用"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3219722580
	,jns_8 = 1443303401
	}
skill取技能["侵蚀·鹰击·钻心"]={
	jns_1 = "攻击对方多人,有80%的概率额外作用一个目标"
	,jns_3 = 4
	,jns_4 = "30点魔法，攻击多人时消耗增加"
	,jns_5 = "生死搏技能达到30级，不允许连续两回合使用"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3219722580
	,jns_8 = 1443303401
	}
skill取技能["侵蚀·鹰击·噬魂"]={
	jns_1 = "攻击对方多人,有100%的概率额外作用一个目标"
	,jns_3 = 4
	,jns_4 = "30点魔法，攻击多人时消耗增加"
	,jns_5 = "生死搏技能达到30级，不允许连续两回合使用"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3219722580
	,jns_8 = 1443303401
	}
skill取技能["狮搏"]={
	jns_1 = "临时提升伤害，攻击敌方单个目标。"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "生死搏技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3700481839
	,jns_8 = 1627374280
	}
skill取技能["威慑"]={
	jns_1 = "令怪物或玩家召唤兽无法行动，不能对玩家使用"
	,jns_3 = 4
	,jns_4 = "20点魔法"
	,jns_5 = "训兽诀技能达到15级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 81423983
	,jns_8 = 894640149
	}
skill取技能["疯狂鹰击"]={
	jns_1 = "使用一次特别的鹰击，若自身气血≥98%(化圣1)/94%(化圣5)/90%(化圣9)则额外作用两个目标。"
	,jns_3 = 4
	,jns_4 = "400点魔法，消耗一个金鸦火羽"
	,jns_6 = "wzife.wd3"
	,jns_7 = 2063567623
	,jns_8 = 3246975793
	,jns_12 = "6回合"
	}
skill取技能["魔息术"]={
	jns_1 = "恢复自身的魔法，持续6回合。 "
	,jns_3 = 2
	,jns_4 = "30点气血"
	,jns_5 = "人物飞升且“阴阳二气诀”技能达到120级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 3643037170
	,jns_8 = 787252900
	}
skill取技能["训兽诀"]={
	jns_1 = "学习效果:提高角色的法伤和法防"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1184160039
	,jns_8 = 3128610907
	}
skill取技能["威慑"]={
	jns_1 = "使敌方目标无法使用普通攻击和法术。可以对NPC和召唤兽使用，"
	,jns_3 = 8
	,jns_4 = "20点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x9D1ABD9E
	,jns_8 = 0x9D1ABD9E
	}
skill取技能["魔兽神功"]={
	jns_1 = "“世称魔兽有玄功，天地灵气运神通。”狮驼岭所有的武功都以此为基础，修习之后能将本门法术发挥到极致。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2952870578
	,jns_8 = 10218458
	}
skill取技能["大鹏展翅"]={
	jns_1 = "学习效果:提高角色的躲避"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1243494819
	,jns_8 = 2200620761
	}
skill取技能["魔兽啸天"]={
	jns_1 = "克制天宫弟子的必杀技"
	,jns_3 = 4
	,jns_4 = "150点愤怒值"
	,jns_5 = "魔兽神功技能达到25级，人物等级达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 950759216
	,jns_8 = 1124928283
	}
skill取技能["阴阳二气诀"]={
	jns_1 = "世间万物者皆有阴阳属性，当灵通阴阳之术后，即可达到天人合一的境界。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 683331190
	,jns_8 = 4236173132
	}
skill取技能["定心术"]={
	jns_1 = "战斗中提高自身的法伤和法防"
	,jns_3 = 2
	,jns_4 = "40点魔法"
	,jns_5 = "阴阳二气诀技能达到40级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3988224797
	,jns_8 = 99592343
	}
skill取技能["狂兽诀"]={
	jns_1 = "相传为蚩尤所创，引发魔兽进入疯狂的状态，往往可以令其发挥出超常的实力。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1661790658
	,jns_8 = 2338433754
	}
skill取技能["连环击"]={
	jns_1 = "疯狂地连续的攻击敌人"
	,jns_3 = 4
	,jns_4 = "可连击次数×30点魔法"
	,jns_5 = "狂兽诀技能达到30级，使用后解除当前所有增益状态"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3608703815
	,jns_8 = 673541382
	}
skill取技能["神力无穷"]={
	jns_1 = "平时状态下使用，临时赋予腰带提升愤怒的功效，下线后消失。"
	,jns_3 = 12
	,jns_4 = "和技能等级数相同的活力"
	,jns_5 = "狂兽诀技能达到35级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 3809438015
	,jns_8 = 3884615585
	}
skill取技能["魔兽反噬"]={
	jns_1 = "学习效果:提高角色的防御"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 512391647
	,jns_8 = 1359532967
	}
skill取技能["极度疯狂"]={
	jns_1 = "使自己受到普通攻击时会进行反击"
	,jns_3 = 2
	,jns_4 = "30点魔法"
	,jns_5 = "魔兽反噬技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 363599535
	,jns_8 = 2884919862
	}
skill取技能["振翅千里"]={
	jns_1 = "平时状态下使用，可以瞬间回到自己的门派"
	,jns_3 = 0
	,jns_4 = "10点气血和10点魔法"
	,jns_5 = "大鹏展翅技能达到1级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 3512079122
	,jns_8 = 4160807473
	}
skill取技能["驯兽·幼狮"]={
	jns_1 = "驯服幼兽,为己所用。【功效】召唤你的驯兽·幼狮。"
	,jns_3 = 2
	,jns_4 = "150点魔法"
	,jns_5 = "狂兽诀技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 363599535
	,jns_8 = 2884919862
	}
skill取技能["幼狮之搏"]={
	jns_1 = "幼狮侍主,随主人心念而动,对敌人发起进攻。"
	,jns_3 = 8
	,jns_5 = "狂兽诀技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 363599535
	,jns_8 = 2884919862
	}
skill取技能["狂怒"]={
	jns_1 = "发动神功,以狂怒之势震慑诸敌,对其造成高额伤害。获得与当前变身相同回合的“狂怒”:造成的物理伤害提高。"
	,jns_3 = 2
	,jns_4 = "30点魔法"
	,jns_5 = "魔兽神功技能达到30级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 838860800
	,jns_8 = 838860800
	}
skill取技能["困兽之斗"]={
	jns_1 = "若处于“狂怒”状态，有50%的几率额外攻击一次。若击倒了玩家单位，则获得5回合的“狂怒”状态。"
	,jns_4 = "10%当前气血、100点魔法"
	,jns_3 = 4
	,jns_6 = "jntb.wdf"
	,jns_7 = 1929379840
	,jns_8 = 1929379840
	,jns_12 = "8回合"
	--天宫技能
	}
skill取技能["傲世诀"]={
	jns_1 = "学习效果:提高角色的气血上限"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3001127144
	,jns_8 = 1049195070
	}
skill取技能["天雷斩"]={
	jns_1 = "攻击敌方1(3)个目标(括号中是以NPC为目标时的效果)，并降低目标的法伤和法防，但使用后会降低自身的防御。"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "傲世诀技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 315619009
	,jns_8 = 958381035
	}
skill取技能["风雷斩"]={
	jns_1 = "“风烈雷迅九霄怒,一斩疾霆破惊云”。天宫弟子能以雷霆之势予以对手沉重一击。【功效】以雷霆之势攻击一个单位。"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "傲世诀技能达到25级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 402653184
	,jns_8 = 402653184
	}
skill取技能["霹雳弦惊"]={
	jns_1 = "【功效】强化你的风雷斩为风雷斩·霹雳:对主目标额外造成伤害,持续6回合。使用雷怒霆激后会解除此状态。"
	,jns_3 = 2
	,jns_4 = "70点魔法"
	,jns_5 = "傲世诀技能达到25级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 956301312
	,jns_8 = 956301312
	}
skill取技能["雷怒霆激"]={
	jns_1 = "【功效】强化你的风雷斩为风雷斩·飞霆:额外攻击2个单位,持续6回合。使用霹苦弦惊后会解除此状态。"
	,jns_3 = 2
	,jns_4 = "70点魔法"
	,jns_5 = "傲世诀技能达到25级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 872415232
	,jns_8 = 872415232
	}
skill取技能["电光火石"]={
	jns_1 = "经脉介绍:使用后同时获得“霹雳弦惊”和“雷怒霆激”状态。"
	,jns_3 = 2
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x72ED61A1
	,jns_8 = 0x72ED61A1
	,jns_4 = "140点魔法"
	,jns_12 = "战斗开始时具有9回合冷却，死亡后冷却重置为9回合"
	}
skill取技能["鸣雷诀"]={
	jns_1 = "使用后，每回合结束时对方气血最低的单位招来天雷攻击，造成人物等级*8的伤害，持续3回合。(不可被驱散)"
	,jns_3 = 2
	,jns_4 = "100点魔法，消耗一个金鸦火羽"
	,jns_6 = "wzife.wd3"
	,jns_7 = 376590482
	,jns_8 = 502623457
	,jns_12 = "12回合"
	}
skill取技能["威仪九霄"]={
	jns_1 = "经脉介绍:【被动】每回合开始时，威仪九霄的伤害倍率增加3%，魔法消耗增加100点(最多叠加30次);【主动】对所有目标造成10%的物理伤害，使用后清空叠加次数。"
	,jns_4 = "30点魔法"
	,jns_3 = 4
	,jns_6 = "jntb.wdf"
	,jns_7 = 2181038080
	,jns_8 = 2181038080
	,jns_12 = "6回合，进入战斗冷却3回合"
	}
skill取技能["天神护体"]={
	jns_1 = "战斗中提高自身的法伤和法防"
	,jns_3 = 5
	,jns_4 = "50点魔法"
	,jns_5 = "天罡气技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2173852985
	,jns_8 = 4200916921
	}
skill取技能["天罡气"]={
	jns_1 = "学习效果:提高角色的伤害"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 4224325719
	,jns_8 = 517623127
	}
skill取技能["天神护法"]={
	jns_1 = "在战斗中自动保护指定的伙伴"
	,jns_3 = 5
	,jns_4 = "30点魔法"
	,jns_5 = "天罡气技能等级达到40级以上"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4053425914
	,jns_8 = 3750198819
	}
skill取技能["五雷轰顶"]={
	jns_1 = "减少敌人25%当前气血及魔法，但最高不会超过自己等级×50，失败只减少5%的当前气血"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "天罡气技能达到35级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4236045895
	,jns_8 = 1825724039
	}
skill取技能["侵蚀·五雷轰顶·刻骨"]={
	jns_1 = "减少敌人30%当前气血及魔法，但最高不会超过自己等级×50，失败只减少5%的当前气血"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "天罡气技能达到35级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4236045895
	,jns_8 = 1825724039
	}
skill取技能["侵蚀·五雷轰顶·噬魂"]={
	jns_1 = "减少敌人35%当前气血及魔法，但最高不会超过自己等级×50，失败只减少5%的当前气血"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "天罡气技能达到35级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4236045895
	,jns_8 = 1825724039
	}
skill取技能["侵蚀·五雷轰顶·钻心"]={
	jns_1 = "减少敌人33%当前气血及魔法，但最高不会超过自己等级×50，失败只减少5%的当前气血"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "天罡气技能达到35级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4236045895
	,jns_8 = 1825724039
	}
skill取技能["雷霆万钧"]={
	jns_1 = "攻击性法术，使用后攻击3个敌方目标"
	,jns_3 = 4
	,jns_4 = "35*作用人数点魔法"
	,jns_5 = "“天罡气”技能达到50级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1167105764
	,jns_8 = 2063612274
	}
skill取技能["侵蚀·雷霆万钧·刻骨"]={
	jns_1 = "攻击性法术，使用后攻击3个敌方目标"
	,jns_3 = 4
	,jns_4 = "35*作用人数点魔法"
	,jns_5 = "“天罡气”技能达到50级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1167105764
	,jns_8 = 2063612274
	}
skill取技能["侵蚀·雷霆万钧·钻心"]={
	jns_1 = "攻击性法术，使用后攻击3个敌方目标"
	,jns_3 = 4
	,jns_4 = "35*作用人数点魔法"
	,jns_5 = "“天罡气”技能达到50级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1167105764
	,jns_8 = 2063612274
	}
skill取技能["侵蚀·雷霆万钧·噬魂"]={
	jns_1 = "攻击性法术，使用后攻击3个敌方目标"
	,jns_3 = 4
	,jns_4 = "35*作用人数点魔法"
	,jns_5 = "“天罡气”技能达到50级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1167105764
	,jns_8 = 2063612274
	}
skill取技能["风雷韵动"]={
	jns_1 = "以风为弦、以雷为钟，其鸣如黄钟大吕般的攻击不仅能击溃对方的躯体，也能摧毁抵抗的意志。该技能本身伤害不会给目标增加愤怒值并降低目标8点愤怒，不受佛法无边影响。消耗：60点魔法。"
	,jns_3 = 4
	,jns_4 = "60点魔法，10点愤怒"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x169010C9
	,jns_8 = 0x169010C9
	}
skill取技能["浩然正气"]={
	jns_1 = "平时状态下使用，临时赋予铠甲/女衣提升法防的功效，下线后消失。"
	,jns_3 = 12
	,jns_4 = "和技能等级数相同的活力"
	,jns_5 = "天罡气技能达到35级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3449922467
	,jns_8 = 567769462
	}
skill取技能["天诛地灭"]={
	jns_1 = "克制地府弟子的必杀技"
	,jns_3 = 4
	,jns_4 = "150点愤怒值"
	,jns_5 = "天罡气技能达到25级，人物等级达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4053425914
	,jns_8 = 3701201548
	}
skill取技能["清明自在"]={
	jns_1 = "学习效果:提高角色的法伤和法防"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3231066014
	,jns_8 = 3842629365
	}
skill取技能["知己知彼"]={
	jns_1 = "使用后可以得知目标的状态"
	,jns_3 = 4
	,jns_4 = "80点魔法"
	,jns_5 = "清明自在达到35级以上"
	,jns_6 = "wzife.wdf"
	,jns_7 = 196316992
	,jns_8 = 2448181313
	}
skill取技能["宁气诀"]={
	jns_1 = "学习效果:提高角色的防御"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1979452270
	,jns_8 = 3573433154
	}
skill取技能["宁心"]={
	jns_1 = "解除并避免女儿村封类法术的影响"
	,jns_3 = 3
	,jns_4 = "30点魔法"
	,jns_5 = "宁气诀技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2585090388
	,jns_8 = 1957863037
	}
skill取技能["乾坤塔"]={
	jns_1 = "托塔李天王的独门技能，以乾坤之力可以镇妖降魔，让敌人因为被困而心生恐怖，陷入混乱的状态。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 646614501
	,jns_8 = 3014813769
	}
skill取技能["掌心雷"]={
	jns_1 = "一定回合使敌方目标无法使用主动法宝"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "乾坤塔技能达到50级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 2499805184
	,jns_8 = 2499805184
	}
skill取技能["错乱"]={
	jns_1 = "令对手无法使用法术，并在普陀攻击时出现目标偏差"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "乾坤塔技能达到50级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3622268205
	,jns_8 = 4290077259
	}
skill取技能["镇妖"]={
	jns_1 = "一定回合禁止目标使用特技。"
	,jns_3 = 4
	,jns_4 = "45点魔法"
	,jns_5 = "乾坤塔技能达到50级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2821624851
	,jns_8 = 251203682
	}
skill取技能["混天术"]={
	jns_1 = "“仙宫道力玄，大罗可混天。天宫弟子依靠其法术可以召唤上天神力协助自己。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3643496130
	,jns_8 = 481805567
	}
skill取技能["百万神兵"]={
	jns_1 = "令对方无法使用普通攻击"
	,jns_3 = 4
	,jns_4 = "60点魔法"
	,jns_5 = "混天术技能达到40级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3140668291
	,jns_8 = 4284468319
	}
skill取技能["金刚镯"]={
	jns_1 = "降低敌方单个目标的伤害，持续4回合。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "人物飞升且“混天术”技能达到120级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4185507078
	,jns_8 = 1737815847
	}
skill取技能["天雷灌注"]={
	jns_1 = "镇妖神使、踏雷天尊流派:强化你的下一个雷霆万钧；霹雳真君流派:强化你的下一个技能:风雷斩·霹雳有几率额外攻击一次；风雷斩·飞霆额外攻击3个单位。"
	,jns_3 = 2
	,jns_4 = "100点魔法，当前气血*25%"
	,jns_5 = "天宫飞升技能，混天术技能≥120级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 2449473536
	,jns_8 = 2449473536
	}
skill取技能["画地为牢"]={
	jns_1 = "天宫弟子随手布下的囚牢，却是无数穷凶极恶之徒的饮恨之所。对敌方使用后，降低敌方1个单位18%的抵抗封印能力以及24%的封印能力，持续5回合"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_12 = "5回合"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xBAF731FA
	,jns_8 = 0xBAF731FA
	}
skill取技能["雷霆汹涌"]={
	jns_1 = "【被动】你的雷霆万钧不再会消耗“天雷灌注”,【主动】消耗“天雷灌注”对6个目标进行法术攻击。"
	,jns_4 = "作用人数*35点魔法"
	,jns_3 = 4
	,jns_6 = "jntb.wdf"
	,jns_7 = 1962934272
	,jns_8 = 1962934272
	}
skill取技能["云霄步"]={
	jns_1 = "学习效果:提高角色的躲避"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 276418186
	,jns_8 = 3893284871
	}
skill取技能["腾云驾雾"]={
	jns_1 = "平时状态下使用，可以瞬间回到自己的门派"
	,jns_3 = 0
	,jns_4 = "10点气血和10点魔法"
	,jns_5 = "云霄步技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1924869232
	,jns_8 = 906709372
	-- 无底洞技能
	}
skill取技能["侵蚀·绝烬残光·刻骨"]={
	jns_1 = "战斗中临时提高己方全体物理暴击率一回合"
	,jns_3 = 3
	,jns_4 = "40点魔法"
	,jns_5 = "佛光普照技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 479962043
	,jns_8 = 3700736796
	}
skill取技能["侵蚀·绝烬残光·钻心"]={
	jns_1 = "战斗中临时提高己方全体物理暴击率一回合"
	,jns_3 = 3
	,jns_4 = "40点魔法"
	,jns_5 = "佛光普照技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 479962043
	,jns_8 = 3700736796
	}
skill取技能["侵蚀·绝烬残光·噬魂"]={
	jns_1 = "战斗中临时提高己方全体物理暴击率一回合"
	,jns_3 = 3
	,jns_4 = "40点魔法"
	,jns_5 = "佛光普照技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 479962043
	,jns_8 = 3700736796
	}
skill取技能["枯骨心法"]={
	jns_1 = "妖风起，摧心裂骨，地涌夫人赖以成名的绝技。这是学习本门其他技能的基础。"
	,jns_3 = 8
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 3947876534
	,jns_8 = 3256658495
	}
skill取技能["阴风绝章"]={
	jns_1 = "从枯骨心经中化出的运用法门将阴风熬气与咒术相结合，追魂夺魄，威力无穷。"
	,jns_3 = 8
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 580599606
	,jns_8 = 2376753741
	}
skill取技能["鬼蛊灵蕴"]={
	jns_1 = "学习效果:提高角色的法伤和法防"
	,jns_3 = 8
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 2137124880
	,jns_8 = 642299714
	}
skill取技能["燃灯灵宝"]={
	jns_1 = "学习效果:提高角色的防御"
	,jns_3 = 8
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 2206649654
	,jns_8 = 2011054851
	}
skill取技能["地冥妙法"]={
	jns_1 = "无底洞弟子皆可驱使地脉之气以为己用，借大地之力施展出强大的法术。"
	,jns_3 = 8
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 2066772317
	,jns_8 = 1202816090
	}
skill取技能["混元神功"]={
	jns_1 = "学习效果:提高角色的伤害"
	,jns_3 = 8
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 3367413411
	,jns_8 = 2065734785
	}
skill取技能["秘影迷踪"]={
	jns_1 = "学习效果:提高角色的速度"
	,jns_3 = 8
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 4041502466
	,jns_8 = 2278980523
	}
skill取技能["移魂化骨"]={
	jns_1 = "消耗自身气血使目标获得吸血效果，持续一定回合。"
	,jns_3 = 3
	,jns_4 = "最大气血的10%"
	,jns_5 = "“枯骨心法”技能达到20级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x173015AE
	,jns_8 = 0x121AC8D4
	}
skill取技能["夺魄令"]={
	jns_1 = "令目标一定回合内无法使用法术。"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "“阴风绝章”技能达到25级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x62221B56
	,jns_8 = 0x076EA85A
	}
skill取技能["煞气诀"]={
	jns_1 = "使目标一定回合无法做部分行动（禁止使用物理、法术、特技、法宝、物品），且目标受到的所有伤害降低50%，持续2回合。可作用于敌人或队友，不能作用于自己。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "“阴风绝章”技能达到30级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0xC0504605
	,jns_8 = 0x28D6DCD8
	}
skill取技能["惊魂掌"]={
	jns_1 = "使用后使对手在持续回合内无法被他人保护（天神护法、指令保护）。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "“阴风绝章”技能达到50级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0xC232A281
	,jns_8 = 0x71307D22
	}
skill取技能["摧心术"]={
	jns_1 = "使敌方2个目标速度降低，持续一定回合"
	,jns_3 = 4
	,jns_4 = "100点魔法"
	,jns_5 = "“阴风绝章”技能达到120级，且人物飞升"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x1CC2B0B0
	,jns_8 = 0xD6A5B20C
	}
skill取技能["夺命咒"]={
	jns_1 = "对敌方1(5个目标造成固定伤害(括号中是以NPC为目标时的效果)。"
	,jns_3 = 4
	,jns_4 = "20点魔法，作用多人时消耗增加"
	,jns_5 = "“鬼蛊灵蕴”技能达到35级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x2A3E7A3C
	,jns_8 = 0xA9AF9E72
	}
skill取技能["明光宝烛"]={
	jns_1 = "降低友方多个目标受到的物理伤害结果"
	,jns_3 = 3
	,jns_4 = "100点魔法"
	,jns_5 = "“燃灯灵宝”技能达到35级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x54DB6CDE
	,jns_8 = 0x59D84304
	}
skill取技能["金身舍利"]={
	jns_1 = "降低友方多个目标受到的法术伤害结果"
	,jns_3 = 4
	,jns_4 = "100点魔法"
	,jns_5 = "“燃灯灵宝”技能达到120级，且人物飞升"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x1BE322B2
	,jns_8 = 0xFE884980
	}
skill取技能["地涌金莲"]={
	jns_1 = "恢复自己或者队友的气血与气血上限"
	,jns_3 = 3
	,jns_4 = "最大气血*3%、50点魔法"
	,jns_5 = "“地冥妙法”技能达到20级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x40FB7647
	,jns_8 = 0xF437CA2F
	}
skill取技能["万木凋枯"]={
	jns_1 = "克制神木林弟子的技能"
	,jns_3 = 4
	,jns_4 = "150点愤怒"
	,jns_5 = "“地冥妙法”技能达到25级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x036B4345
	,jns_8 = 0xF2E06AF8
	}
skill取技能["元阳护体"]={
	jns_1 = "平时状态下使用，临时赋予武器提高气血恢复效果的功效，下线后消失。"
	,jns_3 = 12
	,jns_4 = "和技能等级相同的活力"
	,jns_5 = "“混元神功”技能达到25级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0xABD57D92
	,jns_8 = 0x2EF58426
	}
skill取技能["遁地术"]={
	jns_1 = "平时状态下使用，可以瞬间回到自己的门派。"
	,jns_3 = 0
	,jns_4 = "10点气血和10点魔法"
	,jns_5 = "“秘影迷踪”技能达到1级"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x1D14968A
	,jns_8 = 0x34D061C7
	}
skill取技能["净土灵华"]={
	jns_1 = "将友方目标气血上限恢复到满，每使用一次降低自身受到的7%的治疗量。"
	,jns_3 = 3
	,jns_4 = "300点魔法，消耗一个金鸦火羽"
	,jns_6 = "wzife.wd3"
	,jns_7 = 1376987089
	,jns_8 = 622704744
	,jns_12 = "6回合"
	}
skill取技能["追魂刺"]={
	jns_1 = "对敌方单个目标造成大量固定伤害"
	,jns_3 = 4
	,jns_4 = "50点魔法、20点愤怒"
	,jns_5 = "“地冥妙法”技能达到45级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 2214592512
	,jns_8 = 2214592512
	}
skill取技能["由己渡人"]={
	jns_1 = "复活一名队友；恢复（“地冥妙法”等级*6)气血；恢复（“地冥妙法”等级*12)临时气血上限。"
	,jns_3 = 3
	,jns_4 = "当前气血*10%"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0xDE58924A
	,jns_8 = 0xDE58924A
	}
skill取技能["绝处逢生"]={
	jns_1 = "恢复自身损失的50%气血及自身损失的50%气血上限，速度增加10%，持续3回合。(不可驱散)"
	,jns_3 = 2
	,jns_4 = "100点魔法"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x33470573
	,jns_8 = 0x33470573
	,jns_12 = "10回合，战斗开始时具有5回合冷却"
	}
skill取技能["燃血术"]={
	jns_1 = "消耗气血，强化你的下一个技能。"
	,jns_3 = 2
	,jns_4 = "（最大气血×10%）点气血和气血上限"
	,jns_5 = "当前气血比例≥50%"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1174405120
	,jns_8 = 1174405120
	}
skill取技能["化羽为血"]={
	jns_1 = "以金鸦火羽为施法媒介获得燃血术的强化效果。【功效】获得燃血术的强化效果。"
	,jns_3 = 2
	,jns_4 = "300点魔法，消耗一个金鸦火羽"
	,jns_5 = "角色化圣"
	,jns_6 = "jntb.wdf"
	,jns_7 = 620756992
	,jns_8 = 620756992
	,jns_12 = "6回合"
	}
skill取技能["同舟共济"]={
	jns_1 = "为目标友方分担前6次受到的伤害，持续到本回合结束。目标友方承受25%伤害，你承受25%伤害。"
	,jns_3 = 3
	,jns_4 = "200点魔法"
	,jns_5 = "当前气血比例≥50%"
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x57365436
	,jns_8 = 0x57365436
	,jns_12 = "4回合"
	}
skill取技能["妖风四起"]={
	jns_1 = "经脉介绍:驱动妖风封印敌人，使其不能使用法术，持续2回合。成功率与成功率上限为（夺魄令成功率+40%) ;该封印不能被水清、冰清、玉清、晶清解除。(对NPC时该效果无效)"
	,jns_4= "(当前气血×40%)点气血，100点魔法"
	,jns_3 = 4
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x8295E360
	,jns_8 = 0x8295E360
	,jns_12= "4回合"
	--五庄观技能
	}
skill取技能["潇湘仙雨"]={
	jns_1 = "学习效果:提高角色的伤害"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3541032788
	,jns_8 = 2723035390
	}
skill取技能["烟雨剑法"]={
	jns_1 = "对敌方单个目标发动2次物理攻击。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "潇湘仙雨技能达到25级，当前气血高于上限的60%"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3124546025
	,jns_8 = 3643055813
	}
skill取技能["侵蚀·烟雨剑法·刻骨"]={
	jns_1 = "对敌方单个目标发动2次物理攻击。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "潇湘仙雨技能达到25级。"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3124546025
	,jns_8 = 3643055813
	}
skill取技能["侵蚀·烟雨剑法·钻心"]={
	jns_1 = "对敌方单个目标发动2次物理攻击。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "潇湘仙雨技能达到25级。"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3124546025
	,jns_8 = 3643055813
	}
skill取技能["侵蚀·烟雨剑法·噬魂"]={
	jns_1 = "对敌方单个目标发动2次物理攻击。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "潇湘仙雨技能达到25级。"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3124546025
	,jns_8 = 3643055813
	}
skill取技能["飘渺式"]={
	jns_1 = "对敌方3个目标发动物理攻击。(对玩家使用时伤害为1)"
	,jns_3 = 4
	,jns_4 = "作用人数*30点魔法"
	,jns_5 = "潇湘仙雨技能达到20级"
	,jns_6 = "wzife.wd1"
	,jns_7 = 3268745174
	,jns_8 = 3398385178
	}
skill取技能["天地同寿"]={
	jns_1 = "为我方单个目标加上一个防御护罩，吸收全部法术伤害，但降低其一半的防御，同时承受的物理伤害增加，持续4回合。"
	,jns_3 = 9
	,jns_4 = "50点魔法"
	,jns_5 = "人物飞升且“乾坤袖”技能达到120级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4224047219
	,jns_8 = 3294906395
	}
skill取技能["心随意动"]={
	jns_1 = "这是五庄弟子的最高心境，于此心法下施展“日月乾坤”，令人陶陶乎直入另—个世界。激活后(再次使用关闭此状态)，持续8回合后自动关闭。持续回合内：1.增加(七星遁等级×2.2)的封印命中等级；⒉.使用日月乾坤封印成功后自己下回合不能使用日月乾坤。"
	,jns_3 = 2
	,jns_4 = "30点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xFD5AC0B0
	,jns_8 = 0xFD5AC0B0
	}
skill取技能["清风望月"]={
	jns_1 = "五庄观的弟子可以于乾坤腾挪之中领悟妙法，吸收2个队友身上的封印效果，但会使自己进入疯狂状态2回合。"
	,jns_3 = 3
	,jns_4 = "40点愤怒"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8FE977C4
	,jns_8 = 0x8FE977C4
	,jns_12 = "4回合"
	}
skill取技能["同伤式"]={
	jns_1 = "将自身所有增益状态临时转换为伤害发动致命一击，同时自身与目标速度差越高则伤害越高。"
	,jns_3 = 4
	,jns_4 = "50点魔法，消耗一个金鸦火羽"
	,jns_6 = "wzife.wd3"
	,jns_7 = 1801367551
	,jns_8 = 912434102
	,jns_12 = "16回合"
	}
skill取技能["乾坤袖"]={
	jns_1 = "掌握了道家玄理后，大道归一大能化小，小能作大，无中生有，有可成无，非常玄奥的技能。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2256743052
	,jns_8 = 3443276818
	}
skill取技能["乾坤妙法"]={
	jns_1 = "使友方单个目标不受任何伤害，但也无法行动，持续3回合。"
	,jns_3 = 9
	,jns_4 = "50点魔法"
	,jns_5 = "人物飞升且“乾坤袖”技能达到120级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1736041428
	,jns_8 = 3294906395
	}
skill取技能["一气化三清"]={
	jns_1 = "平时状态下使用，临时赋予铠甲/女衣提升魔力的功效，下线后消失。"
	,jns_3 = 12
	,jns_4 = "和技能等级数相同的活力"
	,jns_5 = "修仙术技能达到35级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4257500096
	,jns_8 = 2501870432
	}
skill取技能["日月乾坤"]={
	jns_1 = "使敌方单个目标无法使用普通攻击、法术和特技。成功率受技能等级与目标等级之差影响。"
	,jns_3 = 4
	,jns_4 = "35点魔法(成功)/10点魔法(失败)"
	,jns_5 = "乾坤袖技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3902929414
	,jns_8 = 3489253938
	}
skill取技能["侵蚀·日月乾坤·刻骨"]={
	jns_1 = "使敌方单个目标无法使用普通攻击、法术和特技。成功率受技能等级与目标等级之差影响。"
	,jns_3 = 4
	,jns_4 = "35点魔法(成功)/10点魔法(失败)"
	,jns_5 = "乾坤袖技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3902929414
	,jns_8 = 3489253938
	}
skill取技能["侵蚀·日月乾坤·钻心"]={
	jns_1 = "使敌方单个目标无法使用普通攻击、法术和特技。成功率受技能等级与目标等级之差影响。"
	,jns_3 = 4
	,jns_4 = "35点魔法(成功)/10点魔法(失败)"
	,jns_5 = "乾坤袖技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3902929414
	,jns_8 = 3489253938
	}
skill取技能["侵蚀·日月乾坤·噬魂"]={
	jns_1 = "使敌方单个目标无法使用普通攻击、法术和特技。成功率受技能等级与目标等级之差影响。"
	,jns_3 = 4
	,jns_4 = "35点魔法(成功)/10点魔法(失败)"
	,jns_5 = "乾坤袖技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3902929414
	,jns_8 = 3489253938
	}
skill取技能["修仙术"]={
	jns_1 = "是修练仙道之人必学的基本课程。无论修习何种教义，必先屏弃赏欲恶念，与其说这是修仙术，不如说是为人的基本道理。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3726980014
	,jns_8 = 1673560698
	}
skill取技能["生命之泉"]={
	jns_1 = "恢复我方多个目标的气血。"
	,jns_3 = 3
	,jns_4 = "作用人数*30点魔法"
	,jns_5 = "修仙术技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1093047199
	,jns_8 = 2757069702
	}
skill取技能["太极生化"]={
	jns_1 = "克制狮驼岭弟子的必杀技"
	,jns_3 = 4
	,jns_4 = "150点愤怒值"
	,jns_5 = "修仙术技能达到25级，人物等级达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1665649019
	,jns_8 = 1661704448
	}
skill取技能["炼气化神"]={
	jns_1 = "一定回合内补充自己和队友的魔法"
	,jns_3 = 3
	,jns_4 = "30点气血"
	,jns_5 = "修仙术技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2394667501
	,jns_8 = 1686425132
	}
skill取技能["驱尸"]={
	jns_1 = "解除我方单个目标的中毒状态"
	,jns_3 = 3
	,jns_4 = "40点魔法"
	,jns_5 = "周易学技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1226417381
	,jns_8 = 546827248
	}
skill取技能["周易学"]={
	jns_1 = "学习效果:提高角色的魔法上限"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 951717916
	,jns_8 = 3182787390
	}
skill取技能["驱魔"]={
	jns_1 = "解除并避免方寸山封类法术的影响"
	,jns_3 = 6
	,jns_4 = "45点魔法"
	,jns_5 = "周易学技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1284415330
	,jns_8 = 656352481
	}
skill取技能["玄黄秘术"]={
	jns_1 = "点化处在“未点化”状态下的人参果。"
	,jns_3 = 6
	,jns_4 = "50点活力、体力"
	,jns_5 = "周易学技能达到25级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 2483027968
	,jns_8 = 2483027968
	}
skill取技能["混元道果"]={
	jns_1 = "学习效果:提高角色的法伤和法防"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 675093303
	,jns_8 = 3799123064
	}
skill取技能["明性修身"]={
	jns_1 = "学习效果:提高角色的防御"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 4104116990
	,jns_8 = 3074583809
	}
skill取技能["三花聚顶"]={
	jns_1 = "消耗一定的气血来补充魔法"
	,jns_3 = 5
	,jns_4 = "30点气血"
	,jns_5 = "明性修身技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3813527840
	,jns_8 = 3150915326
	}
skill取技能["七星遁"]={
	jns_1 = "学习效果:提高角色的躲避"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 923985229
	,jns_8 = 2400021580
	}
skill取技能["斗转星移"]={
	jns_1 = "平时状态下使用，可以瞬间回到自己的门派"
	,jns_3 = 0
	,jns_4 = "10点气血和10点魔法"
	,jns_5 = "七星遁技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2019188530
	,jns_8 = 655674701
	}
skill取技能["敲金击玉"]={
	jns_1 = "【功效】物理攻击单个目标,你所有的人参娃娃会参与此次攻击并造成额外伤害。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "潇湘仙雨技能达到25级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1140850688
	,jns_8 = 1140850688
	}
skill取技能["侵蚀·敲金击玉·刻骨"]={
	jns_1 = "【功效】物理攻击单个目标,你所有的人参娃娃会参与此次攻击并造成额外伤害。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "潇湘仙雨技能达到25级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1140850688
	,jns_8 = 1140850688
	}
skill取技能["侵蚀·敲金击玉·钻心"]={
	jns_1 = "【功效】物理攻击单个目标,你所有的人参娃娃会参与此次攻击并造成额外伤害。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "潇湘仙雨技能达到25级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1140850688
	,jns_8 = 1140850688
	}
skill取技能["侵蚀·敲金击玉·噬魂"]={
	jns_1 = "【功效】物理攻击单个目标,你所有的人参娃娃会参与此次攻击并造成额外伤害。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "潇湘仙雨技能达到25级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1140850688
	,jns_8 = 1140850688
	}
skill取技能["金击式"]={
	jns_1 = "对敌方3个目标发动物理攻击。(对玩家使用时伤害为1)"
	,jns_3 = 4
	,jns_4 = "作用人数*30点魔法"
	,jns_5 = "潇湘仙雨技能达到20级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 805306368
	,jns_8 = 805306368
	}
skill取技能["天命剑法"]={
	jns_1 = "率意而行、道法自然，在五庄弟子出手之际，他自身也道不出这一招之中蕴含了多少剑意。或许，只有冥冥之中的三清可知吧？以无人能够预知的剑术攻击目标，对其随机发动1~7次物理攻击。使用后下回合不能行动。使用需要气血≥气血上限的70%"
	,jns_3 = 4
	,jns_4 = "(最大气血的2%×实际攻击次数)点气血"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x30EA31AF
	,jns_8 = 0x30EA31AF
	,jns_12 ="4回合"
	}
skill取技能["落土止息"]={
	jns_1 = "经脉介绍:发动一次猛烈的攻击，你的人参娃娃会与你一同攻击，且额外造成的伤害翻倍。使用后临时降低防御与法防，所有人参娃娃消失，你休息1回合。"
	,jns_4 = "100点魔法"
	,jns_3 = 4
	,jns_6 = "jntb.wdf"
	,jns_7 = 889192448
	,jns_8 = 889192448
	--地府技能
	}
skill取技能["六道轮回"]={
	jns_1 = "学习效果:提高角色的伤害，夜间提高的伤害更多，并且随着白天黑夜更替而产生变化。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2191025103
	,jns_8 = 1761343362
	}
skill取技能["九幽阴魂"]={
	jns_1 = "学习效果:提高角色的法伤和法防"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2427286393
	,jns_8 = 2803361004
	}
skill取技能["魂飞魄散"]={
	jns_1 = "驱散敌方2个目标随机1个增益状态。 "
	,jns_3 = 4
	,jns_4 = "40点魔法"
	,jns_5 = "“六道轮回”技能达到50级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 1594584941
	,jns_8 = 2719875429
	}
skill取技能["堪察令"]={
	jns_1 = "鉴定头盔、饰品、腰带、靴子等类装备，学习后也可在长安书店制作相应等级的“灵宝图鉴”。"
	,jns_3 = 12
	,jns_4 = "一定的活力，视装备等级而定"
	,jns_5 = "灵通术技能达到5级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4073909039
	,jns_8 = 2150653771
	}
skill取技能["六道无量"]={
	jns_1 = "法术驱动的必中单体物理攻击技能，攻击时额外对一个带有尸腐毒的单位起效。该技能攻击玩家时，双方防御下降(双方防御差产0.75(最高为自身等级* 1.6+70)，持续2回合。"
	,jns_3 = 4
	,jns_4 = "40点魔法"
	,jns_5 = "“六道轮回”技能达到45级"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xBC2DD56E
	,jns_8 = 0xBC2DD56E
	}
skill取技能["百爪狂杀"]={
	jns_1 = "经脉介绍:【被动】你被封印的几率增加20%【主动】法术驱动的必中物理攻击，可攻击4个目标;每增加1个攻击目标，对所有目标的伤害结果降低10%。作用目标按速度排序选择。如果你的武器带有“必中”特效，则提升10%(3%)的伤害结果。(括号内为目标为NPC时的效果)"
	,jns_4 = "作用人数×35点魔法"
	,jns_3 = 4
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8FCE05BE
	,jns_8 = 0x8FCE05BE
	}
skill取技能["幽冥术"]={
	jns_1 = "地府弟子能够汲取阴司的幽冥之气，辅助自己练功，从而得到一种神秘的力量。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2105426613
	,jns_8 = 414994835
	}
skill取技能["幽冥鬼眼"]={
	jns_1 = "使用后可以看到隐身的目标并增加10%的抗封效果。"
	,jns_3 = 5
	,jns_4 = "20点魔法"
	,jns_5 = "九幽阴魂技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1975607386
	,jns_8 = 2807639015
	}
skill取技能["阎罗令"]={
	jns_1 = "可攻击多人，减少对手的气血和气血上限。夜晚使用效果提高。"
	,jns_3 = 4
	,jns_4 = "20点魔法，作用于多人时消耗增加"
	,jns_5 = "幽冥术技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2806354228
	,jns_8 = 3446923388
	}
skill取技能["黄泉之息"]={
	jns_1 = "对敌方单个目标造成固定伤害，并降低目标的速度"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "人物飞升且“幽冥术”技能达到120级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 3536984715
	,jns_8 = 1893059881
	}
skill取技能["魍魉追魂"]={
	jns_1 = "地府弟子可以招来地狱深处的魑魅魍魉协助队友进行攻击。对本方—个死亡的单位附加“魍魉追魂”效果：造成的物理法术伤害提高(4+2×N)%，N为本方带有“魍魉追魂”的单位数，持续到战斗结束(不可驱散)。"
	,jns_3 = 3
	,jns_4 = "100点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x2B37D923
	,jns_8 = 0x2B37D923
	,jns_12 = "4回合"
	}
skill取技能["锢魂术"]={
	jns_1 = "使用成功后可使目标5个回合内在死亡状态下无法被复活。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "幽冥术技能达到75级"
	,jns_6 = "wzife.wd1"
	,jns_7 = 1727365486
	,jns_8 = 784403165
	}
skill取技能["侵蚀·幽夜无明·刻骨"]={
	jns_1 = "对敌方全体目标施加1（刻骨）/1～2（钻心）/2（噬魂）回合的锢魂术状态。随着侵蚀程度额外提高目标受到来自玩家的伤害。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "幽冥术技能达到75级"
	,jns_6 = "wzife.wd1"
	,jns_7 = 1727365486
	,jns_8 = 784403165
	}
skill取技能["侵蚀·幽夜无明·噬魂"]={
	jns_1 = "对敌方全体目标施加1（刻骨）/1～2（钻心）/2（噬魂）回合的锢魂术状态。随着侵蚀程度额外提高目标受到来自玩家的伤害。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "幽冥术技能达到75级"
	,jns_6 = "wzife.wd1"
	,jns_7 = 1727365486
	,jns_8 = 784403165
	}
skill取技能["侵蚀·幽夜无明·钻心"]={
	jns_1 = "对敌方全体目标施加1（刻骨）/1～2（钻心）/2（噬魂）回合的锢魂术状态。随着侵蚀程度额外提高目标受到来自玩家的伤害。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "幽冥术技能达到75级"
	,jns_6 = "wzife.wd1"
	,jns_7 = 1727365486
	,jns_8 = 784403165
	}
skill取技能["无间地狱"]={
	jns_1 = "(场地法术)提高双方所有单位受到的伤害，所有阵亡的单位会被附加2回合的“死亡禁锢”，持续3回合。"
	,jns_3 = 2
	,jns_4 = "100点魔法"
	,jns_6 = "wzife.wd3"
	,jns_7 = 4045502576
	,jns_8 = 3388648357
	,jns_12 = "10回合"
	}
skill取技能["拘魂诀"]={
	jns_1 = "“夜半鬼索魂，哀哭骇人心。拘魂索魄可谓是地府弟子的享手好戏。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1622524729
	,jns_8 = 3403104810
	}
skill取技能["尸气漫天"]={
	jns_1 = "平时状态下使用，临时赋予头盔/发钗提升耐力的功效，下线后消失。"
	,jns_3 = 12
	,jns_4 = "和技能等级数相同的活力"
	,jns_5 = "拘魂诀技能达到35级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 3830562709
	,jns_8 = 3540479557
	}
skill取技能["判官令"]={
	jns_1 = "对敌方单个目标造成固定伤害，并减少目标的魔法。夜晚使用效果提高。"
	,jns_3 = 4
	,jns_4 = "20点魔法"
	,jns_5 = "拘魂诀技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1671969153
	,jns_8 = 3702239149
	}
skill取技能["还阳术"]={
	jns_1 = "复活倒地的友方玩家，复活后增加其伤害，降低其防御直至战斗结束。最高增加50%伤害，最高减少50%防御"
	,jns_3 = 10
	,jns_4 = "150点魔法"
	,jns_5 = "人物飞升且“拘魂诀”技能达到120级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 2874709055
	,jns_8 = 485361049
	}
skill取技能["噬毒"]={
	jns_1 = "净化一个敌方单位带有的“尸腐毒”，受到(人物等级×10)点伤害，但是你的下一个六道无星造成伤害提高60%且增加10%的暴击几率，下一个百爪狂杀造成伤害提高60%且对敌方玩家附加防御降低效果;若目标不带有“尸腐毒”效果，你随机获得其中一个增益状态且不会受到伤害。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x72ED61A1
	,jns_8 = 0x72ED61A1
	,jns_12 = "8回合"
	}
skill取技能["灵通术"]={
	jns_1 = "地府弟子首先要懂得如何与幽冥的力量进行沟通，以获得更多的灵气，这是学习本门其他技能的基础。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 695584869
	,jns_8 = 577240546
	}
skill取技能["寡欲令"]={
	jns_1 = "解除并避免盘丝洞封类法术的影响。"
	,jns_3 = 5
	,jns_4 = "50点魔法"
	,jns_5 = "灵通术技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 653757983
	,jns_8 = 482656655
	}
skill取技能["冤魂不散"]={
	jns_1 = "克制大唐官府弟子的必杀技。"
	,jns_3 = 4
	,jns_4 = "150点愤怒值"
	,jns_5 = "九幽阴魂技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3587078621
	,jns_8 = 376661686
	}
skill取技能["尸腐恶"]={
	jns_1 = "学习效果:提高角色的防御"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3997271777
	,jns_8 = 22951667
	}
skill取技能["尸腐毒"]={
	jns_1 = "令对手中“尸毒”，每回合按一定比例掉血"
	,jns_3 = 4
	,jns_4 = "40点魔法"
	,jns_5 = "尸腐恶技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 49094427
	,jns_8 = 2328293467
	}
skill取技能["修罗隐身"]={
	jns_1 = "使友方目标处于隐身状态。"
	,jns_3 = 4
	,jns_4 = "150点魔法"
	,jns_5 = "尸腐恶技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 557290721
	,jns_8 = 3076118166
	}
skill取技能["无常步"]={
	jns_1 = "学习效果:提高角色的躲避"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2772099555
	,jns_8 = 71871380
	}
skill取技能["杳无音讯"]={
	jns_1 = "平时状态下使用，可以瞬间回到自己的门派。"
	,jns_3 = 0
	,jns_4 = "10点气血和10点魔法"
	,jns_5 = "无常步技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2049632078
	,jns_8 = 739072521
	}
skill取技能["百鬼噬魂"]={
	jns_1 = "【功效】对敌方4个目标造成物理伤害,攻击时有概率附加“尸腐毒”状态。"
	,jns_3 = 4
	,jns_4 = "(35*作用目标数)点魔法"
	,jns_5 = "尸腐恶技能达到20级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 285212672
	,jns_8 = 285212672
	}
skill取技能["血影蚀心"]={
	jns_1 = "【功效】对敌方单个目标造成物理伤害,攻击时有概率附加“尸腐毒”状态。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "尸腐恶技能达到20级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1409286144
	,jns_8 = 1409286144
	}
skill取技能["无赦咒令"]={
	jns_1 = "经脉介绍:对目标发起物理攻击，伤害为普通攻击的110%，随机驱散目标1个增益状态，如果目标带毒类异常，则驱散2个。"
	,jns_4 = "50点魔法"
	,jns_3 = 4
	,jns_6 = "jntb.wdf"
	,jns_7 = 2197815296
	,jns_8 = 2197815296
	}
skill取技能["森罗迷瘴"]={
	jns_1 = "【功效】使你门派法术附加尸腐毒”的几率提高,持续10回合。"
	,jns_3 = 2
	,jns_4 = "100点魔法"
	,jns_5 = "尸腐恶技能达到20级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 2432696320
	,jns_8 = 2432696320
	}
skill取技能["生杀予夺"]={
	jns_1 = "经脉介绍:提高伤害对一个目标发起一次物理攻击:1)若目标带毒，此次攻击暴击伤害倍率增加60%;2)队伍中只有一个阴曹地府弟子时:回合结束时额外减少(敌方场上尸腐毒数量)的冷却回合。"
	,jns_4 = "100点魔法"
	,jns_3 = 4
	,jns_6 = "jntb.wdf"
	,jns_7 = 2164260864
	,jns_8 = 2164260864
	,jns_12 ="36回合"
	}
skill取技能["高级慧根"]={
	jns_1 = "使用法术时所消耗的魔法降低为正常的50%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 242180125
	,jns_8 = 4174265955
	}
skill取技能["水攻"]={
	jns_1 = "水属性的攻击法术，按召唤兽等级附加一定的法术伤害"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 85059369
	,jns_8 = 2415441344
	}
skill取技能["养生之道"]={
	jns_1 = "修身养性，固本清元之术，学习可以增加4点活力上限"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 968832765
	,jns_8 = 1635371623
	}
skill取技能["法术抵抗"]={
	jns_1 = "减少5%所受的法术伤害，但同时物理伤害能力降低10%。"
	,jns_3 = 7
	,jns_6 = "wzife.wd2"
	,jns_7 = 3908900845
	,jns_8 = 3908900845
	}
skill取技能["高级法术抵抗"]={
	jns_1 = "减少10%所受的法术伤害，但同时物理伤害能力降低10%。"
	,jns_3 = 7
	,jns_6 = "wzife.wd2"
	,jns_7 = 3908900845
	,jns_8 = 3908900845
	}
skill取技能["高级反震"]={
	jns_1 = "受到物理攻击时有30%几率给予对方反震，反震伤害为所受伤害的50%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1907422702
	,jns_8 = 511662384
	}
skill取技能["高级防御"]={
	jns_1 = "增加(自身等级×0.8)的防御，但法术伤害能力会降低10%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1616189465
	,jns_8 = 3783015310
	}
skill取技能["否定信仰"]={
	jns_1 = "不受异常、辅助效果影响，受到鬼魂类怪物攻击时伤害增加50%，不能同时拥有某些信仰类技能"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 3345212313
	,jns_8 = 3002471686
	}
skill取技能["法术暴击"]={
	jns_1 = "使用法术攻击目标时会有一定几率使法术伤害值加倍"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1389982585
	,jns_8 = 1108386617
	}
skill取技能["高级偷袭"]={
	jns_1 = "身手灵敏，不会受到反击和反震，物理攻击效果提高10%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 4012815828
	,jns_8 = 1555617599
	}
skill取技能["高级冥思"]={
	jns_1 = "战斗中每回合自动恢复(自身等级/3)的魔法"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1718714912
	,jns_8 = 2174943999
	}
skill取技能["健身术"]={
	jns_1 = "由华佗所创的五禽戏发展而来，学习可以增加4点体力上限"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3589295296
	,jns_8 = 3157390677
	}
skill取技能["强力"]={
	jns_1 = "增加(自身等级×0.4)的攻击，如果对方有防御或高级防御技能，伤害结果会减少20%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1458903425
	,jns_8 = 707555275
	}
skill取技能["冥思"]={
	jns_1 = "战斗中每回合自动恢复(自身等级/4)的魔法"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 622128415
	,jns_8 = 3554832714
	}
skill取技能["高级雷属性吸收"]={
	jns_1 = "30%的几率免受雷属性法术伤害，并按应受伤害的大小恢复气血，吸收失败也可减少法术伤害的30%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1654409054
	,jns_8 = 119787649
	}
skill取技能["雷属性吸收"]={
	jns_1 = "30%的几率免受雷属性法术伤害，并按应受伤害的大小恢复气血，吸收失败也可减少法术伤害的30%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1654409054
	,jns_8 = 119787649
	}
skill取技能["奔雷咒"]={
	jns_1 = "雷属性的攻击法术，按召唤兽等级附加一定的法术伤害，攻击人数为(自身等级/30+1)，最多为3人"
	,jns_3 = 4
	,jns_4 = "作用目标*30点魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2858620755
	,jns_8 = 3666293224
	}
skill取技能["高级法术波动"]={
	jns_1 = "使用法术攻击目标时伤害在原有伤害值基础上会有较大幅度的上下波动，避免被敌人法术反震"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2322584044
	,jns_8 = 3668919080
	}
skill取技能["高级再生"]={
	jns_1 = "战斗中每回合自动恢复气血，恢复数值与自身等级相同"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 468221024
	,jns_8 = 3809634425
	}
skill取技能["永恒"]={
	jns_1 = "受到的辅助类法术效果持续回合加倍，如恢复气血、提升速度等"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1988160424
	,jns_8 = 1508625069
	}
skill取技能["高级吸血"]={
	jns_1 = "物理攻击时，吸取对方所掉气血的30%，攻击鬼魂类怪物时无效"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1364867245
	,jns_8 = 2545117654
	}
skill取技能["巧匠之术"]={
	jns_1 = "关于家具制作的技能，懂得一定的巧匠之术后，可以去找住在长寿村的工匠鲁成，制作各种家具的“设计图”"
	,jns_3 = 4
	,jns_6 = "wzife.wdf"
	,jns_7 = 1296624794
	,jns_8 = 1296624794
	}
skill取技能["水漫金山"]={
	jns_1 = "水属性的攻击法术，按召唤兽等级附加一定的法术伤害，攻击人数为(自身等级除以30+1)，最多为3人"
	,jns_3 = 4
	,jns_4 = "作用目标*30点魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2637597442
	,jns_8 = 3867686033
	}
skill取技能["追捕技巧"]={
	jns_1 = "可以降低对手逃跑的成功率，但最低不小于10%"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 123566127
	,jns_8 = 902425300
	}
skill取技能["逃离技巧"]={
	jns_1 = "学习后可以提高战斗逃跑的成功率，但最高不超过90%"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1198324882
	,jns_8 = 1820394508
	}
------------------
skill取技能["气血强化"]={
	jns_1 = "每级消耗技能等级*50000的经验和银两，每级增加10点气血。"
	,jns_3 = 8
	,jns_6 = "nvdi1.wdf"
	,jns_7 = 0x077F08D1
	,jns_8 = 0x077F08D1
	}
skill取技能["伤害强化"]={
	jns_1 = "每级消耗技能等级*50000的经验和银两，每级增加1点伤害。"
	,jns_3 = 8
	,jns_6 = "nvdi1.wdf"
	,jns_7 = 0x2D685412
	,jns_8 = 0x2D685412
	}
skill取技能["防御强化"]={
	jns_1 = "每级消耗技能等级*50000的经验和银两，每级增加1点防御。"
	,jns_3 = 8
	,jns_6 = "nvdi1.wdf"
	,jns_7 = 0x83A054A5
	,jns_8 = 0x83A054A5
	}
skill取技能["法伤强化"]={
	jns_1 = "每级消耗技能等级*50000的经验和银两，每级增加1点法伤。"
	,jns_3 = 8
	,jns_6 = "nvdi1.wdf"
	,jns_7 = 0xD1EBF7E3
	,jns_8 = 0xD1EBF7E3
	}
skill取技能["法防强化"]={
	jns_1 = "每级消耗技能等级*50000的经验和银两，每级增加1点法防。"
	,jns_3 = 8
	,jns_6 = "nvdi1.wdf"
	,jns_7 = 0x3FC666BA
	,jns_8 = 0x3FC666BA
	}
skill取技能["治疗强化"]={
	jns_1 = "每级消耗技能等级*50000的经验和银两，每级增加1点治疗能力。"
	,jns_3 = 8
	,jns_6 = "nvdi1.wdf"
	,jns_7 = 0x624C7E94
	,jns_8 = 0x624C7E94
	}
skill取技能["固伤强化"]={
	jns_1 = "每级消耗技能等级*50000的经验和银两，每级增加2点固伤。"
	,jns_3 = 8
	,jns_6 = "nvdi1.wdf"
	,jns_7 = 0xD3236E57
	,jns_8 = 0xD3236E57
	}
------------------
skill取技能["烹饪技巧"]={
	jns_1 = "传自商代名厨伊尹的技能，可以提高制作食物的能力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2019196942
	,jns_8 = 3782401606
	}
skill取技能["中药医理"]={
	jns_1 = "精通歧黄之术往往可以提高炼制丹药的能力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3878607199
	,jns_8 = 642378453
	}
skill取技能["炼金术"]={
	jns_1 = "秘术士私传的炼金之术，可以提高制作饰品、靴子和腰带的能力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1324974820
	,jns_8 = 333902768
	}
skill取技能["剑荡四方"]={
	jns_1 = "使用时可攻击多人。指定的目标受到一定伤害，并造成其他任意两个目标少量伤害。"
	,jns_3 = 4
	,jns_4 = "当前气血的百分之十"
	,jns_6 = "wzife.wd1"
	,jns_7 = 1668746823
	,jns_8 = 1668746823
	}
skill取技能["裁缝技巧"]={
	jns_1 = "从天衣无缝针法演化而来，可提高缝制头盔和铠甲的能力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1071853506
	,jns_8 = 1758794729
	}
skill取技能["落岩"]={
	jns_1 = "土属性的攻击法术，按召唤兽等级附加一定的法术伤害"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4226735508
	,jns_8 = 300977089
	}
skill取技能["暗器技巧"]={
	jns_1 = "暗器名家的家传秘笈，学习后可以增加使用暗器的伤害力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2101102727
	,jns_8 = 1473796032
	}
skill取技能["冥想"]={
	jns_1 = "通过冥想凝聚强大的精神力量，学习可以提高魔法上限"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 97139368
	,jns_8 = 903007607
	}
skill取技能["弱点土"]={
	jns_1 = "弱点为土，受到土属性法术攻击时伤害增加50%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2234852568
	,jns_8 = 910396241
	}
skill取技能["强身术"]={
	jns_1 = "强身健体是习武之人的根本，学习后可以提高气血上限"
	,jns_2 = "强身健体是习武之人的根本，学习后可以提高气血上限"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3597995533
	,jns_8 = 732966867
	}
skill取技能["强壮"]={
	jns_1 = "每学习1级可提高15点气血上限(受强身影响)"
	,jns_3 = 8
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 2458245611
	,jns_8 = 1870892091
	}
skill取技能["神速"]={
	jns_1 = "每学习1级增加1.5速度。"
	,jns_3 = 8
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 440987942
	,jns_8 = 3473412458
	}
skill取技能["御兽术"]={
	jns_1 = "御兽术，学习后可以提高每级提示0.01%战斗的全属性"
	,jns_3 = 8
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 3947876534
	,jns_8 = 3256658495
	}
skill取技能["熔炼技巧"]={
	jns_1 = "异邦传入中土的锻造技巧，利用独特方法锻造而出的钨金，具有提升装备能力的特性。"
	,jns_3 = 8
	,jns_6 = "wzife.wd1"
	,jns_7 = 0x2e8a8a30
	,jns_8 = 0x2e8a8a30
	}
skill取技能["淬灵之术"]={
	jns_1 = "传自仙界的聚灵萃取之术，虽无鬼斧神工之能，但依此术借三界间诸般奇物，亦能聚灵成物。提升制作灵饰的能力，可将对应的灵饰指南书与元灵品石打造成灵饰。"
	,jns_3 = 8
	,jns_6 = "wzife.wd3"
	,jns_7 = 0x825dde6b
	,jns_8 = 0x825dde6b
	}
skill取技能["灵石技巧"]={
	jns_1 = "可在百炼精铁和天眼珠中提炼出精魄灵石，并且能将同类的精魄灵石进行合成、镶嵌"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 208669879
	,jns_8 = 208669879
	}
skill取技能["敏捷"]={
	jns_1 = "提高自身速度的10%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 3132756451
	,jns_8 = 4289478506
	}
skill取技能["火属性吸收"]={
	jns_1 = "30%的几率免受火属性法术伤害，并按应受伤害的大小恢复气血，但受到火属性法术攻击时伤害会增加30%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 4098020456
	,jns_8 = 4092454521
	}
skill取技能["泰山压顶"]={
	jns_1 = "土属性的攻击法术，按召唤兽等级附加一定的法术伤害，攻击人数为(自身等级除以30+1)，最多为3人"
	,jns_3 = 4
	,jns_4 = "作用目标*30点魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 463605150
	,jns_8 = 463605150
	}
skill取技能["毒"]={
	jns_1 = "物理攻击时有15%的几率使敌人中毒，中毒后每回合减少10%的气血和5%的魔法"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 142259178
	,jns_8 = 3804526840
	}
skill取技能["高级毒"]={
	jns_1 = "自身对毒免疫，物理攻击时有20%的几率使敌人中毒，中毒后每回合减少10%的气血和5%的魔法"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 589320553
	,jns_8 = 1086230366
	}
skill取技能["高级反击"]={
	jns_1 = "受到物理攻击时有30%几率自动反击，反击的伤害与正常攻击相同"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 3922527672
	,jns_8 = 3922527672
	}
skill取技能["高级神迹"]={
	jns_1 = "不受除日月乾坤外的所有异常状态影响"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 705701591
	,jns_8 = 4235295997
	}
skill取技能["地狱烈火"]={
	jns_1 = "火属性的攻击法术，按召唤兽等级附加一定的法术伤害，攻击人数为(自身等级除以30+1)，最多为3人"
	,jns_3 = 4
	,jns_4 = "作用目标*30点魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4223394612
	,jns_8 = 3042874244
	}
skill取技能["高级飞行"]={
	jns_1 = "躲避能力增加30%、物理攻击命中增加20%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 4277341965
	,jns_8 = 3853120636
	}
skill取技能["高级强力"]={
	jns_1 = "增加(自身等级×0.715)的攻击，如果对方有防御或高级防御技能，伤害结果会减少20%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 3563500497
	,jns_8 = 2177485118
	}
skill取技能["弱点水"]={
	jns_1 = "弱点为水，受到水属性法术攻击时伤害增加50%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 803997825
	,jns_8 = 1114088245
	}
skill取技能["慧根"]={
	jns_1 = "使用法术时所消耗的魔法降低为正常的75%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1457451798
	,jns_8 = 3365576412
	}
skill取技能["高级鬼魂术"]={
	jns_1 = "死亡5回合后自动复活，不受异常状态影响"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2436724533
	,jns_8 = 3547941491
	}
skill取技能["高级驱鬼"]={
	jns_1 = "对鬼魂类怪物的物理、法术伤害效果加倍，如果将鬼魂类怪物打死，对方将飞出场外而不能复活"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 72429538
	,jns_8 = 72429538
	}
skill取技能["高级幸运"]={
	jns_1 = "不会受到必杀攻击，并有5%几率躲避敌人的法术攻击"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1781077356
	,jns_8 = 481753720
	}
skill取技能["高级法术暴击"]={
	jns_1 = "使用法术攻击目标时会有较大几率使法术伤害值加倍"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2071863113
	,jns_8 = 1628140681
	}
skill取技能["高级魔之心"]={
	jns_1 = "对敌人的法术伤害效果提高20%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2586072698
	,jns_8 = 2875710379
	}
skill取技能["迟钝"]={
	jns_1 = "天生行动缓慢，速度效果会降低20%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2619272788
	,jns_8 = 274661895
	}
skill取技能["高级迟钝"]={
	jns_1 = "天生行动缓慢，速度效果会降低20%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2619272788
	,jns_8 = 274661895
	}
skill取技能["高级敏捷"]={
	jns_1 = "提升自身速度的20%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1248152147
	,jns_8 = 2061355872
	}
skill取技能["精神集中"]={
	jns_1 = "精神集中，可以抵御封类异常状态，但自己的物理攻击效果也会降低20%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 4141937856
	,jns_8 = 2799682055
	}
skill取技能["防御"]={
	jns_1 = "增加(自身等级×0.6)的防御，但法术伤害能力会降低10%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 91393867
	,jns_8 = 4101692183
	}
skill取技能["感知"]={
	jns_1 = "可以破解地府的修罗隐身、女儿村的楚楚可怜法术效果"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 3677043818
	,jns_8 = 4012137980
	}
skill取技能["招架"]={
	jns_1 = "每回合受到的第1次物理伤害结果减免10%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2387844026
	,jns_8 = 3512730332
	}
skill取技能["弱点雷"]={
	jns_1 = "弱点为雷，受到雷属性法术攻击时伤害增加50%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2886112942
	,jns_8 = 2605672758
	}
skill取技能["弱点火"]={
	jns_1 = "弱点为火，受到火属性法术攻击时伤害增加50%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1546100078
	,jns_8 = 4005696838
	}
skill取技能["苍鸾怒击"]={
	jns_1 = "普通物理攻击发生必杀或连击时，临时提升10%伤害力随机攻击另一个目标，每回合最多触发一次。"
	,jns_3 = 7
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 3329378845
	,jns_8 = 3329378845
	}
skill取技能["夜战"]={
	jns_1 = "具备夜战能力，不受夜间攻防能力下降的影响"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xDD5CEE60
	,jns_8 = 0xDD5CEE60
	}
skill取技能["高级夜战"]={
	jns_1 = "具备夜战能力，不受夜间攻防能力下降的影响，夜间躲避能力提高20%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x3E81ECFB
	,jns_8 = 0x3E81ECFB
	}
skill取技能["烈火"]={
	jns_1 = "火属性的攻击法术，按召唤兽等级附加一定的法术伤害"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2966154175
	,jns_8 = 1668132272
	}
skill取技能["高级土属性吸收"]={
	jns_1 = "30%的几率免受土属性法术伤害，并按应受伤害的大小恢复气血，吸收失败也可减少法术伤害的30%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2639364118
	,jns_8 = 751839372
	}
skill取技能["高级感知"]={
	jns_1 = "破解地府的修罗隐身、女儿村的楚楚可怜法术效果，躲避能力提高10%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 675296013
	,jns_8 = 1822711583
	}
skill取技能["高级水属性吸收"]={
	jns_1 = "30%的几率免受水属性法术伤害，并按应受伤害的大小恢复气血，吸收失败也可减少法术伤害的30%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2532360260
	,jns_8 = 1312179231
	}
skill取技能["须弥真言"]={
	jns_1 = "增加魔力*0.4的法术伤害力"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777776
	,jns_8 = 16777776
	}
skill取技能["超级三昧真火"]={
	jns_1 = "对敌方单个目标造成法术伤害。-比我爹的牛"
	,jns_3 = 4
	,jns_6 = "沉默.wdf"
	,jns_7 = 0x00000070
	,jns_8 = 0x00000070
	}
skill取技能["圣婴大王"]={
	jns_1 = "增加自身魔力*0.5的法术伤害力-你才修炼几年？"
	,jns_3 = 7
	,jns_6 = "沉默.wdf"
	,jns_7 = 0xDDDD3187
	,jns_8 = 0xDDDD3187
	}
skill取技能["桀骜自恃"]={
	jns_1 = "法术暴击几率增加50%，且不会逃跑，不与法爆共存"
	,jns_3 = 7
	,jns_6 = "沉默.wdf"
	,jns_7 = 0x00000071
	,jns_8 = 0x00000071
	}
------------------------------
-- skill取技能["与生俱来"]={
-- 	jns_1 = "增加自身血量*30%"
-- 	,jns_3 = 7
-- 	,jns_6 = "xinjn.wdf"
-- 	,jns_7 = 0x00000005
-- 	,jns_8 = 0x00000005
-- 	}
-- skill取技能["义薄云天"]={
-- 	jns_1 = "增加自身等级*0.55的法术伤害，战斗中不会触发自动逃跑"
-- 	,jns_3 = 7
-- 	,jns_6 = "xinjn.wdf"
-- 	,jns_7 = 0x00000004
-- 	,jns_8 = 0x00000004
-- 	}
-- skill取技能["柳暗花明"]={
-- 	jns_1 = "触发法术连增加10%几率，提升法术连击时10%伤害"
-- 	,jns_3 = 7
-- 	,jns_6 = "xinjn.wdf"
-- 	,jns_7 = 0x00000003
-- 	,jns_8 = 0x00000003
-- 	}
-- skill取技能["气贯长虹"]={
-- 	jns_1 = "触发连击高级连击时，伤害提高25-50%。"
-- 	,jns_3 = 7
-- 	,jns_6 = "xinjn.wdf"
-- 	,jns_7 = 0x00000002
-- 	,jns_8 = 0x00000002
-- 	}
skill取技能["无上正真"]={
	jns_1 = "增加力量*0.4的物理伤害力。"
	,jns_3 = 7
	,jns_6 = "xinjn.wdf"
	,jns_7 = 0x00000001
	,jns_8 = 0x00000001
	}
  ---------------------------------------------
skill取技能["柳暗花明"]={
	jns_1 = "每次没有触发法术连击的施法，提升法术连击时50%伤害结果。（最多2层，在触发法术连击时清空）"
	,jns_3 = 7
	,jns_6 = "沉默.wdf"
	,jns_7 = 0xabc00074
	,jns_8 = 0xabc00074
	}
skill取技能["气贯长虹"]={
	 jns_1 = "触发连击、高级连击时，伤害提高25%至50%"
	,jns_3 = 7
	,jns_6 = "沉默.wdf"
	,jns_7 = 0xabc00073
	,jns_8 = 0xabc00073
	}
skill取技能["义薄云天"]={
	jns_1 = "施法时增加自身等级*0.55的法术伤害力；战斗中不会触发自动逃跑。"
	,jns_3 = 7
	,jns_6 = "沉默.wdf"
	,jns_7 = 0xabc00072
	,jns_8 = 0xabc00072
	}
skill取技能["与生俱来"]={
	 jns_1 = "进入战斗时，自动获得自身血量*30%的护盾。"
	,jns_3 = 7
	,jns_6 = "沉默.wdf"
	,jns_7 = 0xabc00071
	,jns_8 = 0xabc00071
	}
skill取技能["土属性吸收"]={
	jns_1 = "30%的几率免受土属性法术伤害，并按应受伤害的大小恢复气血，但受到雷属性法术攻击时伤害会增加30%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 134325226
	,jns_8 = 3503123353
	}
skill取技能["高级必杀"]={
	jns_1 = "物理攻击时的必杀几率增加20%，出现必杀时伤害结果会加倍"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1672890477
	,jns_8 = 1282412196
	}
skill取技能["再生"]={
	jns_1 = "战斗中每回合自动恢复(自身等级一半)的气血"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 3287776911
	,jns_8 = 2264480315
	}
skill取技能["连击"]={
	jns_1 = "45%的几率连续两次物理攻击，如果对方有反震技能，只能攻击一次"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1161065019
	,jns_8 = 834880568
	}
skill取技能["鬼魂术"]={
	jns_1 = "死亡5回合后自动复活，不受异常状态影响，但也不能使用药品和食物恢复气血（可以食用包子）"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 813494718
	,jns_8 = 4276424619
	}
skill取技能["法术波动"]={
	jns_1 = "使用法术攻击目标时伤害在原有伤害值基础上会有大幅度的波动，避免被敌人法术反震"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 762242741
	,jns_8 = 267613400
	}
skill取技能["魔之心"]={
	jns_1 = "对敌人的法术伤害效果提高10%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 718604442
	,jns_8 = 2278038627
	}
skill取技能["神佑复生"]={
	jns_1 = "战斗死亡时有15%的几率复活，并恢复一半的气血，如果同时拥有鬼魂术（普通或高级），神佑复生的效果将取消"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1409514751
	,jns_8 = 2943632069
	}
skill取技能["超级神柚复生"]={
	jns_1 = "战斗死亡时有40%的几率复活，并恢复全部气血，同时获得40%生命值上限的护盾，如果同时拥有鬼魂术（普通或高级），神佑复生的效果将取消"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xD555E588
	,jns_8 = 0xD555E588
	}
skill取技能["偷袭"]={
	jns_1 = "身手灵敏，不会受到反击和反震。攻击效果增加5%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 3049408565
	,jns_8 = 205675459
	}
skill取技能["必杀"]={
	jns_1 = "物理攻击时的必杀几率增加10%，出现必杀时伤害结果会加倍"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 3789166294
	,jns_8 = 1107454372
	}
skill取技能["驱鬼"]={
	jns_1 = "对鬼魂类怪物的物理、法术伤害效果增加50%，如果将鬼魂类怪物打死，对方将飞出场外而不能复活"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 416049958
	,jns_8 = 2077703648
	}
skill取技能["高级火属性吸收"]={
	jns_1 = "30%的几率免受火属性法术伤害，并按应受伤害的大小恢复气血，吸收失败也可减少法术伤害的30%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2898051336
	,jns_8 = 1343324785
	}
skill取技能["高级永恒"]={
	jns_1 = "受到的辅助类法术效果持续回合数×4"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 4168001168
	,jns_8 = 3963828674
	}
skill取技能["反震"]={
	jns_1 = "受到物理攻击时有30%几率给予对方反震，反震伤害为所受伤害的25%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 3941065708
	,jns_8 = 3754360316
	}
skill取技能["高级招架"]={
	jns_1 = "每回合受到的第1次物理伤害结果减免20%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 450878763
	,jns_8 = 1018872745
	}
skill取技能["幸运"]={
	jns_1 = "不会受到必杀攻击"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 3640080474
	,jns_8 = 1085801234
	}
skill取技能["飞行"]={
	jns_1 = "躲避能力、物理攻击命中增加20%，但受暗器攻击时伤害会增加30%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 813574344
	,jns_8 = 1190813269
	}
skill取技能["吸血"]={
	jns_1 = "物理攻击时，吸取对方所掉气血的25%， 如果对方有异常状态，吸血后会中毒，攻击鬼魂类怪物时无效"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 668285297
	,jns_8 = 156592686
	}
skill取技能["嗜血追击"]={
	jns_1 = "使用物理攻击击倒目标时，会继续攻击另一个目标一次。此效果每回合只会触发一次"
	,jns_3 = 7
	,jns_6 = "wzife.wd1"
	,jns_7 = 3287596045
	,jns_8 = 3287596045
	}
skill取技能["反击"]={
	jns_1 = "受到物理攻击时有30%几率自动反击，反击伤害为正常伤害的50%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2574462722
	,jns_8 = 326702364
	}
skill取技能["高级连击"]={
	jns_1 = "55%的几率连续两次物理攻击，如果对方有反震技能，只能攻击一次"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1321871887
	,jns_8 = 3016140514
	}
skill取技能["隐身"]={
	jns_1 = "自动附加地府修罗隐身法术2～3回合，拥有此技能物理攻击能力会降低20%，隐身状态下无法使用法术"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1508147758
	,jns_8 = 3007875758
	}
skill取技能["法术连击"]={
	jns_1 = "使用法术攻击目标时会有一定几率出现连续2次攻击敌人"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2200246844
	,jns_8 = 345682085
	}
skill取技能["高级法术连击"]={
	jns_1 = "使用法术攻击目标时会有较大几率出现连续2次攻击敌人"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 3484714916
	,jns_8 = 1890987017
	}
skill取技能["高级神佑复生"]={
	jns_1 = "战斗死亡时有30%的几率复活为正常状态，如果同时拥有鬼魂术（普通或高级），神佑复生的效果将取消。"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2040400078
	,jns_8 = 3049938323
	}
skill取技能["高级隐身"]={
	jns_1 = "动附加地府修罗隐身法术3～5回合，拥有此技能物理攻击能力会降低15%，隐身状态下无法使用法术"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2491734238
	,jns_8 = 2948130962
	}
skill取技能["水属性吸收"]={
	jns_1 = "30%的几率免受水属性法术伤害，并按应受伤害的大小恢复气血，但受到火属性法术攻击时伤害会增加30%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 92545119
	,jns_8 = 1756512785
	}
skill取技能["打造技巧"]={
	jns_1 = "铸造名家欧冶子传下的技能，可以提高打造武器的能力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3866239213
	,jns_8 = 1635206107
	}
skill取技能["惊心一剑"]={
	jns_1 = "以物理攻击重创对手的气血及魔法"
	,jns_3 = 4
	,jns_4 = "等级/2+10点魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 472040976
	,jns_8 = 376561149
	}
skill取技能["力劈华山"]={
	jns_1 = "无视对方的防御使对方造成巨大的伤害"
	,jns_3 = 4
	,jns_4 = "等级+20点魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3633016146
	,jns_8 = 2223068576
	}
skill取技能["移花接木"]={
	jns_1 = "可以躲避暗器伤害，并按应受伤害的30%恢复HP"
	,jns_3 = 7
	,jns_6 = "wzife.wd1"
	,jns_7 = 0x5886F7D3
	,jns_8 = 0x5886F7D3
	}
skill取技能["壁垒击破"]={
	jns_1 = "忽视防御的攻击。攻击的目标防御，则会受到更大伤害。用此技能攻击时，会忽视“高级防御”和“防御”这两个召唤兽技能产生的技能效果。"
	,jns_3 = 4
	,jns_4 = "等级+10点魔法"
	,jns_6 = "wzife.wd1"
	,jns_7 = 0xF1D5925A
	,jns_8 = 0xF1D5925A
	}
skill取技能["神迹"]={
	jns_1 = "每回合结束时自动解除一切异常状态"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1245429649
	,jns_8 = 1198707975
	}
skill取技能["雷击"]={
	jns_1 = "雷属性的攻击法术，按召唤兽等级附加一定的法术伤害"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3336994935
	,jns_8 = 2495588313
	}
skill取技能["上古灵符"]={
	jns_1 = "随机施展冰冻(水属性法术，降低对手气血，一定几率令对手停止行动1回合)、流沙(土属性法术，降低对手气血，一定几率降低对手10%愤怒)、心火(火属性法术，降低对手气血，一定几率降低对手上限5%的魔法)、怒雷(雷属性法术，降低对手气血)"
	,jns_3 = 4
	,jns_4 = "100点魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xAA1341AF
	,jns_8 = 0xAA1341AF
	}
skill取技能["善恶有报"]={
	jns_1 = "攻击时有一定几率给予对手造成双倍的伤害，也有可能为对方恢复一定气血"--实际30%加血
	,jns_3 = 4
	,jns_4 = "100点魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 641427651
	,jns_8 = 1898344999
	}
skill取技能["特色善恶有报"]={
	jns_1 = "攻击时有较少几率给予对手造成三倍的伤害，也有可能为对方恢复更多气血"---实际40%加血
	,jns_3 = 4
	,jns_4 = "100点魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 641427651
	,jns_8 = 1898344999
	}

skill取技能["死亡召唤"]={
	jns_1 = "给予对手巨大的伤害，并且使对手处于死亡禁锢状态下，该状态存在时使鬼魂术无效并且不能使用药品进行复活。"
	,jns_3 = 4
	,jns_6 = "wzife.wdf"
	,jns_7 = 1218594609
	,jns_8 = 4279125360
	}
skill取技能["夜舞倾城"]={
	jns_1 = "对敌方造成（力量*3+速度）点固定伤害(攻击人物时效果减半)"
	,jns_3 = 4
	,jns_4 = "100点魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 387579012
	,jns_8 = 1832394806
	}
skill取技能["灵能激发"]={
	jns_1 = "使用后临时提升自身的法术伤害能力（法力点数越高效果越好，持续5回合）"
	,jns_3 = 2
	,jns_6 = "wzife.wd1"
	,jns_7 = 0x400FF62B
	,jns_8 = 0x0DB9B664
	}
skill取技能["盾气"]={
	jns_1 = "进入战斗后，临时提高其等级*1的防御能力（持续6回合）"
	,jns_3 = 7
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x04B409B4
	,jns_8 = 0x04B409B4
	}
skill取技能["高级盾气"]={
	jns_1 = "进入战斗后，则提高其等级*2的防御能力（持续6回合）"
	,jns_3 = 7
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8EC237B5
	,jns_8 = 0x8EC237B5
	}
skill取技能["合纵"]={
	jns_1 = "本方每有一种与其不同的召唤兽，则提高其等级#W//5.5的物理伤害结果。同时，被封印几率增加10%"
	,jns_3 = 7
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0xA94D8FEA
	,jns_8 = 0xA94D8FEA
	}
skill取技能["高级合纵"]={
	jns_1 = "本方每有一种与其不同的召唤兽，则提高其等级#W//4的物理伤害结果。同时，被封印几率增加10%"
	,jns_3 = 7
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x4EAD21FF
	,jns_8 = 0x4EAD21FF
	}
skill取技能["高级否定信仰"]={
	jns_1 = "不受异常、辅助效果影响，受法术伤害减少20%，受到鬼魂类怪物攻击时伤害增加50%，不能同时拥有某些信仰类技能"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 484689261
	,jns_8 = 2449787202
	}
skill取技能["高级精神集中"]={
	jns_1 = "精神集中，可以抵御封类异常状态，躲避力提高10%，但物理攻击能力会降低20%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 3121640283
	,jns_8 = 3049938323
	}
skill取技能["月光"]={
	jns_1 = "召唤数道月光攻击敌人，同一个人可以被多道月光攻击。"
	,jns_3 = 4
	,jns_4 = "100点魔法"
	,jns_6 = "org.rpk"
	,jns_7 = 16777794
	,jns_8 = 16777794
	-- 特技
	}
skill取技能["气疗术"]={
	jns_1 = "恢复（上限3%+200）的气血，对单人使用"
	,jns_3 = 3
	,jns_4 = "30点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xa71dee7
	,jns_8 = 0x35f72f87
	}
skill取技能["心疗术"]={
	jns_1 = "恢复（上限6%+400）的气血，对单人使用"
	,jns_3 = 3
	,jns_4 = "60点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1936940204
	,jns_8 = 4247881671
	}
skill取技能["命疗术"]={
	jns_1 = "恢复（上限9%+600）的气血，对单人使用"
	,jns_3 = 3
	,jns_4 = "90点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2327070966
	,jns_8 = 1214582243
	}
skill取技能["凝气诀"]={
	jns_1 = "恢复上限（15%+200）的魔法，对单人使用"
	,jns_3 = 3
	,jns_4 = "60点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2234398453
	,jns_8 = 4231419592
	}
skill取技能["凝神诀"]={
	jns_1 = "恢复上限（15%+400）的魔法，对单人使用"
	,jns_3 = 3
	,jns_4 = "90点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3010398248
	,jns_8 = 3594183195
	}
skill取技能["气归术"]={
	jns_1 = "自身恢复四分之一的气血"
	,jns_3 = 2
	,jns_4 = "30点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1743955726
	,jns_8 = 1501636093
	}
skill取技能["命归术"]={
	jns_1 = "自身恢复二分之一的气血"
	,jns_3 = 2
	,jns_4 = "120点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2585363944
	,jns_8 = 1305176222
	}
skill取技能["四海升平"]={
	jns_1 = "全体恢复四分之一的气血"
	,jns_3 = 2
	,jns_4 = "135点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2015850288
	,jns_8 = 2239024625
	}
skill取技能["回魂咒"]={
	jns_1 = "单体复活"
	,jns_3 = 3
	,jns_4 = "100点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3815030652
	,jns_8 = 2541979797
	}
skill取技能["起死回生"]={
	jns_1 = "单体复活并恢复二分之一的气血"
	,jns_3 = 3
	,jns_4 = "120点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2205777788
	,jns_8 = 3279499363
	}
skill取技能["水清诀"]={
	jns_1 = "单体解除异常状态"
	,jns_3 = 3
	,jns_4 = "50点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1988393110
	,jns_8 = 2231990553
	}
skill取技能["冰清诀"]={
	jns_1 = "单体解除异常状态并恢复四分之一的气血"
	,jns_3 = 3
	,jns_4 = "100点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4269368884
	,jns_8 = 994373130
	}
skill取技能["玉清诀"]={
	jns_1 = "全体解除异常状态"
	,jns_3 = 3
	,jns_4 = "125点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2317466220
	,jns_8 = 1064948127
	}
skill取技能["晶清诀"]={
	jns_1 = "全体解除异常状态并恢复四分之一的气血"
	,jns_3 = 3
	,jns_4 = "150点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4162645482
	,jns_8 = 2183757094
	}
skill取技能["诅咒之伤"]={
	jns_1 = "减少敌方单人当前20%的HP；"
	,jns_3 = 4
	,jns_6 = "wzife.wdf"
	,jns_4 = "40点愤怒"
	,jns_7 = 1725002697
	,jns_8 = 64967438
	}
skill取技能["诅咒之亡"]={
	jns_1 = "减少敌方单人当前20%的MP；"
	,jns_3 = 4
	,jns_6 = "wzife.wdf"
	,jns_4 = "40点愤怒"
	,jns_7 = 0x66d173c9
	,jns_8 = 0x3df530e
	}
skill取技能["笑里藏刀"]={
	jns_1 = "减少敌方单人70点愤怒值 "
	,jns_3 = 4
	,jns_4 = "40点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x17d8a907
	,jns_8 = 0x97a6b22c
	}
skill取技能["绝幻魔音"]={
	jns_1 = "一定几率令对手在5回合内使用法术和特技的消耗增加。 "
	,jns_3 = 4
	,jns_4 = "60点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x480a8a7d
	,jns_8 = 0x172ae1e0
	}
skill取技能["野兽之力"]={
	jns_1 = "提升队友的伤害力，效果持续到战斗结束"
	,jns_3 = 3
	,jns_4 = "40点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1101171654
	,jns_8 = 3074786323
	}
skill取技能["魔兽之印"]={
	jns_1 = "提升我方全体的伤害力，效果持续到战斗结束"
	,jns_3 = 2
	,jns_4 = "70点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x6c8d9d7e
	,jns_8 = 0xf77f8f63
	}
skill取技能["光辉之甲"]={
	jns_1 = "提升队友的防御，效果持续到战斗结束"
	,jns_3 = 3
	,jns_4 = "40点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2240060251
	,jns_8 = 2814063673
	}
skill取技能["圣灵之甲"]={
	jns_1 = "提升我方全体的防御，效果持续到战斗结束"
	,jns_3 = 2
	,jns_4 = "80点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 408713064
	,jns_8 = 2808598443
	}
skill取技能["流云诀"]={
	jns_1 = "提升队友的速度，效果持续到战斗结束"
	,jns_3 = 3
	,jns_4 = "40点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2534799922
	,jns_8 = 2823898790
	}
skill取技能["啸风诀"]={
	jns_1 = "全体队友速度上升，效果持续到战斗结束"
	,jns_3 = 2
	,jns_4 = "80点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1746071611
	,jns_8 = 2520189186
	}
skill取技能["太极护法"]={
	jns_1 = "受到的法术伤害减半，效果为3回合"
	,jns_3 = 3
	,jns_4 = "90点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3390558514
	,jns_8 = 2544284204
	}
skill取技能["罗汉金钟"]={
	jns_1 = "全体队友受到的法术伤害减半，效果为3回合"
	,jns_3 = 2
	,jns_4 = "150点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1643152884
	,jns_8 = 2239024625
	}
skill取技能["天衣无缝"]={
	jns_1 = "5回合内敌人对自己使用的法术有一定几率失效"
	,jns_3 = 2
	,jns_4 = "80点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2015850288
	,jns_8 = 2239024625
	}
skill取技能["放下屠刀"]={
	jns_1 = "降低敌人的物理攻击力，效果持续到战斗结束"
	,jns_3 = 4
	,jns_4 = "30点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3659778884
	,jns_8 = 441260658
	}
skill取技能["河东狮吼"]={
	jns_1 = "降低敌方全体的物理攻击力，效果持续到战斗结束"
	,jns_3 = 4
	,jns_4 = "100点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4154480125
	,jns_8 = 1389260370
	}
skill取技能["破甲术"]={
	jns_1 = "降低敌人的物理防御力，效果持续到战斗结束"
	,jns_3 = 4
	,jns_4 = "35点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1415639395
	,jns_8 = 752055472
	}
skill取技能["碎甲术"]={
	jns_1 = "降低敌方全体的物理防御力，效果持续到战斗结束"
	,jns_3 = 4
	,jns_4 = "80点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3022568423
	,jns_8 = 1626094829
	}
skill取技能["凝滞术"]={
	jns_1 = "降低敌人的速度10%，效果持续到战斗结束"
	,jns_3 = 4
	,jns_4 = "35点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2415123250
	,jns_8 = 642620104
	}
skill取技能["停陷术"]={
	jns_1 = "降低敌方全体的速度，效果持续到战斗结束"
	,jns_3 = 4
	,jns_4 = "80点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2036437377
	,jns_8 = 1583884046
	}
skill取技能["金刚不坏"]={
	jns_1 = "给己方指定目标增加等级×18的护盾值"
	,jns_3 = 3
	,jns_4 = "90点愤怒#W（#R愤怒腰带为72点#W）"
	,jns_6 = "jntb.wdf"
	,jns_7 = 671088640
	,jns_8 = 671088640
	}
skill取技能["修罗咒"]={
	jns_1 = "受到攻击时，将伤害的一半反作用给对方，效果持续6回合(每次反弹不超过人物等级×8)"
	,jns_3 = 2
	,jns_4 = "120点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2692943252
	,jns_8 = 2239024625
	}
skill取技能["琴音三叠"]={
	jns_1 = "对一个目标使用，造成3次法术伤害"
	,jns_3 = 4
	,jns_4 = "80点愤怒#W（#R愤怒腰带为64点#W）"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1157627904
	,jns_8 = 1157627904
	}
skill取技能["金刚怒目"]={
	jns_1 = "对一个目标使用，使目标获得80点愤怒。不可对自己用"
	,jns_3 = 3
	,jns_4 = "80点愤怒#W（#R愤怒腰带为64点#W）"
	,jns_6 = "jntb.wdf"
	,jns_7 = 687865856
	,jns_8 = 687865856
	}
skill取技能["移行换影"]={
	jns_1 = "和对方玩家交换状态，使用时有一定几率失败。休息1回合。条件：自身气血≥20%，对方气血≤80%"
	,jns_3 = 4
	,jns_4 = "150点愤怒#W（#R愤怒腰带为120点）"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1369457212
	,jns_8 = 107836297
	}
skill取技能["菩提心佑"]={
	jns_1 = "给己方所有目标增加等级×12的护盾值"
	,jns_3 = 3
	,jns_4 = "150点愤怒#W（#R愤怒腰带为120点）"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1090519040
	,jns_8 = 1090519040
	}
skill取技能["身似菩提"]={
	jns_1 = "将自己受到的法术反作用给施法者（针对某些特殊情况下无效），效果持续两回合"
	,jns_3 = 2
	,jns_4 = "130点愤怒"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1191182336
	,jns_8 = 1191182336
	}
skill取技能["死亡之音"]={
	jns_1 = "令敌全体队员各有一定几率处于某种异常状态"
	,jns_3 = 4
	,jns_4 = "110点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1631281574
	,jns_8 = 368264585
	}
skill取技能["心如明镜"]={
	jns_1 = "抵御一切异常类、辅助类附加效果，效果持续四回合"
	,jns_3 = 2
	,jns_4 = "100点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3276986935
	,jns_8 = 3412406301
	}
skill取技能["破血狂攻"]={
	jns_1 = "狂性大发，可以连续攻击两次"
	,jns_3 = 4
	,jns_4 = "80点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4254723553
	,jns_8 = 326320655
	}
skill取技能["弱点击破"]={
	jns_1 = "以临时提高伤害力攻击对手，适于对付防御高者"
	,jns_3 = 4
	,jns_4 = "50点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4136547665
	,jns_8 = 2136234800
	}
skill取技能["吸血特技"]={
	jns_1 = "吸取对方当前20%的HP，不能对怪物BOSS使用"
	,jns_3 = 4
	,jns_4 = "70点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1507579696
	,jns_8 = 2305470189
	}
skill取技能["破碎无双"]={
	jns_1 = "物理攻击敌人，并减少对方和HP损失相同的MP"
	,jns_3 = 4
	,jns_4 = "80点愤怒"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1073741824
	,jns_8 = 1073741824
	}
skill取技能["慈航普度"]={
	jns_1 = "复活所有队友并恢复全部气血，使用后自己的气血及气血上限将变为最大气血的10%，魔法变为0，不能复活鬼魂类的召唤兽"
	,jns_3 = 2
	,jns_6 = "wzife.wdf"
	,jns_4 = "150点愤怒"
	,jns_7 = 0x5F4E6740
	,jns_8 = 0x8521b2b4
	}
skill取技能["残月" and lx == "特技"]={
	jns_1 = "吸取对方当前30%的MP，不能对怪物BOSS使用"
	,jns_3 = 4
	,jns_4 = "100点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4136547665
	,jns_8 = 2136234800
	}
skill取技能["冥王暴杀"]={
	jns_1 = "人物等级×7+100-施法者敏捷点数/1.5，最小伤害为50"
	,jns_3 = 4
	,jns_4 = "60点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x59DBD730
	,jns_8 = 0x59DBD730
	}
skill取技能["敛恨"]={
	jns_1 = "受到物理暴击、法术暴击伤害后，本次所受与后面所受到的所有伤害减少20%。当回合有效。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x6F367EF0
	,jns_8 = 0x6F367EF0
	}
skill取技能["神炎"]={
	jns_1 = "增加五火神焰印6%的基础暴击几率。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xBF44D568
	,jns_8 = 0xBF44D568
	}
skill取技能["返火"]={
	jns_1 = "火甲术反馈的伤害效果增加100%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd3"
	,jns_7 = 0x013D6355
	,jns_8 = 0x013D6355
	}
skill取技能["烈焰真诀"]={
	jns_1 = "烈焰缠身，此时他们不再是普通的魔王寨弟子，他们具有更强大的法术暴击能力。使用后增加10%的魔法暴击率。持续4回合。"
	,jns_3 = 8
	,jns_4 = "50点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x1299A579
	,jns_8 = 0x1299A579
	,jns_12 = "5回合"
	-- 狮驼岭
	}
skill取技能["乱破"]={
	jns_1 = "使用连环击时，每次击打有45%几率附加狂兽决技能等级×100%的伤害。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x6D372C69
	,jns_8 = 0x6D372C69
	}
skill取技能["失心"]={
	jns_1 = "使用狮搏或鹰击有15%的几率让目标1回合无法行动。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x43CEF766
	,jns_8 = 0x43CEF766
	-- 凌波城
	}
skill取技能["抗击"]={
	jns_1 = "不动如山增加100%反击效果。"
	,jns_3 = 8
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x37FCB484
	,jns_8 = 0x37FCB484
	}
skill取技能["神诀"]={
	jns_1 = "使用天崩地裂与翻江倒海的技能时，刷新自身碎星诀或镇魂诀状态的回合数到初始值，并增加25%的效果，最多增加100%。"
	,jns_3 = 8
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x7D0D0DAB
	,jns_8 = 0x7D0D0DAB
	}
skill取技能["怒涛"]={
	jns_1 = "浪涌，惊涛怒，翻江搅海的每一次攻击有70%几率降低目标人物自身等级/2的防御，持续2回合。"
	,jns_3 = 8
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0xE971301E
	,jns_8 = 0xE971301E
	}
skill取技能["雷附"]={
	jns_1 = "提升腾雷的命中率10%，被腾雷附上致死状态的单位若在2回合内死亡，有50%的概率回复人物气血上限5%的血量。"
	,jns_3 = 8
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x7F38C97C
	,jns_8 = 0x7F38C97C
	-- 五庄观
	}
skill取技能["锤炼"]={
	jns_1 = "武器耐久损失速度降低40%，增加3%武器伤害。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x18172D37
	,jns_8 = 0x18172D37
	}
skill取技能["神附"]={
	jns_1 = "增加人物力量*8%的伤害力。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x43F66789
	,jns_8 = 0x43F66789
	}
skill取技能["强击"]={
	jns_1 = "攻击时忽视召唤兽10%的防御值；自身封印命中率降低5%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA88BC46C
	,jns_8 = 0xA88BC46C
	}
skill取技能["混元"]={
	jns_1 = "当你气血≥70%时，临时提升5%的伤害力。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x03636ACD
	,jns_8 = 0x03636ACD
	}
skill取技能["雨杀"]={
	jns_1 = "使用烟雨剑法需要的气血要求降低5%。烟雨剑法第二次攻击的必杀率提高20%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA88BC46C
	,jns_8 = 0xB6C48838
	}
skill取技能["致命"]={
	jns_1 = "被你攻击的目标在回合结束时，若目标的气血小于气血上限的10%则直接暴毙。（对NPC最多造成等级*10点伤害）"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8C44F88C
	,jns_8 = 0x8C44F88C
	}
skill取技能["天罚"]={
	jns_1 = nil
	,jns_3 = 4
	,jns_4 = nil
	,jns_6 = nil
	,jns_7 = nil
	,jns_8 = nil
	}
skill取技能["天罚"]={
	jns_1 = nil
	,jns_3 = 4
	,jns_4 = nil
	,jns_6 = nil
	,jns_7 = nil
	,jns_8 = nil
	}
skill取技能["天罚"]={
	jns_1 = nil
	,jns_3 = 4
	,jns_4 = nil
	,jns_6 = nil
	,jns_7 = nil
	,jns_8 = nil
	}
skill取技能["BOSS绝杀"]={
	jns_1 = nil
	,jns_3 = 4
	,jns_4 = nil
	,jns_6 = nil
	,jns_7 = nil
	,jns_8 = nil
	}
skill取技能["同生共死"]={
	jns_1 = nil
	,jns_3 = 10
	,jns_4 = nil
	,jns_6 = nil
	,jns_7 = nil
	,jns_8 = nil
	--剧情技能
	}
skill取技能["调息"]={
	jns_1 = "非战斗情况下使用，可以按技能等级恢复一定气血值。"
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x94308B6B
	,jns_8 = 0x5956387D
	}
skill取技能["打坐"]={
	jns_1 = "非战斗情况下使用，可以按技能等级恢复一定魔法值。"
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xB77AFA4C
	,jns_8 = 0xA0D18931
	}
skill取技能["妙手空空"]={
	jns_1 = "战斗中使用的法术，可从怪物身上偷来银两或宝物。#G/(每次使用都将消耗目标等级*4点魔法)"
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xD4815978
	,jns_8 = 0x8466E376
	}
skill取技能["宝石工艺"]={
	jns_1 = "提高合成宝石的成功率。"
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x408D50D7
	,jns_8 = 0x5899607A
	}
skill取技能["奇门遁甲"]={
	jns_1 = "在特定场景使用道具“导标旗”做标记，用以传送。1级时可以在长寿村做标记，2级时增加傲来国，3级增加长安城，4级增加朱紫国。"
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xFDB72ACA
	,jns_8 = 0xEFE3F812
	}
skill取技能["仙灵店铺"]={
	jns_1 = "平时使用，能够呼出购买界面直接购买商品。"
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x47877A93
	,jns_8 = 0xF3719878
	}
skill取技能["仙灵酒店"]={
	jns_1 = "平时使用，能够快速回收背包内的所有可回收道具"
	,jns_3 = 108
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x895DED5F
	,jns_8 = 0xF94E0B3B
	}
skill取技能["建筑之术"]={
	jns_1 = "提高建造房屋的能力，玩家拥有较高的技能后，可以建造更高级的房屋，并获得更多的室内空间。"
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x9F2DFDB6
	,jns_8 = 0x16418D92
	}
skill取技能["变化之术"]={
	jns_1 = "学习后可以使用特殊的变身卡片变换造型，变身后可以获得相应的附加效果，而且不会被他人PK。技能等级提高后可以使用更为高级的卡片，并延长一定的变身时间。"
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 =  0xD8118484
	,jns_8 = 0xE6CAA561
	}
skill取技能["火眼金睛"]={
	jns_1 = "学习后可以使用特殊的变身卡片变换造型，变身后可以获得相应的附加效果，而且不会被他人PK。技能等级提高后可以使用更为高级的卡片，并延长一定的变身时间。"
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xE9D07953
	,jns_8 = 0x43CBAF9C
	--孩子技能
	}
skill取技能["杀气决_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 =  1094328641
	,jns_8 = 154611339
	}
skill取技能["定身术_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 =  1255883361
	,jns_8 = 74020856
	}
skill取技能["极度疯狂_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 =  83457587
	,jns_8 = 3595846396
	}
skill取技能["活血_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 =  1605266111
	,jns_8 = 322011652
	}
skill取技能["生命之泉_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 = 2960653843
	,jns_8 = 245161213
	}
skill取技能["天雷斩_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 =  539518506
	,jns_8 = 1574496587
	}
skill取技能["蚩尤之负_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 = 791459990
	,jns_8 = 791459990
	}
skill取技能["飞沙走石_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 = 867595182
	,jns_8 = 3889225756
	}
skill取技能["龙腾_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 = 868553018
	,jns_8 = 3624604778
	}
skill取技能["幽冥鬼眼_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 =  2278091379
	,jns_8 = 1028611600
	}
skill取技能["金刚护体_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 = 1209389031
	,jns_8 = 3373270632
	}
skill取技能["姐妹同心_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 =  1403995919
	,jns_8 = 1953990529
	}
skill取技能["烟雨剑法_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 =  1634807266
	,jns_8 = 1466025569
	}
skill取技能["三味真火_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 =  4025764396
	,jns_8 = 1582861976
	}
skill取技能["修罗隐身_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 =  2002401788
	,jns_8 = 1845639026
	}
skill取技能["杨柳甘露_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 = 1942192760
	,jns_8 = 3948419042
	}
skill取技能["龙卷雨击_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 =  1985805172
	,jns_8 = 2475354629
	}
skill取技能["颠倒五行_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 = 3574274162
	,jns_8 = 2825519851
	}
skill取技能["推拿_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 = 3358815312
	,jns_8 = 2263105695
	}
skill取技能["威慑_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 =  2331186926
	,jns_8 = 2704780255
	}
skill取技能["还阳术_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 = 3176527248
	,jns_8 = 2540134659
	}
skill取技能["楚楚可怜_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 = 3641489048
	,jns_8 = 2733536938
	}
skill取技能["五行错位_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 = 2142901359
	,jns_8 = 3944942841
	}
skill取技能["知己知彼_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 =  2822489006
	,jns_8 = 3305618620
	}
skill取技能["后发制人_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 =  3103180357
	,jns_8 =  3134099760
	}
skill取技能["针灸_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 = 3806528554
	,jns_8 = 3934208876
	}
skill取技能["勾魂_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 = 3559866648
	,jns_8 = 2020340816
	}
skill取技能["赴汤蹈火_孩子"]={
	jns_1 = "大幅度提高HP，大幅度提高法术防御能力。（受悟性、等级影响）"
	,jns_3 = 108
	,jns_6 = "wzife.wd2"
	,jns_7 = 498794492
	,jns_8 = 498794492
	}
skill取技能["不知名手_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "wzife.wd2"
	,jns_7 = 771989455
	,jns_8 =771989455
	}
skill取技能["开门见山_孩子"]={
	jns_1 = "提高物理攻击结果、提高HP上限，并在进场后立即普通攻击一个未催眠之敌。"
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 = 1860385343
	,jns_8 = 1860385343
	}
skill取技能["四面埋伏_孩子"]={
	jns_1 = "[主动]使目标队友获得封印法术命中率提高的效果， 持续4回合。冷却3回合。"
	,jns_3 = 108
	,jns_6 = "wzife.wd2"
	,jns_7 =  1799071953
	,jns_8 = 3805139411
	}
skill取技能["仙人指路_孩子"]={
	jns_1 = "[主动]恢复目标队友的HP，并在回合结束时解除其封类异常状态"
	,jns_3 = 108
	,jns_6 = "wzife.wd2"
	,jns_7 = 1823684018
	,jns_8 = 2403051314
	}
skill取技能["千锤百炼_孩子"]={
	jns_1 = "大幅度提高HP，大幅度提高防御能力。（受悟性、等级影响）"
	,jns_3 = 108
	,jns_6 = "wzife.wd2"
	,jns_7 = 2601256007
	,jns_8 = 2601256007
	}
skill取技能["张弛有道_孩子"]={
	jns_1 = "每回合结束时，都获得1层秘法能量。"
	,jns_3 = 108
	,jns_6 = "wzife.wd2"
	,jns_7 = 3331072259
	,jns_8 = 3697992326
	}
skill取技能["峰回路转_孩子"]={
	jns_1 = "当携带此技能的孩子在第5回合及以后进场，则立即为全体队友恢复HP。"
	,jns_3 = 108
	,jns_6 = "wzife.wd2"
	,jns_7 = 193326389
	,jns_8 = 193326389
	}
skill取技能["地涌金莲_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 1259905637
	,jns_8 = 136055460
	}
skill取技能["不知名鬼脸_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 2093828616
	,jns_8 = 230555165
	}
skill取技能["蜜润_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 1906139022
	,jns_8 = 799817954
	}
skill取技能["塔_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 1535869502
	,jns_8 = 4292100900
	}
skill取技能["浪涌_孩子"]={
	jns_1 = ""
	,jns_3 = 108
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 3739580581
	,jns_8 = 3761009538
	--化圣技能
	}
skill取技能["其疾如风"]={
	jns_1 = "使用后下回合大幅提高所有友方玩家目标的速度。"
	,jns_3 = 2
	,jns_4 = "100点魔法"
	,jns_6 = "wzife.wd3"
	,jns_7 = 2718476462
	,jns_8 = 407794048
	,jns_12 = "4回合"
	}
skill取技能["其徐如林"]={
	jns_1 = "使用后下回合结束时，若友方有≥3个以上存活玩家目标处于被封印状态，则解除友方存活玩家目标所有异常状态。"
	,jns_3 = 2
	,jns_4 = "100点魔法"
	,jns_6 = "wzife.wd3"
	,jns_7 = 1241199591
	,jns_8 = 2424291766
	,jns_12 = "4回合"
	}
skill取技能["侵掠如火"]={
	jns_1 = "使用后下回合大幅提高所有友方玩家目标伤害"
	,jns_3 = 2
	,jns_4 = "100点魔法"
	,jns_6 = "wzife.wd3"
	,jns_7 = 1989203646
	,jns_8 = 1650371514
	,jns_12 = "4回合"
	}
skill取技能["岿然如山"]={
	jns_1 = "使用后下回合大幅降低所有友方玩家目标受到的伤害"
	,jns_3 = 2
	,jns_4 = "100点魔法"
	,jns_6 = "wzife.wd3"
	,jns_7 = 1055337578
	,jns_8 = 40250350
	,jns_12 = "4回合"




	-- 神兽宝宝类特殊技能
	}
skill取技能["法力陷阱"]={
	jns_1 = "召唤一个法力陷阱，持续到本回合结束。每个召唤进场的敌人都会触发陷阱，并损失大量MP和少量HP。但若从未触发，则自己损失大量HP。（同时自己物理、法术伤害能力减少5%，同队同时只能召唤1个陷阱"
	,jns_3 = 2
	,jns_4 = "等级+10"
	,jns_6 = "org.rpk"
	,jns_7 = 16778049
	,jns_8 = 16778049
	}
skill取技能["灵山禅语"]={
	jns_1 = "增加自身等级*成长的法防"
	,jns_3 = 7
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 3754689251
	,jns_8 = 2265863757
	}
skill取技能["无畏布施"]={
	jns_1 = "减少自身防御、法防并为目标增加防御、法防。"
	,jns_3 = 7
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 902068984
	,jns_8 = 3212547894
	}
skill取技能["大快朵颐"]={
	jns_1 = "出手前有一定几率触发，大大提升几率性技能(连击，必杀)的触发几率。"
	,jns_3 = 7
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0x4e3c17e0
	,jns_8 = 0x4e3c17e0
	}
skill取技能["龙魂"]={
	jns_1 = "每成功使用3次法术，都可以临时增加自身法术伤害（效果可持续2回合，成功使用法术后状态消失）"
	,jns_3 = 7
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x230CEC5B
	,jns_8 = 0x230CEC5B
	,jns_11 = "被动"
	}
skill取技能["浮云神马"]={
	jns_1 = "在场时，提高自身及主人10%速度，最多持续10回合。"
	,jns_3 = 7
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0xE52A8168
	,jns_8 = 0xE52A8168
	}
skill取技能["千钧一怒"]={
	jns_1 = "普通物理攻击造成的伤害≥目标气血上限*10%时，使自己主人获得10点愤怒。"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xFF01A989
	,jns_8 = 0x7ABA738A
	}
skill取技能["八凶法阵"]={
	jns_1 = "远古时代神秘群体法术，同时攻击对方三个目标，有一定的几率导致敌方单位降速、降攻、降防状态。"
	,jns_3 = 4
	,jns_6 = "wzife.wdf"
--	,jns_4 = "消耗气血90%"
	,jns_7 = 0x6DA1FE04
	,jns_8 = 0xF2093660
	}
skill取技能["法术防御"]={
	jns_1 = "极强的法术防御技能。可以防御法术攻击，减少65%的法术伤害，但无法防御物理攻击。效果可以持续7回合"
	,jns_3 = 2
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x3543B96C
	,jns_8 = 0x2513128B
	}
skill取技能["独行"]={
	jns_1 = "抵抗封印的能力提高25%"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777571
	,jns_8 = 16777571
	}
skill取技能["进击必杀"]={
	jns_1 = "第2回合及以后进入战斗时，提升15%的必杀几率持续5回合，且遂回合减少20%效果。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777572
	,jns_8 = 16777572
	}
skill取技能["进击法暴"]={
	jns_1 = "第2回合及以后进入战斗时，提升10%6的法术暴击几率持续5回合，且逐回合臧少20%效果。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777573
	,jns_8 = 16777573
	}
skill取技能["遗志"]={
	jns_1 = "替代原召唤兽进入战斗时获得“遗志：造成伤害提升10%；井获得原召唤的“遗志”。最多两层"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777574
	,jns_8 = 16777574
	}
skill取技能["高级独行"]={
	jns_1 = "抵抗封印的能力提高50%"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777575
	,jns_8 = 16777575
	}
skill取技能["高级进击必杀"]={
	jns_1 = "第2回合及以后进入战斗时，提升30%的必杀几率持续5回合，且遂回合减少20%效果。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777577
	,jns_8 = 16777577
	}
skill取技能["高级进击法暴"]={
	jns_1 = "第2回合及以后进入战斗时，提升20%的法术暴击几率持续5回合，且逐回合臧少20%效果。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777576
	,jns_8 = 16777576
	}
skill取技能["高级遗志"]={
	jns_1 = "替代原召唤兽进入战斗时获得“遗志：造成伤害提升20%；井获得原召唤的“遗志”。最多两层"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777584
	,jns_8 = 16777584
	}
skill取技能["观照万象"]={
	jns_1 = "使用所有的主动技能进攻目标，回合为10即可使用，使用后冷却150回合。"
	,jns_3 = 4
	,jns_6 = "org.rpk"
	,jns_7 = 16777591
	,jns_8 = 16777591
	}
skill取技能["出其不意"]={
	jns_1 = "使用本回合己方召唤兽末使用过的技能时，造成的伤害结果提升15%"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777590
	,jns_8 = 16777590
	}
skill取技能["势如破竹"]={
	jns_1 = "物理攻击时，保护的单位分担伤害减少30%"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777589
	,jns_8 = 16777589
	}
skill取技能["乘胜追击"]={
	jns_1 = "普通攻击或连击达到4次时，额外攻击敌人2次。(额外攻击的伤害结果降低60%)"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777588
	,jns_8 = 16777588
	}
skill取技能["凭风借力"]={
	jns_1 = "每次物理攻击提升必杀时12.5%的总伤害结果。(最多4层，在触发必杀时清空)"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777587
	,jns_8 = 16777587
	}
skill取技能["顾盼生姿"]={
	jns_1 = "每次使用主动技能，提升主人0.5等级的封印命中等级。(最多4层，在主人封印成功时清空)"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777586
	,jns_8 = 16777586
	}
skill取技能["拘魂索命"]={
	jns_1 = "使用法术或法术连击达到4次时，对气血百分比最低的数人额外释放1次法术(额外皮法术的伤害结果隆低20%)"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777585
	,jns_8 = 16777585
	}
skill取技能["溜之大吉"]={
	jns_1 = "自身速度提高20%，躲避率增加10%"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777592
	,jns_8 = 16777592
	}
skill取技能["神出鬼没"]={
	jns_1 = "进入战斗后获得修罗隐身状态3-5回合；隐身状态下伤害效果提高10%，躲避率增加10%"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777593
	,jns_8 = 16777593
	}
skill取技能["昼伏夜出"]={
	jns_1 = "夜间物理伤害效果不会减少并提高10%躲避率增加10%"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777600
	,jns_8 = 16777600
	}
skill取技能["流沙轻音"]={
	jns_1 = "发动法术攻击多个目标，伤害按五声音阶递攻击人数=自身等级/20，最少1人，最多5人。"
	,jns_3 = 4
	,jns_6 = "org.rpk"
	,jns_7 = 16777601
	,jns_8 = 16777601
	}
skill取技能["凝光炼彩"]={
	jns_1 = "受伤时有25%概率获得护盾，护盾值为所受伤害的50%。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777602
	,jns_8 = 16777602
	}
-- skill取技能["薪火相传"]={
-- 	jns_1 = "替换其他召唤兽出场时，被替换召唤兽的当前气血将转化为护盾。"
-- 	,jns_3 = 7
-- 	,jns_6 = "tfg.rpk"
-- 	,jns_7 = "薪火相传"
-- 	,jns_8 = "薪火相传"
-- 	}
skill取技能["虎虎生风"]={
	jns_1 = "大幅提升必杀伤害结果。----威风凛凛，虎虎生风！"
	,jns_3 = 7
	,jns_6 = "jntb.wdf"
	,jns_7 = "ABAB0007"
	,jns_8 = "ABAB0007"
	}
skill取技能["净台妙谛"]={
	jns_1 = "增加自身体质*成长*2的气血。“静听妙谛，腾云护身。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777605
	,jns_8 = 16777605
	}
skill取技能["津津有味"]={
	jns_1 = "每回合吞掉主人的一个包子，提升暴击几率和暴击伤害倍率。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777606
	,jns_8 = 16777606
	}
skill取技能["叱咤风云"]={
	jns_1 = "水系法术攻击目标和两个随机目标，提高法术连击的伤害法术连击可重复触发。"
	,jns_3 = 4
	,jns_6 = "org.rpk"
	,jns_7 = 16777607
	,jns_8 = 16777607
	}
skill取技能["食指大动"]={
	jns_1 = "召唤随机种类的水果攻击敌人。不同的水果味道不一，效果自然各具特色。"
	,jns_3 = 4
	,jns_6 = "org.rpk"
	,jns_7 = 16777608
	,jns_8 = 16777608
	}
skill取技能["理直气壮"]={
	jns_1 = "普通攻击时：有40%几率攻击3次，物理伤害降低20%"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000184
	,jns_8 = 0x1000184
	}
skill取技能["从天而降"]={
	jns_1 = "物理攻击造成的伤害结果提升50%，但攻击时有一定几率失败"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000183
	,jns_8 = 0x1000183
	}
skill取技能["狂莽一击"]={
	jns_1 = "物理攻击造成的伤害结果提升50%，但攻击时有一定几率失败"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000183
	,jns_8 = 0x1000183
	}
skill取技能["天降灵葫"]={
	jns_1 = "施法召唤葫芦攻击敌人，至于具体是是怎样的葫产呃，没人能事先和道"
	,jns_3 = 4
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x5bcbb249
	,jns_8 = 0x5bcbb249
	}
skill取技能["开天辟地"]={
	jns_1 = "增加统驭召唤兽忽视目标防御力的能力。"
	,jns_3 = 108
	,jns_6 = "org.rpk"
	,jns_7 = 16777620
	,jns_8 = 16777620
	}
skill取技能["破釜沉州"]={
	jns_1 = "增加统驭召唤兽致命几率和命中率。"
	,jns_3 = 108
	,jns_6 = "org.rpk"
	,jns_7 = 16777621
	,jns_8 = 16777621
	}
skill取技能["金刚护身"]={
	jns_1 = "统驭的召唤兽受到物理伤害时有几率减少所受伤害。"
	,jns_3 = 108
	,jns_6 = "org.rpk"
	,jns_7 = 16777622
	,jns_8 = 16777622
	}
skill取技能["偃旗息鼓"]={
	jns_1 = "增加统驭召唤兽的防御。"
	,jns_3 = 108
	,jns_6 = "org.rpk"
	,jns_7 = 16777623
	,jns_8 = 16777623
	}
skill取技能["飞火流星"]={
	jns_1 = "降低统驭召唤兽速度。"
	,jns_3 = 108
	,jns_6 = "org.rpk"
	,jns_7 = 16777619
	,jns_8 = 16777619
	}
skill取技能["乾坤借速"]={
	jns_1 = "增加统驭的召唤兽闪躲，同时在物理攻击对方目标时有一定几率提升自身速度，效果持续3-5回合，持续回合数随技能等级增加而增加。"
	,jns_3 = 108
	,jns_6 = "org.rpk"
	,jns_7 = 16777618
	,jns_8 = 16777618
	}
skill取技能["大浪淘沙"]={
	jns_1 = "降低（水攻、水漫金山、落岩、泰山压顶）水和土系法术对坐骑统驭的召唤兽伤害。"
	,jns_3 = 108
	,jns_6 = "org.rpk"
	,jns_7 = 16777617
	,jns_8 = 16777617
	}
skill取技能["炫火乱舞"]={
	jns_1 = "降低（烈火、地狱烈火、雷击、奔雷咒）火和雷系法术对坐骑统驭的召唤兽伤害。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777616
	,jns_8 = 16777616
	}
skill取技能["铜墙铁壁"]={
	jns_1 = "增加统驭召唤兽的中毒抵抗几率，随技能等级增加会额外降低统驭召唤兽中毒后的毒伤伤害值。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777609
	,jns_8 = 16777609
	}
skill取技能["忠贯日月"]={
	jns_1 = "降低统驭召唤兽在战斗中忠诚的消耗速度。当坐骑饱食度低于50时，效果降低"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777728
	,jns_8 = 16777728
	}
skill取技能["正身清心"]={
	jns_1 = "每天前N次食用长寿面、豆斋果绝对不会中毒。N为此技能等级数。当坐骑饱食度低于50时，效果无效"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777625
	,jns_8 = 16777625
	}
skill取技能["延年益寿"]={
	jns_1 = "增加统驭召唤兽食用长寿面、桂花丸和豆斋果时增加的寿命值，技能等级越高，增加的寿命值越多。当坐骑饱食度低于50时，效果降低"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777624
	,jns_8 = 16777624
	}
skill取技能["水来土掩"]={
	jns_1 = "增加统驭召唤兽的中毒抵抗几率，随技能等级增加会额外降低统驭召唤兽中毒后的毒伤伤害值。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777729
	,jns_8 = 16777729
	}
skill取技能["重生"]={
	jns_3 = 3
	}
skill取技能["武神之怒"]={
	jns_3 = 4
	}
skill取技能["刀光剑影"]={
	jns_3 = 4
	}
skill取技能["毁灭之光"]={
	jns_3 = 4
	}
skill取技能["血沸"]={
	jns_3 = 4
	}
skill取技能["怒击"]={
	jns_3 = 4
	}
skill取技能["寒冰监牢"]={
	jns_3 = 4
	}
skill取技能["归墟"]={
	jns_3 = 4
	}
skill取技能["猛击"]={
	jns_3 = 4
	}
skill取技能["怒火"]={
	jns_3 = 4
	}
skill取技能["秘传封印"]={
	jns_3 = 4
	}
skill取技能["阎罗拘魂"]={
	jns_3 = 4
	}
skill取技能["六道无情"]={
	jns_3 = 4
	}
skill取技能["尸腐无常"]={
	jns_3 = 4
	}
skill取技能["烈火焚原"]={
	jns_3 = 4
	}
skill取技能["冰封千里"]={
	jns_3 = 4
	}
skill取技能["无赦魔诀"]={
	jns_1 = "攻击的目标触发神佑复生、高级神佑复生时，降低其20%的最大气血值，持续到战斗结束。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000322
	,jns_8 = 0x1000322
	}
skill取技能["薪火相传"]={
	jns_1 = "替换其他召唤兽出场时，被替换召唤兽的当前气血将转化为护盾。（仅凤族召唤兽携带生效）"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000324
	,jns_8 = 0x1000324
	}
skill取技能["招财进宝"]={
	jns_1 = "物理攻击时，较小几率出现一个元宝，额外造成大量伤害。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000325
	,jns_8 = 0x1000325
	}
skill取技能["洞察"]={
	jns_1 = "物理攻击时，随机侦查一名对方单位气血。（仅对怪物战斗有效）"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000326
	,jns_8 = 0x1000326
	}
skill取技能["欣欣向荣"]={
	jns_1 = "提升40%最大生命值，五行为木时生效。（无法再触发神佑复生和鬼魂术）"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000327
	,jns_8 = 0x1000327
	}
skill取技能["茁壮"]={
	jns_1 = "提升25%最大生命值，五行为木时生效。（无法再触发神佑复生和鬼魂术）"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000311
	,jns_8 = 0x1000311
	}
skill取技能["万物之灵（火）"]={
	jns_1 = "自身法术伤害结果提升5%，受到的法术伤害降低5%，五行为火时生效。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000328
	,jns_8 = 0x1000328
	}
skill取技能["万物之灵（水） "]={
	jns_1 = "自身法术伤害结果提升5%，受到的法术伤害降低5%，五行为水时生效。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000329
	,jns_8 = 0x1000329
	}
skill取技能["万物之灵（金）"]={
	jns_1 = "自身法术伤害结果提升5%，受到的法术伤害降低5%，五行为水时生效。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000330
	,jns_8 = 0x1000330
	}
skill取技能["万物之灵（土）"]={
	jns_1 = "自身法术伤害结果提升5%，受到的法术伤害降低5%，五行为土时生效。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000331
	,jns_8 = 0x1000331
	}
skill取技能["万物之灵（木）"]={
	jns_1 = "自身法术伤害结果提升5%，受到的法术伤害降低5%，五行为木时生效。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000332
	,jns_8 = 0x1000332
	}
skill取技能["力大无穷（火）"]={
	jns_1 = "自身物理伤害结果提升5%，受到的物理伤害降低5%，五行为火时生效。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000333
	,jns_8 = 0x1000333
	}
skill取技能["力大无穷（水）"]={
	jns_1 = "自身物理伤害结果提升5%，受到的物理伤害降低5%，五行为水时生效。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000334
	,jns_8 = 0x1000334
	}
skill取技能["力大无穷（金）"]={
	jns_1 = "自身物理伤害结果提升5%，受到的物理伤害降低5%，五行为金时生效。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000335
	,jns_8 = 0x1000335
	}
skill取技能["力大无穷（土）"]={
	jns_1 = "自身物理伤害结果提升5%，受到的物理伤害降低5%，五行为土时生效。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000336
	,jns_8 = 0x1000336
	}
skill取技能["力大无穷（木）"]={
	jns_1 = "自身物理伤害结果提升5%，受到的物理伤害降低5%，五行为木时生效。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000340
	,jns_8 = 0x1000340
	}
skill取技能[" 飞行 "]={
	jns_1 = "飞行在非战斗状态下使用。使用后可骑乘飞行祥瑞翱翔空中。骑乘飞行祥瑞时有效，#G空中飞行移动速度与地面一致。"
	,jns_3 = 12
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 2737069862
	,jns_8 = 1014997076
}
--================================超级技能
skill取技能["超级奔雷咒"]={
	jns_1 = "发动超级雷属性法术攻击多个敌人；\n#G/对主选中目标造成伤害提高10%；\n#G/并有25%几率附加弱点雷两回合；\n#G/攻击人数=自身等级/30+1，最多3人；\n#W/————九天落雷，万马齐喑。"
	,jns_3 = 4
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级奔雷咒"
	,jns_8 = "超级奔雷咒"
	}
	skill取技能["超级地狱烈火"]={
	jns_1 = "发动超级火属性法术攻击多个敌人；\n#G/对主选中目标造成伤害提高10%；\n#G/并有25%几率附加弱点火两回合；\n#G/攻击人数=自身等级/30+1，最多3人；\n#W/————熊熊烈火，明明如光。"
	,jns_3 = 4
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级地狱烈火"
	,jns_8 = "超级地狱烈火"
	}
	skill取技能["超级泰山压顶"]={
	jns_1 = "发动超级土属性法术攻击多个敌人；\n#G/对主选中目标造成伤害提高10%；\n#G/并有25%几率附加弱点土两回合；\n#G/攻击人数=自身等级/30+1，最多3人；\n#W/————地崩山摧，厚土重压。"
	,jns_3 = 4
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级泰山压顶"
	,jns_8 = "超级泰山压顶"
	}
	skill取技能["超级水漫金山"]={
	jns_1 = "发动超级水属性法术攻击多个敌人；\n#G/对主选中目标造成伤害提高10%；\n#G/并有25%几率附加弱点水两回合；\n#G/攻击人数=自身等级/30+1，最多3人；\n#W/————雨落横流，席卷八方。"
	,jns_3 = 4
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级水漫金山"
	,jns_8 = "超级水漫金山"
	}
	skill取技能["超级夜战"]={
	jns_1 = "造成物理伤害提高10%；\n#G/夜间物理伤害效果不会减少，物理躲避能力增加20%，且在攻击时显示目标的气血条；\n#W/————夜黑风高夜，杀人放火天。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级夜战"
	,jns_8 = "超级夜战"
	}
	skill取技能["超级反击"]={
	jns_1 = "受到普通物理攻击后；\n#G/30%几率用物理攻击反击；\n#G/在场时主人首次被敌方物理攻击时；\n#G/必定用物理攻击进行反击；\n#W/————犯吾主者，绝不姑息。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级反击"
	,jns_8 = "超级反击"
	}
	skill取技能["超级反震"]={
	jns_1 = "受到物理攻击时30%反震对方；\n#G/反震伤害为你所受伤害的60%；\n#G/避免被敌人连击；\n#W/————站如松，坐如钟"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级反震"
	,jns_8 = "超级反震"
	}
	skill取技能["超级吸血"]={
	jns_1 = "物理攻击时获得对方损失气血的30%；\n#G/并将获得的溢出气血50%转化为护盾；\n#G/(攻击有鬼魂术的敌人无法吸血)\n#W/————以敌之血，尝吾之志。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级吸血"
	,jns_8 = "超级吸血"
	}
	skill取技能["超级连击"]={
	jns_1 = "普通攻击时55%几率攻击2次；\n#G/触发连击时有15%几率额外攻击1次；\n#G/物理伤害效果降低20%；\n#W/————黎魂澎湃，击如怒涛。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级连击"
	,jns_8 = "超级连击"
	}
	skill取技能["超级飞行"]={
	jns_1 = "物理攻击命中几率增加20%；\n#G/物理躲避能力提高30%；\n#G/物理躲避率提高10%；\n#G/天气为“风”时造成的物理伤害提升20%\n#W/————凭风而起，欲与天齐。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级飞行"
	,jns_8 = "超级飞行"
	}
	skill取技能["超级隐身"]={
	jns_1 = "进入战斗后获得修罗隐身状态3~5回合；\n#G/隐身时不会被攻击；\n#G/物理攻击能力降低10%；\n#G/受到的伤害也降低10%；\n#G/隐身时不能施法；\n#W/————不可说、不可视、不可触。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级隐身"
	,jns_8 = "超级隐身"
	}
	skill取技能["超级感知"]={
	jns_1 = "可攻击修罗隐身、楚楚可怜状态之敌；\n#G/物理躲避能力提高10%；\n#G/在场时主人也获得“感知”；\n#G/最多持续5回合；\n#W/————目光所至，无可遁形。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级感知"
	,jns_8 = "超级感知"
	}
	skill取技能["超级再生"]={
	jns_1 = "每回合恢复自身等级X1的气血；\n#G/有10%几率回复自身等级X12的气血；\n#W/————天地之息皆入我窍，皆化骨血。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级再生"
	,jns_8 = "超级再生"
	}
	skill取技能["超级冥思"]={
	jns_1 = "每回合恢复自身等级/2的魔法；\n#G/在场时主人时获得“冥思”；\n#G/最多持续5回合；\n#W/————心若明镜，映照你我。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级冥思"
	,jns_8 = "超级冥思"
	}
	skill取技能["超级慧根"]={
	jns_1 = "使用法术时所消耗的魔法降低为正常的50%；\n#G/且有15%的几率不消耗魔法；\n#W/————意心如鉴，是为天地所钟。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级慧根"
	,jns_8 = "超级慧根"
	}

	skill取技能["超级驱鬼"]={
	jns_1 = "对有鬼魂术之敌；\n#G/物理及法术伤害效果增加100%；\n#G/可将鬼魂术之敌击飞，使其不能复活；\n#G/双方场上带有鬼魂术单位的伤害降低20%；\n#G/自身的鬼魂术将无效化；\n#W/————上古魔息，小鬼勿近。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级驱鬼"
	,jns_8 = "超级驱鬼"
	}
	skill取技能["超级毒"]={
	jns_1 = "自身对毒免疫物理攻击后；\n#G/20%几率使敌人中毒；\n#G/且随机降低中毒目标的攻击、防御、法伤或法防；\n#W/————毒入七窍，无药可医。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级毒"
	,jns_8 = "超级毒"
	}
	skill取技能["超级必杀"]={
	jns_1 = "物理攻击的必杀几率增加20%；\n#G/必杀时有25%的几率造成3-4倍的伤害；\n#W/————山川踏碎魔息涌，一击搏尽日月光。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级必杀"
	,jns_8 = "超级必杀"
	}
	skill取技能["超级幸运"]={
	jns_1 = "受到的物理/法术伤害暴击倍率降低50%；\n#G/有5%的概率免疫受到的攻击；\n#W/————气运非凡，傲立乱世。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级幸运"
	,jns_8 = "超级幸运"
	}
	skill取技能["超级精神集中"]={
	jns_1 = "可以抵御封类异常状态，躲避力提高10%，但物理攻击能力会降低20%；\n#G/受到的伤害随机降低1% ~ 10%；\n#W/————身似菩提心如镜。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级精神集中"
	,jns_8 = "超级精神集中"
	}
	skill取技能["超级神迹"]={
	jns_1 = "不受除日月乾坤外的所有异常状态影响；回合结束时若主人倒地，尝试复活并解除其封印，恢复其自身等级x20的血后和伤势后自己离场；\n#W/————以身祭主，魔域不朽。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级神迹"
	,jns_8 = "超级神迹"
	}
	skill取技能["超级招架"]={
	jns_1 = "每回合受到的第1次物理伤害结果减免20%；\n#G/且进战斗时获得一层“金身”；\n#G/若被召唤成幻魔,“金身”会再次触发；\n#W/————钢筋铁骨，金身难撼。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级招架"
	,jns_8 = "超级招架"
	}
	skill取技能["超级永恒"]={
	jns_1 = "主动法术，回合结束时；\n#G/自身的气血、魔法将回复至使用此技能前的状态，冷却150回合；\n#G/受到辅助类法术时增加100%持续回合数；\n#G/且增加的回合数不会超过6回合；\n#W/————孤舟一叶身不灭，百世轮回心永恒。"
	,jns_3 = 2 --超级技能2.6 改
	,jns_4 = "无消耗"
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级永恒"
	,jns_8 = "超级永恒"
	}
	skill取技能["超级敏捷"]={
	jns_1 = "“速度增加20%”；\n#G/5%概率额外行动一次；\n#W/————其势如火，其疾如风。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级敏捷"
	,jns_8 = "超级敏捷"
	}
	skill取技能["超级否定信仰"]={
	jns_1 = "不受一切异常和增益影响；\n#G/其他超级技能#R不#G失效，且每个拥有的超级技能提高20%最大气血、提高15%所有伤害、降低5%防御和法防；\n#G/攻击时敌人的信仰类技能失效；\n#R/不能同时拥有信仰类技能\n#W/————天上地下，神魔无忌。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级否定信仰"
	,jns_8 = "超级否定信仰"
	}
	skill取技能["超级魔之心"]={
	jns_1 = "法术伤害效果提高25%；\n#W/————纳浩瀚魔息入心，施天下无双之法。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级魔之心"
	,jns_8 = "超级魔之心"
	}
	skill取技能["超级偷袭"]={
	jns_1 = "避免被敌人反击；\n#G/避免被敌人反震；\n#G/物理伤害效果提升15%；\n#G/物理普通攻击将无视防御指令；\n#W/————兵者，诡道也。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级偷袭"
	,jns_8 = "超级偷袭"
	}
	skill取技能["超级雷属性吸收"]={
	jns_1 = "必定免受雷属性法术伤害；\n#G/并按应受伤害的大小恢复气血；\n#W/————雷锻吾主六感。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级雷属性吸收"
	,jns_8 = "超级雷属性吸收"
	}
	skill取技能["超级土属性吸收"]={
	jns_1 = "必定免受土属性法术伤害；\n#G/并按应受伤害的大小恢复气血；\n#W/————土造吾主筋骨。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级土属性吸收"
	,jns_8 = "超级土属性吸收"
	}
	skill取技能["超级火属性吸收"]={
	jns_1 = "必定免受火属性法术伤害；\n#G/并按应受伤害的大小恢复气血；\n#W/————火炼吾主荒魂。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级火属性吸收"
	,jns_8 = "超级火属性吸收"
	}
	skill取技能["超级水属性吸收"]={
	jns_1 = "必定免受水属性法术伤害；\n#G/并按应受伤害的大小恢复气血；\n#W/————水塑吾主血肉。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级水属性吸收"
	,jns_8 = "超级水属性吸收"
	}
	skill取技能["超级强力"]={
	jns_1 = "物理攻击能力增加自己等级X0.7;\n#G/攻击有招架类技能的敌人时不会减少伤害结果;有10%几率使敌人旋转并头晕：2回合内造成的伤害降低；\n#R/对有超级防御者，伤害结果减少20%。\n#W/————力势磅礴，威慑九霄。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级强力"
	,jns_8 = "超级强力"
	}
	skill取技能["超级防御"]={
	jns_1 = "提高自身等级X 1的防御；\n#W/————不可胜者，守也。" --官方改了
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级防御"
	,jns_8 = "超级防御"
	}
	skill取技能["超级进击必杀"]={
	jns_1 = "第2回合及以后进入战斗时；\n#G/提升30%的必杀几率并增加50%必杀伤害倍率；\n#G/持续5回合，且逐回合减少20%效果；\n#W/————后发先至，锋芒毕露。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级进击必杀"
	,jns_8 = "超级进击必杀"
	}
	skill取技能["超级进击法暴"]={
	jns_1 = "第2回合及以后进入战斗时；\n#G/提升20%的法术暴击几率并增加50%法暴伤害倍率；\n#G/持续5回合，且逐回合减少20%效果；\n#W/————一鼓作气，再而衰，三而竭。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级进击法暴"
	,jns_8 = "超级进击法暴"
	}
	skill取技能["超级遗志"]={
	jns_1 = "替代原召唤兽进入战斗时获得“遗志”；\n#G/造成伤害提升15%；\n#G/并获得原召唤兽的“遗志”（最多两层）\n#W/————山不改其坚，水不改其流。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级遗志"
	,jns_8 = "超级遗志"
	}
	skill取技能["超级法术连击"]={
	jns_1 = "法术攻击时30%几率攻击2次；\n#G/（第二次伤害效果降低25%）\n#W/————浪奔浪涌，潮起潮落。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级法术连击"
	,jns_8 = "超级法术连击"
	}
	skill取技能["超级法术暴击"]={
	jns_1 = "法术攻击时20%几率出现暴击，且暴击时有10%的几率造成3~4倍的暴击伤害。\n#W/————三分天注定，七分靠打拼。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级法术暴击"
	,jns_8 = "超级法术暴击"
	}
	skill取技能["超级法术波动"]={
	jns_1 = "法术伤害效果巨幅波动；\n#G/避免被敌人法术反震；\n#W/————三界因界，命数无常。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级法术波动"
	,jns_8 = "超级法术波动"
	}
	skill取技能["超级壁垒击破"]={
	jns_1 = "发动物理攻击敌人，并略提高伤害；\n#G/若敌人防御，则伤害巨幅提高；\n#G/忽视等级*1.2的防御；\n#W/————魔息灌注，利刃出鞘。"
	,jns_3 = 4
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级壁垒击破"
	,jns_8 = "超级壁垒击破"
	}
	skill取技能["超级盾气"]={
	jns_1 = "第2回合及以后进入战斗时，增加等级X2的防御持续5回合，且逐回合减少20%效果。\n#G/在场时主人获得“盾气”最多持续5回合；\n#G/隐身时不触发本效果；\n#W/————有正气护体，可力挽狂势。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级盾气"
	,jns_8 = "超级盾气"
	}
	skill取技能["超级合纵"]={
	jns_1 = "当本方有1/2/3/4种与其不同的召唤兽；\n#G/则提高其2%/8%/18%/32%的物理伤害；\n#G/并增加等级X0.25/0.5/0.75/1的伤害结果；\n#R/被封印几率+10%；\n#W/————合纵连横，兵法大成。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级合纵"
	,jns_8 = "超级合纵"
	}
	skill取技能["超级法术抵抗"]={
	jns_1 = "减少10%所受到的法术伤害；\n#G/且进场时额外减少50%所受到的法术伤害，持续两回合；\n#W/————道法自然，心志自清。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = "超级法术抵抗"
	,jns_8 = "超级法术抵抗"
	}
	skill取技能["克敌五行"]={
	jns_1 = "对于五行克制的目标，造成的伤害大幅度增加。\n#R/仅五行山神可拥有此技能\n#W/————如果五行相克，我会让你知道什么是残忍。"
	,jns_3 = 7
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 0xE52A8168
	,jns_8 = 0xE52A8168
	}

skill取技能["超级赐福·元吉"]={
	jns_1 = ""
	,jns_3 = 8
	,jns_6 = "cjwf.dll"
	,jns_7 = 0xFB310001
	,jns_8 = 0xFB310001
	}
skill取技能["超级赐福·双喜"]={
	jns_1 = ""
	,jns_3 = 8
	,jns_6 = "cjwf.dll"
	,jns_7 = 0xFB310002
	,jns_8 = 0xFB310002
	}
skill取技能["超级赐福·三和"]={
	jns_1 = ""
	,jns_3 = 8
	,jns_6 = "cjwf.dll"
	,jns_7 = 0xFB310003
	,jns_8 = 0xFB310003
	}
skill取技能["超级赐福·四季"]={
	jns_1 = ""
	,jns_3 = 8
	,jns_6 = "cjwf.dll"
	,jns_7 = 0xFB310004
	,jns_8 = 0xFB310004
	}
skill取技能["超级赐福·五福"]={
	jns_1 = ""
	,jns_3 = 8
	,jns_6 = "cjwf.dll"
	,jns_7 = 0xFB310005
	,jns_8 = 0xFB310005
	}

skill取技能["超级赐福·六祥"]={
	jns_1 = ""
	,jns_3 = 8
	,jns_6 = "cjwf.dll"
	,jns_7 = 0xFB310005
	,jns_8 = 0xFB310005
	}
skill取技能["超级赐福·七瑞"]={
	jns_1 = ""
	,jns_3 = 8
	,jns_6 = "cjwf.dll"
	,jns_7 = 0xFB310005
	,jns_8 = 0xFB310005
	}
skill取技能["超级赐福·八荒"]={
	jns_1 = ""
	,jns_3 = 8
	,jns_6 = "cjwf.dll"
	,jns_7 = 0xFB310005
	,jns_8 = 0xFB310005
	}
skill取技能["超级赐福·九州"]={
	jns_1 = ""
	,jns_3 = 8
	,jns_6 = "cjwf.dll"
	,jns_7 = 0xFB310005
	,jns_8 = 0xFB310005
	}
skill取技能["超级赐福·十全"]={
	jns_1 = ""
	,jns_3 = 8
	,jns_6 = "cjwf.dll"
	,jns_7 = 0xFB310005
	,jns_8 = 0xFB310005
	}

--================================超级技能 下