-- @Author: 作者QQ381990860
-- @Date:   2021-11-29 01:22:28
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-11-10 20:32:11
local 图鉴查看 = class()
local zts1,zts,zts98,ckzts1,bbys,jnys
local ani = 引擎.取战斗模型
local qbb = 引擎.取宝宝

模型列表={
"自在天魔斧钺","自在天魔法杖","自在天魔弓弩","自在天魔","自在天魔经筒","自在天魔宝剑","自在天魔刀","自在天魔宝珠",
"泡泡","章鱼","狸","海星","巨蛙","天机虫","雪月蛙","火月蛙","大海龟","护卫","树怪","赌徒","强盗","海毛虫","大蝙蝠","山贼","野猪",
"骷髅怪","羊头怪","食铁兽","蛤蟆精","老虎","黑熊","花妖","狐狸精","牛妖","小龙女","野鬼","狼","虾兵","蟹将","龟丞相","兔子怪","蜘蛛精",
"黑熊精","食魂虫(日)","食魂虫(夜)","金乌火虫","金乌月光虫","僵尸","牛头","马面","雷鸟人","进阶雷鸟人","古代瑞兽","进阶古代瑞兽",
"白熊","进阶白熊","黑山老妖","进阶黑山老妖","蝴蝶仙子","进阶蝴蝶仙子","天兵","进阶天兵","天将","进阶天将","地狱战神","进阶地狱战神",
"风伯","进阶风伯","花铃","进阶花铃","凤凰","进阶凤凰","蛟龙","进阶蛟龙","雨师","进阶雨师","幽萤娃娃","进阶幽萤娃娃","如意仙子",
"进阶如意仙子","芙蓉仙子","进阶芙蓉仙子","巡游天神","进阶巡游天神","星灵仙子","进阶星灵仙子","幽灵","进阶幽灵","鬼将","进阶鬼将",
"吸血鬼","进阶吸血鬼","净瓶女娲","进阶净瓶女娲","律法女娲","进阶律法女娲","灵符女娲","进阶灵符女娲","狐不归","进阶狐不归","云游火",
"进阶云游火","泪妖","进阶泪妖","镜妖","进阶镜妖","月魅","进阶月魅","月影仙","进阶月影仙","琴仙","进阶琴仙","金铙僧","进阶金铙僧","大力金刚",
"进阶大力金刚","雾中仙","进阶雾中仙","灵鹤","进阶灵鹤","夜罗刹","进阶夜罗刹","炎魔神","进阶炎魔神","噬天虎","进阶噬天虎","野猪精",
"进阶野猪精","鼠先锋","龙鲤","进阶龙鲤","进阶鼠先锋","百足将军","进阶百足将军","踏云兽","进阶踏云兽","红萼仙子","进阶红萼仙子","龙龟",
"进阶龙龟","阴阳伞","进阶阴阳伞","机关兽","进阶机关兽","机关鸟","进阶机关鸟","机关人人形","进阶机关人人形","连弩车","进阶连弩车",
"巴蛇","进阶巴蛇","蚌精","进阶蚌精","鲛人","进阶鲛人","碧水夜叉","进阶碧水夜叉","锦毛貂精","进阶锦毛貂精","千年蛇魅","进阶千年蛇魅",
"犀牛将军人形","进阶犀牛将军人形","犀牛将军兽形","进阶犀牛将军兽形","机关人车形","葫芦宝贝","进阶葫芦宝贝","猫灵人形","进阶猫灵人形",
"猫灵兽形","进阶猫灵兽形","狂豹兽形","白豹","进阶白豹","涂山瞳","进阶涂山瞳","进阶涂山雪","涂山雪","蝎子精",
"进阶蝎子精","混沌兽","进阶混沌兽","画魂","进阶画魂","长眉灵猴","进阶长眉灵猴","巨力神猿","进阶巨力神猿","修罗傀儡鬼","进阶修罗傀儡鬼",
"藤蔓妖花","进阶藤蔓妖花","蜃气妖","进阶蜃气妖","修罗傀儡妖","进阶修罗傀儡妖","广目巡守","进阶广目巡守","雷龙","进阶雷龙","金身罗汉",
"进阶金身罗汉","曼珠沙华","进阶曼珠沙华","持国巡守","进阶持国巡守","真陀护法","进阶真陀护法","增长巡守","进阶增长巡守","虬龙","进阶虬龙",
"有苏鸩","进阶有苏鸩","毗舍童子","进阶毗舍童子","灵灯侍者","进阶灵灯侍者","般若天女","进阶般若天女","执音","进阶执音","谛听","进阶谛听",
"妙华天女","进阶妙华天女","司辰侍者(未来)","进阶司辰侍者(未来)","司辰侍者(过去)","炼丹童子","进阶炼丹童子","多闻巡守","进阶多闻巡守",
"司雪","进阶司雪","刑天","风祖飞廉","自在心猿","进阶自在心猿","魔化毗舍童子","进阶魔化毗舍童子","幻姬","进阶幻姬","长乐灵仙",
"进阶长乐灵仙","金翼","进阶金翼","觉醒涂山雪","进阶觉醒涂山雪","司雨","进阶司雨",
"新二大王","新猪八戒","新孙悟空","帮派妖兽","战斗坐骑1","战斗坐骑2","小猪","龙马","哮天犬","进阶哮天犬",
"小毛头","进阶小毛头","小丫丫","进阶小丫丫","小魔头","进阶小魔头","小精灵","进阶小精灵","小仙灵","进阶小仙灵","小仙女","进阶小仙女","善财童子","进阶善财童子",
"超级人参娃娃","超级大熊猫","超级金猴","超级大象","超级白泽","超级灵鹿","超级赤焰兽","超级大鹏","超级筋斗云","超级神牛","超级神虎","超级海豚","超级神兔","超级玉兔",
"超级土地公公","超级神鸡","超级神猴","超级孔雀","超级灵狐","超级神蛇","超级腾蛇","超级神马","超级青鸾","超级麒麟","超级神羊","超级六耳猕猴","超级神龙","超级飞天",
"超级泡泡","超级神狗","超级神猪","超级神鼠","超级猪小戒","超级小白龙","超级鲲鹏","超级神虎（壬寅）","超级红孩儿","超级飞廉","超级恶魔泡泡","超级神柚","泡泡灵仙·剑侠客",
"泡泡灵仙·骨精灵","泡泡灵仙·飞燕女","泡泡灵仙·羽灵神","泡泡灵仙·巫蛮儿","泡泡灵仙·杀破狼"

}

图鉴技能列表={
  "高级必杀","高级进击必杀","高级连击","高级吸血","高级偷袭","高级夜战","高级毒","高级反击","高级合纵","高级强力","高级隐身","高级感知","高级招架","高级驱鬼","高级反震","高级防御",
  "高级独行","嗜血追击","移花接木","高级幸运","高级否定信仰","高级精神集中","高级飞行","高级慧根","高级再生","高级冥思","高级神迹","高级永恒","高级遗志","高级法术暴击","高级法术连击",
  "高级魔之心","高级法术波动","高级敏捷","高级水属性吸收","高级雷属性吸收","高级土属性吸收","高级火属性吸收","高级神佑复生","高级鬼魂术",
  "水漫金山","奔雷咒","泰山压顶","地狱烈火","嗜血追击","剑荡四方",

  "超级必杀","超级进击必杀","超级连击","超级吸血","超级偷袭","超级夜战","超级毒","超级反击","超级合纵","超级强力","超级隐身","超级感知",
  "超级招架","超级反震","超级防御","超级盾气","超级法术抵抗","超级进击法暴","超级驱鬼",
  "超级幸运","超级否定信仰","超级精神集中","超级飞行","超级慧根","超级再生","超级冥思","超级神迹","超级永恒","超级遗志",
  "超级法术暴击","超级法术连击","超级魔之心","超级法术波动","超级敏捷","超级水属性吸收","超级雷属性吸收","超级土属性吸收","超级火属性吸收",
  "超级水漫金山","超级奔雷咒","超级泰山压顶","超级地狱烈火","超级壁垒击破",

  "上古灵符","月光","天降灵葫","八凶法阵","扶摇万里","叱咤风云","流沙轻音","食指大动","观照万象",
  "善恶有报","壁垒击破","惊心一剑","力劈华山","剑荡四方","死亡召唤","超级三昧真火","夜舞倾城","灵能激发","法术防御","无畏布施",
  "须弥真言","苍鸾怒击","灵山禅语","净台妙谛","理直气壮","从天而降","大快朵颐","千钧一怒","浮云神马","神出鬼没","溜之大吉",
  "龙魂","逍遥游","津津有味","昼伏夜出","凝光炼彩","风起龙游","出其不意","欣欣向荣","水击三千","北冥之渊",
  "凭风借力","气贯长虹","乘胜追击","义薄云天","与生俱来","柳暗花明","无上正真","桀骜自恃","圣婴大王","超级神柚复生","虎虎生风",
  -----加特色技能说明便于玩家理解区别
  -- "特色善恶有报",
}
图鉴技能换行={高级必杀=1,超级必杀=1,上古灵符=1,特色善恶有报=1}

function 图鉴查看:初始化(根)
  self.ID = 100863
  self.x = 160
  self.y = 80
	self.xx = 0
	self.yy = 0
	self.注释 = "图鉴查看"
	self.可视 = false
	self.鼠标 = false
	self.焦点 = false
	self.可移动 = true
	self.窗口时间 = 0
	self.页数=0
	self.模式=0
	self.选中=0
	self.开始=0
	self.右键关闭=1--不由主控右键关闭
	zts =tp.字体表.普通字体
	zts98= tp.字体表.普通字体
	ckzts1 = tp.字体表.描边字体

	self.窗口x,self.窗口y=670,610
	-- zts1 = wz.创建(程序目录.."Data/pic/hkyt_w5.ttf",17,false,false,true)
	for i=1,#模型列表 do
		if 模型列表[i]=="自在天魔斧钺" then self.神兽开始=i end
		if 模型列表[i]=="超级鲲鹏" then self.神兽结束=i end
	end
  local 资源 = tp.资源
	local 按钮 = tp._按钮
	local 自适应 = tp._自适应
    bbys=math.ceil(#模型列表/12)
	self.道具组={}
    for n=1,bbys do
		self.道具组[n] = tp._按钮(tp._自适应.创建(13,4,22,20,1,3),0,0,4,true,true)
		self.道具组[n]:绑定窗口_(100863)
	end

	jnys=2
	self.bb技能组={}
    for n=1,jnys do
		self.bb技能组[n] = tp._按钮(tp._自适应.创建(13,4,22,20,1,3),0,0,4,true,true)
		self.bb技能组[n]:绑定窗口_(100863)
	end

	self.类型 = 1
	页数1=1
	页数2=1
end

function 图鉴查看:打开()
	if self.可视 then
		self.可视=false
		self.资源组=nil
		self.技能=nil
	else
		self:加载资源()
		table.insert(tp.窗口_,self)
		tp.运行时间 = tp.运行时间 + 1
		self.窗口时间 = tp.运行时间
	    self.可视=true

		for i=1,#图鉴技能列表 do
			local 临时技能=tp._技能.创建()
			临时技能:置对象(图鉴技能列表[i])
			self.技能[i]:置技能(临时技能)
		end
	end
end

function 图鉴查看:加载资源()
   	local 资源 = tp.资源
	local 按钮 = tp._按钮
	local 自适应 = tp._自适应
	self.资源组 = {
   [1] = tp._自适应(0,1,self.窗口x,self.窗口y,3,9),----底框
   [2] = 按钮.创建(自适应.创建(18,4,16,16,4,3),0,0,4,true,true),--关闭按钮
   [3]=按钮.创建(自适应.创建(17,4,58,22,1,3),0,0,4,true,true," 模型 "),
   [4]=按钮.创建(自适应.创建(17,4,58,22,1,3),0,0,4,true,true,"BB技能"),
   [5]=按钮.创建(自适应.创建(17,4,58,22,1,3),0,0,4,true,true,"上一页"),
   [6]=按钮.创建(自适应.创建(12,4,58,22,1,3),0,0,4,true,true,"下一页"),

   -- [7]=按钮.创建(自适应.创建(12,4,43,22,1,3),0,0,4,true,true,"特书"),
   -- [8]=按钮.创建(自适应.创建(12,4,43,22,1,3),0,0,4,true,true,"打造"),
   -- [9]=按钮.创建(自适应.创建(12,4,43,22,1,3),0,0,4,true,true,"装备"),
   -- [10]=按钮.创建(自适应.创建(12,4,72,22,1,3),0,0,4,true,true,"一键出售"),
   -- [11]=按钮.创建(自适应.创建(12,4,72,22,1,3),0,0,4,true,true,"一键整理"),
   [12] = 自适应.创建(3,1,35,20,1,3),--无用

   [20] = 资源:载入('新加图标.wdf',"网易WDF动画",0x00000346),----无数据
   [21] = 资源:载入('新加图标.wdf',"网易WDF动画",0x00000345),--标题----无数据?
     }
	for i=2,6 do
		if self.资源组[i]~=nil then
			self.资源组[i]:绑定窗口_(100863)
		end
	end

	self.技能 = {}
	local 格子 = tp._技能格子
	for i=1,#图鉴技能列表 do
		self.技能[i]=格子(0,0,i,"技能图鉴")
	end

	for i=1,12 do
		self.资源组[100+i] = 自适应.创建(2,1,158,153,3,9)--宠物显示框
		-- self.资源组[300+i] = 按钮.创建(自适应.创建(12,4,28,22,1,3),0,0,4,true,true,"查")
		self.资源组[300+i] = 按钮.创建(自适应.创建(17,4,28,22,1,3),0,0,4,true,true,"查")
		self.资源组[300+i]:绑定窗口_(100863)
		-- self.资源组[400+i] = 按钮.创建(自适应.创建(12,4,28,22,1,3),0,0,4,true,true,"查")
		self.资源组[400+i] = 按钮.创建(自适应.创建(17,4,28,22,1,3),0,0,4,true,true,"查")
		self.资源组[400+i]:绑定窗口_(100863)
		-- self.资源组[500+i] = 按钮.创建(自适应.创建(12,4,28,22,1,3),0,0,4,true,true,"卡")
		-- self.资源组[500+i]:绑定窗口_(100863)
	end
end

function 图鉴查看:刷新()
end

function 图鉴查看:置形象(bh,bb模型,显示序号)
	if self.多形象明细==nil then self.多形象明细={} end
	self.多形象明细[显示序号]=nil
	self.资源组[bh] = nil
	local 形象数据,饰品数据,特效数据,多形象明细=通用召唤兽置形象(bb模型,true)
	if self.多形象明细==nil then self.多形象明细={} end
	self.多形象明细[显示序号]=多形象明细
	if 形象数据~=nil and 形象数据.站立~=nil then
		self.资源组[bh]=形象数据.站立
	end
	if 饰品数据~=nil and 饰品数据.站立~=nil then
		self.资源组[600+显示序号]=饰品数据.站立
	else
	    self.资源组[600+显示序号]=nil
	end
end

-- function 图鉴查看:取变身卡数据(模型)
-- 	local sj={}
-- 	if 变身卡数据[模型]~=nil then
-- 		sj=DeepCopy(变身卡数据[模型])
-- 		sj.名称="怪物卡片"
-- 		sj.造型=模型..""
-- 		sj.可叠加=false
-- 		sj.次数=sj.等级+0
-- 		sj.总类=30
-- 		sj.分类=1
-- 		sj.识别码="111"
-- 		return sj
-- 	end
-- end

function 图鉴查看:显示(dt,x,y)
	self.焦点=false
	self.资源组[1]:显示(self.x,self.y)
	-- self.资源组[21]:显示(self.x+230,self.y)
	-- self.资源组[12]:显示(self.x+230,self.y)
	-- self.资源组[12]:显示(self.x+230,self.y+80)
	tp.窗口标题背景_:显示(self.x-86+self.资源组[1].宽度/2,self.y)
	引擎.场景.字体表.标题字体:显示(self.x+self.资源组[1].宽度/2,self.y+3,"智能图鉴")


	-- zts98:置颜色(红色)
	-- zts98:显示(self.x+self.窗口x/2-45,self.y+3,"图 鉴 查 看")
	-- zts98:置颜色(白色)

	xx = 0
	yy = 0
	self.资源组[2]:更新(x,y)
	self.资源组[2]:显示(self.x+self.窗口x-23,self.y+3)
	if self.资源组[2]:事件判断() then --关闭按钮
		self:打开()
		return
	end

	for n =3,4 do
		self.资源组[n]:更新(x,y,self.类型+2~=n)
		self.资源组[n]:显示(self.x+10+80*(n-3),self.y+25)
	end

	self.资源组[5]:更新(x,y,(self.类型==1 and (页数1 or 1)>1) or (self.类型==2 and (页数2 or 1)>1) )
	self.资源组[6]:更新(x,y,(self.类型==1 and (页数1 or 1)<bbys) or (self.类型==2 and (页数2 or 1)<jnys) )

	for n =5,6 do
		self.资源组[n]:显示(self.x+490+80*(n-5),self.y+575)
	end

	if self.资源组[5]:事件判断() then
	    if self.类型 == 1 then
			self.开始=(math.max((页数1 or 1)-2,0))*12
			self.改变=true
			页数1=math.max((页数1 or 1)-1,1)
		elseif self.类型 == 2 then
		    页数2=math.max((页数2 or 1)-1,1)
		end
	elseif self.资源组[6]:事件判断() then
	    if self.类型 == 1 then
			self.开始=(math.min((页数1 or 1)+1-1,bbys))*12
			self.改变=true
			页数1=math.min((页数1 or 1)+1,bbys)
		elseif self.类型 == 2 then
		    页数2=math.min((页数2 or 1)+1,jnys)
		end
	end

	if self.资源组[3]:事件判断() then
	    self.类型 = 1
	elseif self.资源组[4]:事件判断() then
	    self.类型 = 2
	end

	if self.类型 == 1 then
	    for n=1,bbys do
			self.道具组[n]:更新(x,y)
			self.道具组[n]:显示(self.x+10+xx*25,self.y+531+yy*22,nil,nil,nil,(self.开始/12+1)==n,2)
			if n>=10 then
				ckzts1:显示(self.x+14+xx*25,self.y+532+yy*23,n)
			else
			    ckzts1:显示(self.x+17+xx*25,self.y+532+yy*23,n)
			end
			xx=xx+1
			if xx==25 then
				xx=0
				yy=yy+1
			end
			if self.道具组[n]:事件判断() then
				self.开始=(n-1)*12
				self.改变=true
				页数1=n
			end
		end
		if self.鼠标 then
			if 引擎.取鼠标滚轮() ==1 and 页数1 > 1 then--鼠标上滚动 then
			   self.开始=self.开始-12
			   页数1=self.开始/12+1
			   self.改变=true
			elseif 引擎.取鼠标滚轮() ==-1 and 页数1 < bbys then--鼠标上滚动 then
			   self.开始=self.开始+12
			   页数1=self.开始/12+1
			   self.改变=true
			end
		end
		if 页数1~=nil then
			zts98:置颜色(黄色)
			zts98:显示(self.x+640,self.y+575,页数1)
			zts98:置颜色(白色)
		end
		xx = 0
		yy = 0
		local jx,jy
		for i=1,12 do
			jx=self.x+8+xx*165
			jy=self.y+50+yy*160
			self.资源组[100+i]:显示(jx,jy)

			if self.资源组[200+i]==nil or self.改变 then
				self:置形象(200+i,模型列表[self.开始+i],i)
			end

			if self.资源组[200+i]~=nil and 模型列表[self.开始+i]~=nil then
			    tp.影子:显示(jx+83,jy+117)
			    if self.多形象明细[i].形象数据.站立~=nil then
			    	for z=1,#self.资源组[200+i] do
					    self.资源组[200+i][z]:更新(dt)
					    self.资源组[200+i][z]:显示(jx+83,jy+117)
			    	end
			    else
				    self.资源组[200+i]:更新(dt)
				    self.资源组[200+i]:显示(jx+83,jy+117)
			    end

			    if self.资源组[600+i]~=nil then
			    	if self.多形象明细[i].饰品数据.站立~=nil then
				    	for z=1,#self.资源组[600+i] do
						    self.资源组[600+i][z]:更新(dt)
						    self.资源组[600+i][z]:显示(jx+83,jy+117)
				    	end
				    else
					    self.资源组[600+i]:更新(dt)
					    self.资源组[600+i]:显示(jx+83,jy+117)
				    end
				end
			  zts98:置颜色(蓝色)
				zts98:显示(jx+5,jy+130,模型列表[self.开始+i])
				local 神兽=nil



				if self.开始+i>=self.神兽开始 and self.开始+i<=self.神兽结束 and string.find(模型列表[self.开始+i],"进阶")==nil then 神兽="神兽" end
				local 召唤兽数据 = 宝宝类.创建()
				local qss = qbb(模型列表[self.开始+i],神兽)
				local qss1=nil
				if 神兽~=nil then
					qss1 = qbb(模型列表[self.开始+i],神兽,"法系")
				end
				if qss[9]~=nil and string.find(模型列表[self.开始+i],"进阶")==nil then
					self.资源组[300+i]:更新(x,y)
					self.资源组[300+i]:显示(jx+131,jy+132)
					if self.资源组[300+i]:事件判断() then
						召唤兽数据:查看置新对象(模型列表[self.开始+i],模型列表[self.开始+i],"神兽",属性,0,nil,qss[9],{qss[2],qss[3],qss[4],qss[5],qss[6],qss[7]},qss[8][#qss[8]],qss[1] or 0,{100,20,20,20,20,20})
						tp.窗口.召唤兽查看栏:打开(召唤兽数据,true)
					end
				end

				if qss1~=nil and qss1[9]~=nil then
					self.资源组[400+i]:更新(x,y)
					self.资源组[400+i]:显示(jx+131,jy+110)
					if self.资源组[400+i]:事件判断() then
						召唤兽数据:查看置新对象(模型列表[self.开始+i],模型列表[self.开始+i],"神兽",属性,0,nil,qss1[9],{qss1[2],qss1[3],qss1[4],qss1[5],qss1[6],qss1[7]},qss1[8][#qss1[8]],qss1[1] or 0,{100,20,20,20,20,20})
						tp.窗口.召唤兽查看栏:打开(召唤兽数据,true)
					end
				end
	---------------------------------------------
				-- if 变身卡数据[模型列表[self.开始+i]]~=nil then
				-- 	self.资源组[500+i]:更新(x,y)
				-- 	self.资源组[500+i]:显示(jx+131,jy+1)
				-- 	if self.资源组[500+i]:事件判断() then
				-- 		self.变身卡查看:置物品(self:取变身卡数据(模型列表[self.开始+i]))
				-- 		self.变身卡查看开关=not self.变身卡查看开关
				-- 	end
				-- end
---------------------==================
				if self.变身卡查看开关 then
					tp.提示:道具行囊(x,y,self.变身卡查看.物品)
				end
			end
			xx=xx+1
			if xx==4 then
				xx=0
				yy=yy+1
			end
		end

	elseif self.类型 == 2 then
		self.变身卡查看开关=false
		for n=1,jnys do
			self.bb技能组[n]:更新(x,y)
			self.bb技能组[n]:显示(self.x+10+xx*25,self.y+553+yy*22,nil,nil,nil,页数2==n,2)
			if n>=10 then
				ckzts1:显示(self.x+14+xx*25,self.y+555+yy*23,n)
			else
			    ckzts1:显示(self.x+17+xx*25,self.y+555+yy*23,n)
			end
			xx=xx+1
			if xx==25 then
				xx=0
				yy=yy+1
			end
			if self.bb技能组[n]:事件判断() then
				页数2=n
			end
		end
		if self.鼠标 then
			if 引擎.取鼠标滚轮() ==1 and 页数2 > 1 then--鼠标上滚动 then
			   页数2=页数2-1
			elseif 引擎.取鼠标滚轮() ==-1 and 页数2 < jnys then--鼠标上滚动 then
			   页数2=页数2+1
			end
		end
		if 页数2~=nil then
			zts98:置颜色(黄色)
			zts98:显示(self.x+640,self.y+575,页数2)
			zts98:置颜色(白色)
		end
		xx = 0
		yy = 0
		for w=1,#图鉴技能列表 do

			if self.技能[w]~=nil then
				if yy>=(页数2-1)*11+(页数2-1) and yy<=页数2*11+(页数2-1) then
					self.技能[w]:置坐标(self.x+8+xx*41,self.y+50+(yy-((页数2-1)*11+(页数2-1)))*41)
					self.技能[w]:显示(x,y,self.鼠标)
					if self.技能[w].技能 ~= nil and self.技能[w].焦点 then
						tp.提示:技能(x,y,self.技能[w].技能)
						self.焦点 = true
					end
				end

				xx = xx + 1
				if w<#图鉴技能列表 and xx > 15 or 图鉴技能换行[图鉴技能列表[w+1]]~=nil then
					if xx > 15 and 图鉴技能换行[图鉴技能列表[w+1]]~=nil and yy%11~=0 then
						yy = yy + 1
					end
					xx = 0
					yy = yy + 1
				end
			end
		end
	end
	self.改变=false
    if self.鼠标 and  引擎.鼠标按下(右键) then
    	if self.变身卡查看开关 and self.类型==1 then
    		self.变身卡查看开关=false
    	else
    	   self:打开()
    	end
    end
end

function 图鉴查看:初始移动(x,y)
	tp.运行时间 = tp.运行时间 + 1
	if not tp.消息栏焦点 then
  		self.窗口时间 = tp.运行时间
 	end
	if not self.焦点 then
		tp.移动窗口 = true
	end
	if self.鼠标 and  not self.焦点 then
		self.xx = x - self.x
		self.yy = y - self.y
	end
end

function 图鉴查看:开始移动(x,y)
	if self.鼠标 then
		self.x = x - self.xx
		self.y = y - self.yy
	end
end
function 图鉴查看:检查点(x,y)
	if self.可视 and self.资源组[1]:是否选中(x,y)  then
		return true
	else
		return false
	end
end

变身卡数据={
	野猪={技能="",属性=0,类型="",正负=0,等级=1}
	,巨蛙={技能="",属性=0,类型="",正负=0,等级=1}
	,大海龟={技能="",属性=0,类型="",正负=0,等级=1}
	,树怪={技能="",属性=0,类型="",正负=0,等级=1}
	,赌徒={技能="",属性=0,类型="",正负=0,等级=1}
	,大蝙蝠={技能="",属性=0,类型="",正负=0,等级=1}
	,强盗={技能="",属性=0,类型="",正负=0,等级=1}
	,山贼={技能="",属性=0,类型="",正负=0,等级=1}
	,海毛虫={技能="",属性=0,类型="",正负=0,等级=1}
	,护卫={技能="",属性=0,类型="",正负=0,等级=1}
	,海星={技能="",属性=0,类型="",正负=0,等级=1}
	,章鱼={技能="",属性=0,类型="",正负=0,等级=1}
	--二级
	,骷髅怪={技能="夜战",属性=20,类型="气血",正负=2,等级=2}
	,羊头怪={技能="幸运",属性=10,类型="气血",正负=2,等级=2}
	,黑熊={技能="防御",属性=5,类型="灵力",正负=2,等级=2}
	,蛤蟆精={技能="毒",属性=15,类型="防御",正负=2,等级=2}
	,狐狸精={技能="感知",属性=5,类型="气血",正负=2,等级=2}
	,花妖={技能="慧根",属性=0,类型="",正负=0,等级=2}
	,老虎={技能="强力",属性=10,类型="速度",正负=2,等级=2}
	--三级
	,牛妖={技能="反击",属性=5,类型="防御",正负=2,等级=3}
	,小龙女={技能="驱鬼",属性=5,类型="伤害",正负=2,等级=3}
	,野鬼={技能="夜战",属性=5,类型="灵力",正负=2,等级=3}
	,狼={技能="偷袭",属性=10,类型="气血",正负=2,等级=3}
	,虾兵={技能="必杀",属性=10,类型="伤害",正负=2,等级=3}
	,蟹将={技能="连击",属性=12,类型="速度",正负=2,等级=3}
	--新加
	,泡泡={技能="幸运",属性=5,类型="防御",正负=2,等级=3}
	,狸={技能="必杀",属性=10,类型="伤害",正负=2,等级=3}
	,章鱼={技能="毒",属性=5,类型="伤害",正负=2,等级=3}
	,金钱龟={技能="慧根",属性=10,类型="气血",正负=2,等级=3}

	--四级
	,兔子怪={技能="敏捷",属性=10,类型="气血",正负=2,等级=4}
	,蜘蛛精={技能="毒",属性=10,类型="防御",正负=2,等级=4}
	,僵尸={技能="弱点雷",属性=10,类型="气血",正负=1,等级=4}
	,黑熊精={技能="反震",属性=10,类型="防御",正负=2,等级=4}
	,龟丞相={技能="",属性=10,类型="气血",正负=1,等级=4}
	,牛头={技能="招架",属性=0,类型="",正负=0,等级=4}
	,马面={技能="必杀",属性=8,类型="伤害",正负=2,等级=4}
	--新加
	,吉祥={技能="连击",属性=0,类型="",正负=0,等级=4}
	,团团={技能="反击",属性=0,类型="",正负=0,等级=4}
	,小彩蝶={技能="健壮",属性=0,类型="",正负=0,等级=4}
	,小欣={技能="勇敢",属性=5,类型="魔法",正负=1,等级=4}
	,小肥羊={技能="报复",属性=0,类型="",正负=0,等级=4}
	,小雪人={技能="敏捷",属性=10,类型="法防",正负=2,等级=4}
	,嵩鼠={技能="神武盾气",属性=5,类型="气血",正负=2,等级=4}
	,恶魔泡泡={技能="吸血",属性=20,类型="伤害",正负=2,等级=4}
	,独角鬼王={技能="驱鬼",属性=0,类型="",正负=0,等级=4}
	,猫女={技能="进击必杀",属性=5,类型="气血",正负=2,等级=4}
	,萌狗={技能="感知",属性=5,类型="魔法",正负=1,等级=4}
	,蝶妖={技能="再生",属性=5,类型="气血",正负=1,等级=4}

	--五级
	,古代瑞兽={技能="反震",属性=10,类型="气血",正负=2,等级=5}
	,雷鸟人={技能="飞行",属性=10,类型="气血",正负=2,等级=5}
	,蝴蝶仙子={技能="魔之心",属性=10,类型="防御",正负=2,等级=5}
	,白熊={技能="迟钝",属性=0,类型="",正负=0,等级=5}
	,黑山老妖={技能="偷袭",属性=10,类型="速度",正负=2,等级=5}
	,进阶古代瑞兽={技能="反震",属性=9,类型="气血",正负=2,等级=5}
	,进阶雷鸟人={技能="飞行",属性=9,类型="气血",正负=2,等级=5}
	,进阶蝴蝶仙子={技能="魔之心",属性=9,类型="防御",正负=2,等级=5}
	,进阶白熊={技能="迟钝",属性=20,类型="气血",正负=1,单独=1,等级=5}
	,进阶黑山老妖={技能="偷袭",属性=9,类型="速度",正负=2,等级=5}
	--新加
	,太极捶童子={技能="保命",属性=0,类型="",正负=0,等级=5}
	,女捕头={技能="法术穿透",属性=5,类型="气血",正负=2,等级=5}
	,女飞贼={技能="物理穿透",属性=5,类型="气血",正负=2,等级=5}
	,婚纱女={技能="魔之心",属性=5,类型="气血",正负=2,等级=5}
	,小丫丫={技能="健壮",属性=0,类型="",正负=0,等级=5}
	,小仙女={技能="健壮",属性=0,类型="",正负=0,等级=5}
	,小神灵={技能="健壮",属性=0,类型="",正负=0,等级=5}
	,小兔兔={技能="健壮",属性=0,类型="",正负=0,等级=5}
	,小卷发={技能="健壮",属性=0,类型="",正负=0,等级=5}
	,小圣斗士={技能="健壮",属性=0,类型="",正负=0,等级=5}
	,小毛头={技能="健壮",属性=0,类型="",正负=0,等级=5}
	,小浪鼓={技能="健壮",属性=0,类型="",正负=0,等级=5}
	,小熊熊={技能="健壮",属性=0,类型="",正负=0,等级=5}
	,小神灵={技能="健壮",属性=0,类型="",正负=0,等级=5}
	,小精灵={技能="健壮",属性=0,类型="",正负=0,等级=5}
	,小绅士={技能="健壮",属性=0,类型="",正负=0,等级=5}
	,小羊角={技能="健壮",属性=0,类型="",正负=0,等级=5}
	,小蓝={技能="慧根",属性=5,类型="速度",正负=1,等级=5}
	,小蓝娥={技能="健壮",属性=0,类型="",正负=0,等级=5}
	,狗头人={技能="迟钝",属性=5,类型="伤害",正负=1,等级=5}
	,蝠女={技能="夜战",属性=15,类型="速度",正负=1,单独=1,等级=5}
	,貂裘红衣={技能="进击法爆",属性=0,类型="",正负=0,等级=5}
	,小魔头={技能="健壮",属性=0,类型="",正负=0,等级=5}
	,善财童子鼓={技能="健壮",属性=0,类型="",正负=0,等级=5}
	,小DJ={技能="健壮",属性=0,类型="",正负=0,等级=5}

	--六级
	,天兵={技能="防御",属性=0,类型="",正负=0,等级=6}
	,天将={技能="强力",属性=8,类型="灵力",正负=2,等级=6}
	,地狱战神={技能="连击",属性=5,类型="气血",正负=2,等级=6}
	,风伯={技能="敏捷",属性=5,类型="防御",正负=2,等级=6}
	,凤凰={技能="飞行",属性=0,类型="",正负=0,等级=6}
	,碧水夜叉={技能="反震",属性=0,类型="",正负=0,等级=6}
	,雨师={技能="",属性=20,类型="灵力",正负=1,单独=1,等级=6}
	,蚌精={技能="",属性=30,类型="防御",正负=1,单独=1,等级=6}
	,鲛人={技能="",属性=20,类型="伤害",正负=1,单独=1,等级=6}
	,蛟龙={技能="永恒",属性=0,类型="",正负=0,等级=6}
	,进阶天兵={技能="防御",属性=10,类型="防御",正负=1,单独=1,等级=6}
	,进阶天将={技能="强力",属性=7,类型="灵力",正负=2,等级=6}
	,进阶地狱战神={技能="连击",属性=4,类型="气血",正负=2,等级=6}
	,进阶风伯={技能="敏捷",属性=4,类型="防御",正负=2,等级=6}
	,进阶凤凰={技能="飞行",属性=10,类型="速度",正负=1,单独=1,等级=6}
	,进阶碧水夜叉={技能="反震",属性=20,类型="气血",正负=1,单独=1,等级=6}
	,进阶雨师={技能="",属性=30,类型="灵力",正负=1,单独=1,等级=6}
	,进阶蚌精={技能="",属性=40,类型="防御",正负=1,单独=1,等级=6}
	,进阶鲛人={技能="",属性=30,类型="伤害",正负=1,单独=1,等级=6}
	,进阶蛟龙={技能="永恒",属性=10,类型="速度",正负=1,单独=1,等级=6}
	--新加
	-- ,关羽变脸={技能="反击",属性=20,类型="防御",正负=1,单独=1,等级=6}
	-- ,["巨石守卫(昼)"]={技能="夜战",属性=20,类型="伤害",正负=1,单独=1,等级=6}
	-- ,白脸京剧={技能="必杀",属性=15,类型="速度",正负=1,单独=1,等级=6}
	-- ,进阶小丫丫={技能="高级健壮",属性=0,类型="",正负=0,等级=6}
	-- ,进阶小仙女={技能="高级健壮",属性=0,类型="",正负=0,等级=6}
	-- ,进阶小神灵={技能="高级健壮",属性=0,类型="",正负=0,等级=6}
	-- ,进阶小毛头={技能="高级健壮",属性=0,类型="",正负=0,等级=6}
	-- ,进阶小精灵={技能="高级健壮",属性=0,类型="",正负=0,等级=6}
	-- ,进阶小魔头={技能="高级健壮",属性=0,类型="",正负=0,等级=6}
	-- ,魂女猫={技能="震摄",属性=0,类型="",正负=0,等级=6}
	-- ,黑翼弓使={技能="气势",属性=0,类型="",正负=0,等级=6}
	-- ,牛虱={技能="反震",属性=30,类型="防御",正负=1,单独=1,等级=6}

	--七级
	,巡游天神={技能="必杀",属性=20,类型="速度",正负=2,等级=7}
	,芙蓉仙子={技能="再生",属性=30,类型="防御",正负=2,单独=1,等级=7}
	,星灵仙子={技能="慧根",属性=10,类型="灵力",正负=1,单独=1,等级=7}
	,如意仙子={技能="敏捷",属性=10,类型="灵力",正负=1,单独=1,等级=7}
	,锦毛貂精={技能="敏捷",属性=5,类型="气血",正负=2,等级=7}
	,千年蛇魅={技能="偷袭",属性=7,类型="速度",正负=2,等级=7}
	,百足将军={技能="夜战",属性=0,类型="",正负=0,等级=7}
	,犀牛将军人形={技能="剑荡四方",属性=7,类型="防御",正负=2,等级=7}
	,犀牛将军兽形={技能="",属性=5,类型="气血",正负=1,等级=7}
	,野猪精={技能="反击",属性=5,类型="气血",正负=1,等级=7}
	,鼠先锋={技能="敏捷",属性=0,类型="",正负=0,等级=7}
	,泪妖={技能="毒",属性=5,类型="防御",正负=2,等级=7}
	,镜妖={技能="强力",属性=5,类型="速度",正负=2,等级=7}
	,阴阳伞={技能="剑荡四方",属性=10,类型="速度",正负=2,等级=7}
	,进阶巡游天神={技能="必杀",属性=19,类型="速度",正负=2,等级=7}
	,进阶芙蓉仙子={技能="再生",属性=20,类型="防御",正负=2,单独=1,等级=7}
	,进阶星灵仙子={技能="慧根",属性=20,类型="灵力",正负=1,单独=1,等级=7}
	,进阶如意仙子={技能="敏捷",属性=20,类型="灵力",正负=1,单独=1,等级=7}
	,进阶锦毛貂精={技能="敏捷",属性=4,类型="气血",正负=2,等级=7}
	,进阶千年蛇魅={技能="偷袭",属性=6,类型="速度",正负=2,等级=7}
	,进阶百足将军={技能="夜战",属性=20,类型="伤害",正负=1,单独=1,等级=7}
	,进阶犀牛将军人形={技能="剑荡四方",属性=10,类型="伤害",正负=1,单独=1,等级=7}
	,进阶犀牛将军兽形={技能="",属性=6,类型="气血",正负=1,等级=7}
	,进阶野猪精={技能="反击",属性=6,类型="气血",正负=1,等级=7}
	,进阶鼠先锋={技能="敏捷",属性=10,类型="速度",正负=1,单独=1,等级=7}
	,进阶泪妖={技能="毒",属性=4,类型="防御",正负=2,等级=7}
	,进阶镜妖={技能="强力",属性=4,类型="速度",正负=2,等级=7}
	,进阶阴阳伞={技能="剑荡四方",属性=9,类型="速度",正负=2,等级=7}
	--新加
	-- ,三叉变脸={技能="审判",属性=0,类型="",正负=0,等级=7}
	-- ,三尾火狐={技能="逆击",属性=0,类型="",正负=0,等级=7}
	-- ,卧龙={技能="法术暴击",属性=5,类型="速度",正负=1,等级=7}
	-- ,喷火变脸={技能="防御",属性=5,类型="伤害",正负=1,等级=7}
	-- ,大筒木辉夜={技能="法术波动",属性=10,类型="法伤",正负=1,等级=7}
	-- ,女狐妖={技能="法术抵抗",属性=5,类型="法伤",正负=1,等级=7}
	-- ,巨斧猛男={技能="物理穿透",属性=5,类型="伤害",正负=1,等级=7}
	-- ,带土={技能="偷袭",属性=5,类型="伤害",正负=1,等级=7}
	-- ,彩蝶依依={技能="法术穿透",属性=5,类型="法伤",正负=1,等级=7}
	-- ,手铃变脸={技能="幸运",属性=10,类型="气血",正负=1,等级=7}
	-- ,日游神={技能="冥思",属性=5,类型="魔法",正负=1,等级=7}
	-- ,春岚蔷薇={技能="感知",属性=5,类型="防御",正负=1,等级=7}
	-- ,晶怪={技能="驱鬼",属性=5,类型="伤害",正负=1,等级=7}
	-- ,暗雷豹={技能="敏捷",属性=10,类型="气血",正负=1,等级=7}
	-- ,琴鹤={技能="招架",属性=10,类型="气血",正负=1,等级=7}
	-- ,红娘子={技能="永恒",属性=10,类型="魔法",正负=1,等级=7}
	-- ,红衣战锤使={技能="毒",属性=5,类型="伤害",正负=1,等级=7}
	-- ,花铃={技能="驱鬼",属性=5,类型="法伤",正负=1,等级=7}
	-- ,萼华仙子={技能="再生",属性=10,类型="魔法",正负=1,等级=7}
	-- ,虎王={技能="必杀",属性=5,类型="防御",正负=1,等级=7}
	-- ,蚩尤武魂={技能="必杀",属性=5,类型="法防",正负=1,等级=7}
	-- ,金锤变脸={技能="必杀",属性=20,类型="速度",正负=1,单独=1,等级=7}
	-- ,镜子变脸={技能="必杀",属性=5,类型="气血",正负=1,等级=7}
	-- ,青衣={技能="助攻",属性=20,类型="速度",正负=1,单独=1,等级=7}
	-- ,骏天马={技能="法术助攻",属性=20,类型="速度",正负=1,单独=1,等级=7}
	-- ,鲛人鱼={技能="魔之心",属性=20,类型="速度",正负=1,单独=1,等级=7}
	-- ,鸟妖仙={技能="法术连击",属性=20,类型="速度",正负=1,单独=1,等级=7}
	-- ,黑灵猫={技能="法术连击",属性=20,类型="速度",正负=1,单独=1,等级=7}
	-- ,黑脸京剧={技能="蛮劲",属性=20,类型="速度",正负=1,单独=1,等级=7}
	-- ,黑脸判官={技能="魔之心",属性=20,类型="速度",正负=1,单独=1,等级=7}
	-- ,龙须豹={技能="敏捷",属性=25,类型="伤害",正负=1,单独=1,等级=7}


	--8级
	,律法女娲={技能="高级反击",属性=10,类型="速度",正负=2,等级=8}
	,炎魔神={技能="高级魔之心",属性=15,类型="气血",正负=2,等级=8}
	,画魂={技能="高级幸运",属性=0,类型="",正负=0,等级=8}
	,灵符女娲={技能="魔之心",属性=0,类型="",正负=0,等级=8}
	,吸血鬼={技能="偷袭",属性=5,类型="速度",正负=2,等级=8}
	,巴蛇={技能="高级毒",属性=0,类型="",正负=0,等级=8}
	,净瓶女娲={技能="高级永恒",属性=5,类型="防御",正负=2,等级=8}
	,踏云兽={技能="",属性=10,类型="气血",正负=1,等级=8}
	,龙龟={技能="法术防御",属性=15,类型="气血",正负=2,等级=8}
	,红萼仙子={技能="敏捷",属性=5,类型="气血",正负=1,等级=8}
	,噬天虎={技能="高级强力",属性=10,类型="速度",正负=2,等级=8}
	,灵鹤={技能="高级魔之心",属性=10,类型="防御",正负=2,等级=8}
	,大力金刚={技能="高级防御",属性=5,类型="灵力",正负=2,等级=8}
	,机关鸟={技能="高级再生",属性=5,类型="防御",正负=2,等级=8}
	,鬼将={技能="高级必杀",属性=10,类型="伤害",正负=2,等级=8}
	,葫芦宝贝={技能="慧根",属性=5,类型="气血",正负=1,等级=8}
	,机关人={技能="壁垒击破",属性=5,类型="防御",正负=1,等级=8}
	,幽灵={技能="高级夜战",属性=0,类型="",正负=0,等级=8}
	,幽萤娃娃={技能="敏捷",属性=5,类型="防御",正负=1,等级=8}
	,雾中仙={技能="高级敏捷",属性=10,类型="防御",正负=2,等级=8}
	,夜罗刹={技能="高级夜战",属性=5,类型="速度",正负=1,等级=8}
	,连弩车={技能="高级强力",属性=10,类型="气血",正负=2,等级=8}
	,机关兽={技能="",属性=10,类型="速度",正负=1,等级=8}
	,琴仙={技能="法术防御",属性=10,类型="灵力",正负=1,单独=1,等级=8}
	,金铙僧={技能="高级防御",属性=5,类型="气血",正负=1,等级=8}
	--新加
	-- ,玄珠灵仙={技能="高级法术抵抗",属性=10,类型="气血",正负=2,等级=8}
	-- ,云游火={技能="高级飞行",属性=4,类型="气血",正负=1,等级=8}
	-- ,光辉女神={技能="高级慧根",属性=5,类型="气血",正负=1,等级=8}
	-- ,小魔女={技能="高级招架",属性=5,类型="速度",正负=1,等级=8}
	-- ,帮派妖兽={技能="高级再生",属性=8,类型="伤害",正负=1,等级=8}
	-- ,["无常鬼差·白"]={技能="高级防御",属性=8,类型="伤害",正负=1,等级=8}
	-- ,["无常鬼差·黑"]={技能="高级夜战",属性=8,类型="伤害",正负=1,等级=8}
	-- ,["泡泡灵仙·剑侠客"]={技能="乘胜追击",属性=10,类型="气血",正负=1,等级=8}
	-- ,火女={技能="高级驱鬼",属性=5,类型="速度",正负=1,等级=8}
	-- ,狐不归={技能="高级法术穿透",属性=0,类型="",正负=0,等级=8}
	-- ,男狐妖={技能="高级物理穿透",属性=0,类型="",正负=0,等级=8}
	-- ,画仙={技能="高级助攻",属性=0,类型="",正负=0,等级=8}
	-- ,白衣剑客={技能="高级偷袭",属性=0,类型="",正负=0,等级=8}
	-- ,砍刀猴={技能="高级连击",属性=5,类型="防御",正负=1,等级=8}
	-- ,红衣仙女={技能="高级法术抵抗",属性=5,类型="伤害",正负=2,等级=8}
	-- ,绿衣女神={技能="高级招架",属性=5,类型="法防",正负=1,等级=8}
	-- ,蓝衣剑魂={技能="高级保命",属性=0,类型="",正负=0,等级=8}
	-- ,超级三眼娃={技能="高级冥思",属性=10,类型="魔法",正负=1,等级=8}
	-- ,进阶云游火={技能="高级飞行",属性=8,类型="伤害",正负=1,等级=8}
	-- ,进阶狐不归={技能="高级法术穿透",属性=5,类型="法伤",正负=1,等级=8}
	-- ,进阶花铃={技能="高级驱鬼",属性=5,类型="法伤",正负=1,等级=8}
	-- ,部落勇士={技能="必杀",属性=8,类型="伤害",正负=1,等级=8}
	-- ,金长毛猪={技能="幸运",属性=10,类型="防御",正负=1,等级=8}
	-- ,金麟鹿={技能="幸运",属性=10,类型="法防",正负=1,等级=8}
	-- ,鬼魅={技能="高级魔之心",属性=5,类型="速度",正负=2,等级=8}

	,进阶律法女娲={技能="高级反击",属性=7,类型="速度",正负=2,等级=8}
	,进阶炎魔神={技能="高级魔之心",属性=5,类型="气血",正负=2,等级=8}
	,进阶画魂={技能="高级幸运",属性=20,类型="灵力",正负=1,单独=1,等级=8}
	,进阶灵符女娲={技能="魔之心",属性=15,类型="灵力",正负=1,单独=1,等级=8}
	,进阶吸血鬼={技能="偷袭",属性=3,类型="速度",正负=2,等级=8}
	,进阶巴蛇={技能="高级毒",属性=15,类型="速度",正负=1,单独=1,等级=8}
	,进阶净瓶女娲={技能="高级永恒",属性=4,类型="防御",正负=2,等级=8}
	,进阶踏云兽={技能="",属性=15,类型="气血",正负=1,等级=8}
	,进阶龙龟={技能="法术防御",属性=10,类型="气血",正负=2,等级=8}
	,进阶红萼仙子={技能="敏捷",属性=7,类型="气血",正负=1,等级=8}
	,进阶噬天虎={技能="高级强力",属性=5,类型="速度",正负=2,等级=8}
	,进阶灵鹤={技能="高级魔之心",属性=5,类型="防御",正负=2,等级=8}
	,进阶大力金刚={技能="高级防御",属性=3,类型="灵力",正负=2,等级=8}
	,进阶机关鸟={技能="高级再生",属性=3,类型="防御",正负=2,等级=8}
	,进阶鬼将={技能="高级必杀",属性=7,类型="伤害",正负=2,等级=8}
	,进阶葫芦宝贝={技能="慧根",属性=8,类型="气血",正负=1,等级=8}
	,进阶机关人={技能="壁垒击破",属性=3,类型="防御",正负=1,等级=8}
	,进阶幽灵={技能="高级夜战",属性=50,类型="伤害",正负=1,单独=1,等级=8}
	,进阶幽萤娃娃={技能="敏捷",属性=6,类型="防御",正负=1,等级=8}
	,进阶雾中仙={技能="高级敏捷",属性=9,类型="防御",正负=2,等级=8}
	,进阶夜罗刹={技能="高级夜战",属性=10,类型="速度",正负=1,等级=8}
	,进阶连弩车={技能="高级强力",属性=5,类型="气血",正负=2,等级=8}
	,进阶机关兽={技能="",属性=15,类型="速度",正负=1,等级=8}
	,进阶琴仙={技能="法术防御",属性=30,类型="灵力",正负=1,单独=1,等级=8}
	,进阶金铙僧={技能="高级防御",属性=10,类型="气血",正负=1,等级=8}


	--9级
	,混沌兽={技能="高级魔之心",属性=12,类型="气血",正负=2,等级=9}
	,猫灵人形={技能="敏捷",属性=10,类型="速度",正负=1,单独=1,等级=9}
	,猫灵兽形={技能="敏捷",属性=10,类型="速度",正负=1,单独=1,等级=9}
	,狂豹人形={技能="高级飞行",属性=5,类型="速度",正负=1,等级=9}
	,狂豹兽形={技能="高级飞行",属性=5,类型="速度",正负=1,等级=9}
	,蝎子精={技能="高级反震",属性=10,类型="气血",正负=2,等级=9}
	,蜃气妖={技能="魔之心",属性=30,类型="防御",正负=1,单独=1,等级=9}
	,曼珠沙华={技能="高级敏捷",属性=9,类型="防御",正负=2,等级=9}
	,长眉灵猴={技能="法术暴击",属性=10,类型="气血",正负=2,等级=9}
	,巨力神猿={技能="高级强力",属性=5,类型="灵力",正负=2,等级=9}
	,金身罗汉={技能="魔之心",属性=10,类型="气血",正负=1,等级=9}
	,藤蔓妖花={技能="毒",属性=100,类型="命中",正负=1,单独=1,等级=9}
	,修罗傀儡鬼={技能="夜战",属性=150,类型="气血",正负=1,单独=1,等级=9}
	,修罗傀儡妖={技能="必杀",属性=0,类型="",正负=0,等级=9}
	,毗舍童子={技能="高级必杀",属性=8,类型="伤害",正负=2,等级=9}
	,持国巡守={技能="法术暴击",属性=8,类型="气血",正负=2,等级=9}
	,真陀护法={技能="偷袭",属性=3,类型="防御",正负=2,等级=9}
	,增长巡守={技能="法术防御",属性=9,类型="防御",正负=2,等级=9}
	,灵灯侍者={技能="高级慧根",属性=4,类型="防御",正负=2,等级=9}
	,般若天女={技能="法术波动",属性=0,类型="",正负=0,等级=9}
	,进阶混沌兽={技能="高级魔之心",属性=10,类型="灵力",正负=1,单独=1,等级=9}
	,进阶猫灵人形={技能="敏捷",属性=25,类型="速度",正负=1,单独=1,等级=9}
	,进阶猫灵兽形={技能="敏捷",属性=25,类型="速度",正负=1,单独=1,等级=9}
	,进阶狂豹人形={技能="高级飞行",属性=8,类型="速度",正负=1,等级=9}
	,进阶狂豹兽形={技能="高级飞行",属性=8,类型="速度",正负=1,等级=9}
	,进阶蝎子精={技能="高级反震",属性=8,类型="气血",正负=2,等级=9}
	,进阶蜃气妖={技能="魔之心",属性=15,类型="灵力",正负=1,单独=1,等级=9}
	,进阶曼珠沙华={技能="高级敏捷",属性=8,类型="防御",正负=2,等级=9}
	,进阶长眉灵猴={技能="法术暴击",属性=7,类型="气血",正负=2,等级=9}
	,进阶巨力神猿={技能="高级强力",属性=30,类型="伤害",正负=1,单独=1,等级=9}
	,进阶金身罗汉={技能="魔之心",属性=15,类型="气血",正负=1,等级=9}
	,进阶藤蔓妖花={技能="毒",属性=300,类型="命中",正负=1,单独=1,等级=9}
	,进阶修罗傀儡鬼={技能="夜战",属性=350,类型="气血",正负=1,单独=1,等级=9}
	,进阶修罗傀儡妖={技能="必杀",属性=1,类型="伤害",正负=1,等级=9}
	,进阶毗舍童子={技能="高级必杀",属性=6,类型="伤害",正负=2,等级=9}
	,进阶持国巡守={技能="高级法术暴击",属性=6,类型="气血",正负=2,等级=9}
	,进阶真陀护法={技能="偷袭",属性=1,类型="防御",正负=2,等级=9}
	,进阶增长巡守={技能="法术防御",属性=7,类型="防御",正负=2,等级=9}
	,进阶灵灯侍者={技能="高级慧根",属性=2,类型="防御",正负=2,等级=9}
	,进阶般若天女={技能="法术波动",属性=15,类型="灵力",正负=1,单独=1,等级=9}


	-- ,雷龙={技能="神迹",属性=5,类型="速度",正负=1,等级=9}
	-- ,沙暴={技能="高级防御",属性=10,类型="魔法",正负=1,等级=9}
	-- ,自在心猿={技能="助攻",属性=5,类型="气血",正负=1,等级=9}
	-- ,胡不归={技能="高级强力",属性=5,类型="气血",正负=1,等级=9}
	-- ,龙鲤={技能="冲击",属性=10,类型="速度",正负=1,等级=9}

	-- ,牛魔王={技能="法术暴击",属性=5,类型="法伤",正负=1,等级=9}
	-- ,超级土地公公={技能="法术暴击",属性=5,类型="法伤",正负=1,等级=9}

	-- ,剑姬={技能="高级反击",属性=5,类型="伤害",正负=1,等级=9}
	-- ,逍遥神牛={技能="高级必杀",属性=10,类型="气血",正负=1,等级=9}
	-- ,剑灵双子={技能="出其不意",属性=10,类型="伤害",正负=2,等级=9}
	-- ,月魅={技能="溜之大吉",属性=5,类型="防御",正负=2,等级=9}
	-- ,齐天大圣={技能="法术助攻",属性=5,类型="魔法",正负=1,等级=9}
	-- ,风火轮器灵={技能="吸血",属性=5,类型="伤害",正负=2,等级=9}
	-- ,氪金大佬={技能="高级法术抵抗",属性=5,类型="防御",正负=1,等级=9}
	-- ,鲲鹏={技能="高级必杀",属性=5,类型="伤害",正负=2,等级=9}
	-- ,火熔石={技能="高级偷袭",属性=5,类型="防御",正负=1,等级=9}
	--新加
	-- ,仙兽翼龙={技能="高级法术连击",属性=10,类型="气血",正负=1,等级=9}
	-- ,兔乖乖={技能="高级敏捷",属性=10,类型="气血",正负=1,等级=9}
	-- ,壬寅神虎={技能="高级反击",属性=10,类型="气血",正负=1,等级=9}
	-- ,神兽孙小圣={技能="高级夜战",属性=10,类型="气血",正负=1,等级=9}
	-- ,神兽小龙人={技能="高级驱鬼",属性=10,类型="气血",正负=1,等级=9}
	-- ,神兽时光叽={技能="高级偷袭",属性=10,类型="气血",正负=1,等级=9}
	-- ,神兽百灵羊={技能="高级法术穿透",属性=10,类型="气血",正负=1,等级=9}
	-- ,神兽雪精灵={技能="高级气势",属性=10,类型="气血",正负=1,等级=9}
	-- ,癸卯神兔={技能="高级魔之心",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级人参娃娃={技能="高级慧根",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级六耳猕猴={技能="高级法术助攻",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级土地公公={技能="高级助攻",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级大熊猫={技能="高级招架",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级大象={技能="高级强力",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级大鹏={技能="高级飞行",属性=10,类型="法伤",正负=1,等级=9}
	-- ,超级孔雀={技能="高级进击法爆",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级小白龙={技能="高级法术连击",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级泡泡={技能="高级连击",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级海豚={技能="高级幸运",属性=8,类型="伤害",正负=1,等级=9}
	-- ,超级灵鹿={技能="高级盾气",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级猪小戒={技能="高级神武盾气",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级玉兔={技能="高级勇敢",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级白泽={技能="高级反震",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级神兔={技能="高级毒",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级神柚={技能="高级神佑复生",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级神牛={技能="高级蛮劲",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级神狗={技能="高级连击",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级神猪={技能="高级魔之心",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级神猴={技能="高级反震",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级神羊={技能="高级反击",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级神虎={技能="高级逆击",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级神蛇={技能="高级保命",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级神马={技能="高级敏捷",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级神鸡={技能="高级进击必杀",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级神鼠={技能="高级敏捷",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级神龙={技能="高级审判",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级离火兽={技能="高级报复",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级筋斗云={技能="高级法术波动",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级红孩儿={技能="高级法术暴击",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级腾蛇={技能="高级魔之心",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级赤焰兽={技能="高级冰霜",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级金猴={技能="高级魔法反击",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级青鸾={技能="高级必杀",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级飞廉={技能="高级必杀",属性=10,类型="气血",正负=1,等级=9}
	-- ,超级麒麟={技能="神迹",属性=10,类型="气血",正负=1,等级=9}
	-- ,辛丑神牛={技能="高级神武盾气",属性=10,类型="气血",正负=1,等级=9}
	-- ,进阶超级大熊猫={技能="超级招架",属性=10,类型="气血",正负=1,等级=9}
	-- ,进阶逍遥神牛={技能="奋勇当先",属性=10,类型="气血",正负=1,等级=9}
	-- ,飞天={技能="高级法术连击",属性=10,类型="气血",正负=1,等级=9}
	-- ,鲲鹏={技能="高级敏捷",属性=10,类型="气血",正负=1,等级=9}
	-- ,齐天小圣={技能="高级必杀",属性=10,类型="气血",正负=1,等级=9}
	-- ,三尾妖狐={技能="高级敏捷",属性=8,类型="法防",正负=1,等级=9}
	-- ,五彩神女={技能="高级冥思",属性=15,类型="魔法",正负=1,等级=9}
	-- ,佐助={技能="高级助攻",属性=7,类型="速度",正负=1,等级=9}
	-- ,佛子={技能="高级审判",属性=7,类型="速度",正负=1,等级=9}
	-- ,六道带土={技能="高级偷袭",属性=7,类型="速度",正负=1,等级=9}
	-- ,六道斑={技能="高级反击",属性=8,类型="速度",正负=1,等级=9}
	-- ,凤九={技能="高级幸运",属性=8,类型="速度",正负=1,等级=9}
	-- ,剑仙={技能="高级进击必杀",属性=7,类型="伤害",正负=1,等级=9}
	-- ,剑灵双子={技能="高级必杀",属性=5,类型="伤害",正负=1,等级=9}
	-- ,哮天犬={技能="高级偷袭",属性=7,类型="速度",正负=1,等级=9}
	-- ,四翼上仙={技能="高级保命",属性=8,类型="法伤",正负=1,等级=9}
	-- ,四臂魔神={技能="高级强力",属性=8,类型="伤害",正负=1,等级=9}
	-- ,夜游神={技能="高级夜战",属性=8,类型="伤害",正负=1,等级=9}
	-- ,夜莺={技能="高级魔之心",属性=8,类型="法伤",正负=1,等级=9}
	-- ,天兵统领={技能="神佑复生",属性=15,类型="气血",正负=1,等级=9}
	-- ,妖星={技能="高级迟钝",属性=13,类型="伤害",正负=1,等级=9}
	-- ,妙华天女={技能="高级防御",属性=10,类型="法防",正负=1,等级=9}
	-- ,小佐助={技能="高级法术助攻",属性=7,类型="速度",正负=1,等级=9}
	-- ,小红孩儿={技能="高级法术暴击",属性=5,类型="速度",正负=1,等级=9}
	-- ,小鸣人={技能="高级助攻",属性=7,类型="速度",正负=1,等级=9}
	-- ,巨灵狼={技能="高级强力",属性=7,类型="伤害",正负=1,等级=9}
	-- ,幽灵虎={技能="高级敏捷",属性=10,类型="魔法",正负=1,等级=9}
	-- ,怜星={技能="神迹",属性=6,类型="速度",正负=1,等级=9}
	-- ,我爱罗={技能="高级法术连击",属性=6,类型="速度",正负=1,等级=9}
	-- ,战神罗成={技能="高级反击",属性=10,类型="防御",正负=1,等级=9}
	-- ,托塔娃={技能="高级永恒",属性=10,类型="气血",正负=1,等级=9}
	-- ,执音={技能="高级魔之心",属性=10,类型="法防",正负=1,等级=9}
	-- ,旗木卡卡西={技能="高级敏捷",属性=8,类型="伤害",正负=1,等级=9}
	-- ,月影仙={技能="高级敏捷",属性=10,类型="防御",正负=1,等级=9}
	-- ,月影兔={技能="高级敏捷",属性=10,类型="法防",正负=1,等级=9}
	-- ,月灵={技能="高级法术波动",属性=10,类型="法防",正负=1,等级=9}
	-- ,月皇={技能="高级法术波动",属性=10,类型="防御",正负=1,等级=9}
	-- ,月魅={技能="高级法术连击",属性=10,类型="防御",正负=0,等级=9}
	-- ,李蓉蓉={技能="高级法术连击",属性=10,类型="法防",正负=1,等级=9}
	-- ,武罗仙子={技能="高级物理穿透",属性=10,类型="防御",正负=0,等级=9}
	-- ,氪金大佬={技能="高级物理穿透",属性=7,类型="速度",正负=1,等级=9}
	-- ,水龙={技能="神迹",属性=10,类型="气血",正负=1,等级=9}
	-- ,沙暴={技能="高级助攻",属性=8,类型="防御",正负=1,等级=9}
	-- ,涂山瞳={技能="高级法术助攻",属性=8,类型="防御",正负=1,等级=9}
	-- ,涂山雪={技能="高级法术助攻",属性=8,类型="法防",正负=1,等级=9}
	-- ,火熔石={技能="吸血",属性=3,类型="速度",正负=1,等级=9}
	-- ,狂狮={技能="高级毒",属性=8,类型="伤害",正负=1,等级=9}
	-- ,狮仙={技能="高级法术抵抗",属性=10,类型="防御",正负=1,等级=9}
	-- ,玄武={技能="高级招架",属性=10,类型="法防",正负=1,等级=9}
	-- ,神武雨师={技能="高级魔之心",属性=10,类型="防御",正负=1,等级=9}
	-- ,神武风伯={技能="高级魔之心",属性=10,类型="法防",正负=1,等级=9}
	-- ,紫焰妖姬={技能="高级魔之心",属性=7,类型="速度",正负=1,等级=9}
	-- ,罗汉={技能="高级感知",属性=10,类型="法伤",正负=1,等级=9}
	-- ,老鹰精={技能="高级感知",属性=10,类型="伤害",正负=1,等级=9}
	-- ,自在心猿={技能="高级幸运",属性=8,类型="伤害",正负=1,等级=9}
	-- ,莲女={技能="高级幸运",属性=10,类型="法伤",正负=1,等级=9}
	-- ,葫仙={技能="高级幸运",属性=10,类型="防御",正负=1,等级=9}
	-- ,进阶妙华天女={技能="凝光炼彩",属性=10,类型="法防",正负=1,等级=9}
	-- ,进阶月影仙={技能="高级防御",属性=15,类型="法防",正负=1,等级=9}
	-- ,进阶月魅={技能="高级法术连击",属性=15,类型="防御",正负=1,等级=9}
	-- ,进阶涂山雪={技能="高级法术助攻",属性=12,类型="法防",正负=1,等级=9}
	-- ,进阶雷龙={技能="高级气势",属性=8,类型="伤害",正负=1,等级=9}
	-- ,通臂猿猴={技能="高级进击必杀",属性=8,类型="伤害",正负=1,等级=9}
	-- ,酷炫佬={技能="高级进击必杀",属性=10,类型="防御",正负=1,等级=9}
	-- ,酷炫老逼登={技能="高级进击必杀",属性=10,类型="法防",正负=1,等级=9}
	-- ,长乐灵仙={技能="高级进击法爆",属性=10,类型="防御",正负=1,等级=9}
	-- ,长鞭变脸={技能="高级进击法爆",属性=10,类型="法防",正负=1,等级=9}
	-- ,雷龙={技能="高级气势",属性=5,类型="伤害",正负=1,等级=9}
	-- ,风火轮器灵={技能="高级魔法反击",属性=10,类型="防御",正负=1,等级=9}
	-- ,鬼妃={技能="高级驱鬼",属性=8,类型="法伤",正负=1,等级=9}
	-- ,鸣人={技能="高级驱鬼",属性=8,类型="伤害",正负=1,等级=9}
	-- ,鼬={技能="神迹",属性=8,类型="伤害",正负=1,等级=9}
	-- ,齐天大圣={技能="高级必杀",属性=8,类型="伤害",正负=1,等级=9}
	-- ,龙仙={技能="高级进击法爆",属性=8,类型="法伤",正负=1,等级=9}
	-- ,龙虾骑士={技能="高级进击必杀",属性=8,类型="伤害",正负=1,等级=9}
	-- ,龙魂仙女={技能="高级进击必杀",属性=7,类型="速度",正负=1,等级=9}
	-- ,龙鲤={技能="高级冰霜",属性=10,类型="气血",正负=1,等级=9}

	-- ,虬龙={技能="高级助攻",属性=5,类型="速度",正负=1,等级=9}
	-- ,无名上仙={技能="高级驱鬼",属性=8,类型="法伤",正负=1,等级=9}
	-- ,司雪={技能="高级魔之心",属性=8,类型="法伤",正负=1,等级=9}
	-- ,谛听={技能="高级慧根",属性=10,类型="法防",正负=1,等级=9}
	-- ,进阶谛听={技能="高级慧根",属性=10,类型="法伤",正负=1,等级=9}
	-- ,超级灵狐={技能="高级法术连击",属性=10,类型="气血",正负=1,等级=9}
	-- ,龙马={技能="高级反击",属性=10,类型="气血",正负=1,等级=9}

	--十级
	-- ,Q版魔化毗舍童子={技能="超级进击必杀",属性=8,类型="伤害",正负=1,等级=10}
	-- ,["一尾·守鹤"]={技能="超级必杀",属性=8,类型="伤害",正负=1,等级=10}
	-- ,["七尾·重明"]={技能="超级法术波动",属性=8,类型="法伤",正负=1,等级=10}
	-- ,["三尾·矶抚"]={技能="超级法术抵抗",属性=15,类型="防御",正负=1,等级=10}
	-- ,东海龙王={技能="超级水属性吸收",属性=15,类型="法伤",正负=1,等级=10}
	-- ,九头精怪={技能="超级再生",属性=15,类型="伤害",正负=1,等级=10}
	-- ,["九尾·九喇嘛"]={技能="超级法术暴击",属性=10,类型="法伤",正负=1,等级=10}
	-- ,二大王={技能="超级防御",属性=15,类型="法防",正负=1,等级=10}
	-- ,["二尾·又旅"]={技能="超级进击必杀",属性=10,类型="伤害",正负=1,等级=10}
	-- ,二郎神={技能="超级敏捷",属性=10,类型="伤害",正负=1,等级=10}
	-- ,["五尾·穆王"]={技能="超级法术连击",属性=8,类型="法伤",正负=1,等级=10}
	-- ,佩恩={技能="超级魔之心",属性=8,类型="速度",正负=1,等级=10}
	-- ,光明战神={技能="超级进击必杀",属性=10,类型="防御",正负=1,等级=10}
	-- ,["八尾·牛鬼"]={技能="超级法术暴击",属性=8,类型="法伤",正负=1,等级=10}
	-- ,["四尾·孙悟空"]={技能="超级必杀",属性=10,类型="伤害",正负=1,等级=10}
	-- ,关羽={技能="超级毒",属性=10,类型="伤害",正负=1,等级=10}
	-- ,判官={技能="超级盾气",属性=15,类型="法防",正负=1,等级=10}
	-- ,剑圣={技能="超级飞行",属性=5,类型="伤害",正负=1,等级=10}
	-- ,剑姬={技能="超级进击必杀",属性=8,类型="速度",正负=1,等级=10}
	-- ,剑魂={技能="超级幸运",属性=10,类型="伤害",正负=1,等级=10}
	-- ,周杰伦={技能="超级必杀",属性=8,类型="伤害",正负=0,等级=10}
	-- ,["六尾·犀犬"]={技能="超级招架",属性=15,类型="法防",正负=1,等级=10}
	-- ,地涌夫人={技能="超级土属性吸收",属性=10,类型="法伤",正负=1,等级=10}
	-- ,地藏王={技能="超级夜战",属性=10,类型="伤害",正负=1,等级=10}
	-- ,大大王={技能="超级必杀",属性=8,类型="伤害",正负=1,等级=10}
	-- ,大蛇丸={技能="超级再生",属性=15,类型="法防",正负=1,等级=10}
	-- ,大象精={技能="超级法术抵抗",属性=15,类型="防御",正负=1,等级=10}
	-- ,天后={技能="超级进击法爆",属性=10,类型="法伤",正负=1,等级=10}
	-- ,天师={技能="超级反震",属性=10,类型="伤害",正负=1,等级=10}
	-- ,天帝={技能="超级进击必杀",属性=10,类型="伤害",正负=1,等级=10}
	-- ,太极真君={技能="超级强力",属性=10,类型="伤害",正负=1,等级=10}
	-- ,太极神君={技能="超级魔之心",属性=10,类型="防御",正负=1,等级=10}
	-- ,太极老君={技能="超级慧根",属性=20,类型="魔法",正负=1,等级=10}
	-- ,女仙={技能="超级飞行",属性=5,类型="法伤",正负=1,等级=10}
	-- ,孙婆婆={技能="超级敏捷",属性=10,类型="伤害",正负=1,等级=10}
	-- ,孙悟空={技能="超级夜战",属性=5,类型="伤害",正负=1,等级=10}
	-- ,孙行者={技能="超级夜战",属性=10,类型="法防",正负=1,等级=10}
	-- ,宇智波佐助={技能="超级夜战",属性=10,类型="防御",正负=1,等级=10}
	-- ,宇智波带土={技能="超级偷袭",属性=0,类型="",正负=0,等级=10}
	-- ,宇智波鼬={技能="超级法术连击",属性=0,类型="",正负=0,等级=10}
	-- ,尉迟恭={技能="超级驱鬼",属性=10,类型="伤害",正负=1,等级=10}
	-- ,小南={技能="超级法术连击",属性=0,类型="",正负=0,等级=10}
	-- ,小狐狸={技能="超级连击",属性=0,类型="",正负=0,等级=10}
	-- ,小青={技能="超级法术抵抗",属性=8,类型="速度",正负=1,等级=10}
	-- ,巨灵神={技能="超级防御",属性=10,类型="法防",正负=1,等级=10}
	-- ,巫奎虎={技能="上善若水",属性=10,类型="防御",正负=1,等级=10}
	-- ,干柿鬼鲛={技能="超级防御",属性=20,类型="气血",正负=1,等级=10}
	-- ,广目天王={技能="超级法术波动",属性=0,类型="",正负=0,等级=10}
	-- ,战将={技能="战斗号角",属性=5,类型="速度",正负=1,等级=10}
	-- ,拽王={技能="超级夜战",属性=8,类型="速度",正负=1,等级=10}
	-- ,斧魂={技能="超级强力",属性=10,类型="伤害",正负=1,等级=10}
	-- ,新孙悟空={技能="出其不意",属性=0,类型="",正负=0,等级=10}
	-- ,新猪八戒={技能="津津有味",属性=0,类型="",正负=0,等级=10}
	-- ,春十三娘={技能="超级毒",属性=10,类型="防御",正负=1,等级=10}
	-- ,春野樱={技能="超级法术抵抗",属性=15,类型="气血",正负=1,等级=10}
	-- ,暗黑毗舍童子={技能="苍鸾怒击",属性=8,类型="伤害",正负=1,等级=10}
	-- ,暗黑谛听={技能="超级法术暴击",属性=10,类型="防御",正负=1,等级=10}
	-- ,暗黑龙={技能="战斗号角",属性=8,类型="伤害",正负=1,等级=10}
	-- ,月仙={技能="超级法术暴击",属性=10,类型="法防",正负=1,等级=10}
	-- ,月宫仙子={技能="移花接木",属性=10,类型="防御",正负=1,等级=10}
	-- ,杀阡陌={技能="超级反震",属性=10,类型="法伤",正负=1,等级=10}
	-- ,李洛克={技能="超级敏捷",属性=10,类型="防御",正负=1,等级=10}
	-- ,李靖={技能="超级飞行",属性=15,类型="防御",正负=1,等级=10}
	-- ,杨二郎={技能="超级偷袭",属性=0,类型="",正负=0,等级=10}
	-- ,枪魂={技能="超级幸运",属性=10,类型="伤害",正负=1,等级=10}
	-- ,死亡骑士={技能="超级必杀",属性=5,类型="伤害",正负=1,等级=10}
	-- ,沙僧={技能="超级魔之心",属性=8,类型="法防",正负=1,等级=10}
	-- ,法僧={技能="超级驱鬼",属性=10,类型="法防",正负=1,等级=10}
	-- ,洛神={技能="超级法术波动",属性=0,类型="",正负=0,等级=10}
	-- ,火龙骑士={技能="风起龙游",属性=8,类型="速度",正负=1,等级=10}
	-- ,熊猫大侠={技能="超级防御",属性=8,类型="速度",正负=1,等级=10}
	-- ,牛魔王={技能="超级火属性吸收",属性=15,类型="法伤",正负=1,等级=10}
	-- ,猪八戒={技能="津津有味",属性=0,类型="",正负=0,等级=10}
	-- ,琴瑟仙女={技能="超级法术抵抗",属性=15,类型="气血",正负=1,等级=10}
	-- ,白娘子={技能="超级招架",属性=8,类型="速度",正负=1,等级=10}
	-- ,白子画={技能="超级招架",属性=10,类型="法防",正负=1,等级=10}
	-- ,白晶晶={技能="超级招架",属性=10,类型="法伤",正负=1,等级=10}
	-- ,白無常={技能="超级招架",属性=8,类型="伤害",正负=1,等级=10}
	-- ,白素贞={技能="超级招架",属性=10,类型="防御",正负=1,等级=10}
	-- ,白骨精={技能="超级驱鬼",属性=10,类型="法伤",正负=1,等级=10}
	-- ,白龙骑士={技能="风起龙游",属性=8,类型="伤害",正负=1,等级=10}
	-- ,知了王={技能="超级毒",属性=10,类型="法防",正负=1,等级=10}
	-- ,神僧={技能="超级法术波动",属性=3,类型="速度",正负=1,等级=10}
	-- ,福禄仙={技能="超级飞行",属性=5,类型="速度",正负=1,等级=10}
	-- ,程咬金={技能="超级必杀",属性=10,类型="防御",正负=1,等级=10}
	-- ,空度禅师={技能="超级反震",属性=20,类型="气血",正负=1,等级=10}
	-- ,紫霞={技能="上善若水",属性=10,类型="速度",正负=2,等级=10}
	-- ,紫霞仙子={技能="移花接木",属性=10,类型="法伤",正负=1,等级=10}
	-- ,红孩儿={技能="桀骜自恃",属性=15,类型="法伤",正负=2,等级=10}
	-- ,美猴王={技能="超级必杀",属性=10,类型="法防",正负=1,等级=10}
	-- ,老夫子={技能="昼伏夜出",属性=12,类型="法伤",正负=1,等级=10}
	-- ,葫芦小金刚={技能="超级进击必杀",属性=8,类型="伤害",正负=1,等级=10}
	-- ,蓝人龙={技能="战斗号角",属性=8,类型="法伤",正负=1,等级=10}
	-- ,蓝仙女={技能="超级幸运",属性=8,类型="速度",正负=1,等级=10}
	-- ,蓝凤凰={技能="超级飞行",属性=10,类型="法防",正负=1,等级=10}
	-- ,蚩尤={技能="赶尽杀绝",属性=10,类型="伤害",正负=1,等级=10}
	-- ,观音姐姐={技能="出其不意",属性=0,类型="",正负=0,等级=10}
	-- ,貂蝉={技能="超级幸运",属性=10,类型="法防",正负=1,等级=10}
	-- ,贪狼={技能="昼伏夜出",属性=10,类型="伤害",正负=1,等级=10}
	-- ,赤炎战神={技能="从天而降",属性=8,类型="伤害",正负=1,等级=10}
	-- ,赵云={技能="超级必杀",属性=6,类型="速度",正负=1,等级=10}
	-- ,赵敏={技能="超级偷袭",属性=0,类型="",正负=0,等级=10}
	-- ,路飞={技能="超级必杀",属性=5,类型="伤害",正负=1,等级=10}
	-- ,进阶太极真君={技能="超级强力",属性=15,类型="伤害",正负=1,等级=10}
	-- ,进阶蚩尤={技能="赶尽杀绝",属性=15,类型="伤害",正负=1,等级=10}
	-- ,邀月={技能="超级敏捷",属性=10,类型="法伤",正负=1,等级=10}
	-- ,金凤凰={技能="超级飞行",属性=10,类型="防御",正负=1,等级=10}
	-- ,金衣仙={技能="超级飞行",属性=5,类型="速度",正负=1,等级=10}
	-- ,镇元={技能="超级法术抵抗",属性=20,类型="魔法",正负=1,等级=10}
	-- ,镇元大仙={技能="驱怪",属性=10,类型="法防",正负=1,等级=10}
	-- ,阎王爷={技能="驱怪",属性=10,类型="防御",正负=1,等级=10}
	-- ,阿朱={技能="上善若水",属性=10,类型="速度",正负=2,等级=10}
	-- ,青霞仙子={技能="移花接木",属性=10,类型="法防",正负=1,等级=10}
	-- ,鬼君={技能="超级毒",属性=8,类型="速度",正负=1,等级=10}
	-- ,魔化毗舍童子={技能="从天而降",属性=8,类型="伤害",正负=1,等级=10}
	-- ,鹿君={技能="超级幸运",属性=10,类型="法伤",正负=1,等级=10}
	-- ,黑悟空={技能="超级幸运",属性=10,类型="伤害",正负=1,等级=10}
	-- ,黑白狂豹人形={技能="驱怪",属性=5,类型="速度",正负=1,等级=10}
	-- ,龙剑士={技能="超级进击必杀",属性=10,类型="防御",正负=1,等级=10}
	-- ,龙剑女={技能="超级进击必杀",属性=10,类型="法防",正负=1,等级=10}
	-- ,龙王={技能="超级反震",属性=15,类型="气血",正负=1,等级=10}
	-- ,龙羽={技能="超级进击必杀",属性=8,类型="速度",正负=1,等级=10}
	-- ,菩提祖师={技能="超级驱鬼",属性=10,类型="速度",正负=1,等级=10}
	-- ,花无缺={技能="超级必杀",属性=5,类型="速度",正负=1,等级=10}

}--正负= 1是加 2是减 默认百分比 如果有单独=1 那就是数值
return 图鉴查看