-- @Author: baidwwy
-- @Date:   2024-11-05 21:04:45
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-01-03 19:18:56
-- @Author: 作者QQ381990860
-- @Date:   2023-04-11 22:31:31
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-11-06 04:44:00
-- @Author: 苍穹 QQ:490074394
-- @Date:   2021-11-01 11:27:40
-- @Last Modified by:   作者QQ381990860
-- @Last Modified time: 2023-04-10 21:08:36
-- @Author: 作者小兵 QQ51295586
-- @Date:   2021-10-19 20:41:56
-- @Last Modified by:   作者小兵 QQ51295586
-- @Last Modified time: 2021-10-23 01:34:41
--======================================================================--
-- @作者：小兵 QQ：51295586
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2021-09-29 22:45:54
--======================================================================--
local 战前施法 = class()
 local floor = math.floor
 local tp,zts,zt
 local format = string.format
 local insert = table.insert

 local 地图={
 [1]={地图=" 大唐官府",模型="程咬金",技能="横扫千军",升级技能="大唐官府A",说明="横扫千军附加11层剑意效果，且额\n\n外追加（层数/300）的溅射伤害。",伤害=2},
 [2]={地图=" 化生寺",模型="空度禅师",技能="金刚护法",升级技能="化生寺A",说明="金刚护法额外追加（层数*10）的物理伤害效果。\n\n作用人数额外追加（层数/36）",伤害=2},
 [3]={地图=" 方寸山",模型="菩提老祖",技能="五雷咒",升级技能="方寸山A",说明="法术伤害倍率额外追加*（1+层数/100）。\n\n即满层为2.8。",伤害=2},
 [4]={地图=" 女儿村",模型="孙婆婆",技能="似玉生香",升级技能="女儿村A",说明="葬玉焚花的伤害倍率*（1+层数/200）。",伤害=2},
 [5]={地图=" 神木林",模型="巫奎虎",技能="落叶萧萧",升级技能="神木林A",说明="法术连击率额外追加（层数/5）。",伤害=2},
 [6]={地图=" 九黎城",模型="小蚩尤",技能="三荒尽灭",升级技能="九黎城A",说明="浮空概率追加（层数/4），\n\n所有可浮空技能生效。",伤害=2},
 [7]={地图="  天宫",模型="李靖",技能="雷霆万钧",升级技能="天宫A",说明="雷霆万钧法术伤害倍率*（层数/100）。",伤害=2},
 [8]={地图="  龙宫",模型="东海龙王",技能="龙腾",升级技能="龙宫A",说明="龙腾追加（层数/25）的作用人数。",伤害=2},
 [9]={地图=" 五庄观",模型="镇元子",技能="飘渺式",升级技能="五庄观A",说明="进入战斗获得（1+层数/15）个\n\n人生娃娃状态效果",伤害=2},
 [10]={地图=" 普陀山",模型="观音姐姐",技能="灵动九天",升级技能="普陀山A",说明="灵动九天额外追加（层数*8）的法术伤害效果。\n\n作用人数额外追加（层数/45）",伤害=2},
 [11]={地图=" 花果山",模型="齐天大圣",技能="当头一棒",升级技能="花果山A",说明="当头一棒（含侵蚀）伤害倍率*（层数/100）。",伤害=2},
 [12]={地图=" 凌波城",模型="二郎神",技能="翻江搅海",升级技能="凌波城A",说明="物理暴击率追加（层数/6）。",伤害=2},
 [13]={地图=" 无底洞",模型="地涌夫人",技能="地涌金莲",升级技能="无底洞A",说明="地涌金莲额外追加（层数/36）个作用单位，\n\n最终回复结果*（层数/60）",伤害=2},
 [14]={地图=" 狮驼岭",模型="大大王",技能="狮搏",升级技能="狮驼岭A",说明="狮搏追加（层数/25）的目标人数。\n\n（取消攻击回位动作）",伤害=2},
 [15]={地图=" 魔王寨",模型="牛魔王",技能="秘传飞砂走石",升级技能="魔王寨A",说明="法术暴击率追加（层数/5）。",伤害=2},
 [16]={地图=" 盘丝洞",模型="白晶晶",技能="天罗地网",升级技能="盘丝洞A",说明="天罗地网额外追加（层数/45）个作用单位、\n\n额外追加装备伤害*（层数/100）的固定伤害。",伤害=2},
 [17]={地图="阴曹地府",模型="地藏王",技能="尸腐毒",升级技能="阴曹地府A",说明="尸腐毒额外追加（层数/36）个作用单位、\n\n伤害追加（层数*6）、持续伤害追加（层数*10）。",伤害=2},
 [18]={地图=" 天机城",模型="进阶机关人人形",技能="新_鹰击",升级技能="天机城A",说明="敬请期待···",伤害=2},
 }

local function 特色法术(mp)
 if mp ~= nil then
  -- return {"飞砂走石","金刚护法","狮搏","龙腾","五雷咒",
  --           "侵蚀·龙卷雨击·噬魂","侵蚀·鹰击·噬魂","疯狂鹰击","亢龙归海","龙战于野","潜龙在渊","后发制人","侵蚀·横扫千军·噬魂","其徐如林","侵掠如火",
  --           "岿然如山","佛法无边","妙悟","侵蚀·唧唧歪歪·噬魂","功德无量","秘传飞砂走石","风云变色","魔焰滔天",
  --           "秘传三昧真火","魔火焚世","三昧真火","摇头摆尾","横扫千军","烈火真言","风火燎原","葬玉焚花","蛊木迷瘴","落叶萧萧","风卷残云","血雨","雷霆万钧","星月之惠","风灵",
  --           "花语歌谣","蜜润","侵蚀·失魂符·噬魂","钟馗论道","分身术","一笑倾城","花谢花飞",
  --           "雨落寒沙","侵蚀·葬玉焚花·噬魂","侵蚀·五雷轰顶·噬魂","侵蚀·雷霆万钧·噬魂","雷霆汹涌","风雷韵动","鸣雷诀",
  --           "天雷灌注","普渡众生","波澜不惊","灵动九天","天罗地网","侵蚀·千蛛噬魂·噬魂","百鬼噬魂","生杀予夺","尸腐毒","无间地狱","侵蚀·幽夜无明·噬魂","天命剑法","侵蚀·烟雨剑法·噬魂",
  --           "飘渺式","同伤式","侵蚀·绝烬残光·噬魂","明光宝烛","当头一棒","地涌金莲","化羽为血","浪涌","侵蚀·天崩地裂·噬魂","真君显灵","侵蚀·当头一棒·噬魂",
  --           "神针撼海","侵蚀·棒掀北斗·噬魂","兴风作浪","棍打诸神","天地洞明","力劈华山","法术防御","流沙轻音","扶摇万里","善恶有报",
  --           "超级壁垒击破","超级地狱烈火","超级泰山压顶","超级水漫金山","超级奔雷咒"}
              return  {"飞砂走石","横扫千军","金刚护法","其疾如风","五雷咒",
            "侵蚀·龙卷雨击·噬魂","狮搏","疯狂鹰击","亢龙归海","龙战于野","潜龙在渊","后发制人","侵蚀·横扫千军·噬魂","其徐如林","侵掠如火",
            "岿然如山","佛法无边","葬玉焚花","侵蚀·唧唧歪歪·噬魂","功德无量","秘传飞砂走石","风云变色","魔焰滔天",
            "秘传三昧真火","魔火焚世","三昧真火","摇头摆尾","烈火真言","风火燎原","蛊木迷瘴","落叶萧萧","风卷残云","血雨","星月之惠",
            "花语歌谣","蜜润","侵蚀·失魂符·噬魂","钟馗论道","分身术","一笑倾城","花谢花飞",
            "雨落寒沙","金击式","侵蚀·葬玉焚花·噬魂","侵蚀·五雷轰顶·噬魂","三荒尽灭","侵蚀·雷霆万钧·噬魂","雷霆汹涌","风雷韵动","鸣雷诀",
            "天雷灌注","普渡众生","波澜不惊","灵动九天","天罗地网","侵蚀·千蛛噬魂·噬魂","百鬼噬魂","碎甲符","尸腐毒","无间地狱","侵蚀·幽夜无明·噬魂","天命剑法","侵蚀·烟雨剑法·噬魂",
            "飘渺式","同伤式","侵蚀·绝烬残光·噬魂","明光宝烛","地涌金莲","化羽为血","浪涌","侵蚀·天崩地裂·噬魂","惊涛怒","龙腾","侵蚀·当头一棒·噬魂",
            "神针撼海","侵蚀·棒掀北斗·噬魂","兴风作浪","棍打诸神","天地洞明","天雷斩","灵能激发","力劈华山","法术防御","流沙轻音","扶摇万里","善恶有报",
            "超级壁垒击破","超级地狱烈火","超级泰山压顶","超级水漫金山","超级奔雷咒"}
 end
end
local 随机法术={
--    "飞砂走石","横扫千军","金刚护法","狮搏","龙腾","五雷咒",
--             "侵蚀·龙卷雨击·噬魂","侵蚀·鹰击·噬魂","疯狂鹰击","亢龙归海","龙战于野","潜龙在渊","后发制人","侵蚀·横扫千军·噬魂","其徐如林","侵掠如火",
--             "岿然如山","佛法无边","妙悟","侵蚀·唧唧歪歪·噬魂","侵蚀·嗔怒金刚·噬魂","功德无量","秘传飞砂走石","风云变色","魔焰滔天",
--             "秘传三昧真火","魔火焚世","三昧真火","摇头摆尾","烈火真言","风火燎原","蛊木迷瘴","落叶萧萧","风卷残云","血雨","星月之惠","风灵",
--             "花语歌谣","蜜润","侵蚀·失魂符·噬魂","钟馗论道","分身术","一笑倾城","花谢花飞",
--             "雨落寒沙","葬玉焚花","侵蚀·葬玉焚花·噬魂","侵蚀·五雷轰顶·噬魂","雷霆万钧","侵蚀·雷霆万钧·噬魂","雷霆汹涌","风雷韵动","鸣雷诀",
--             "天雷灌注","普渡众生","波澜不惊","灵动九天","天罗地网","侵蚀·千蛛噬魂·噬魂","百鬼噬魂","生杀予夺","尸腐毒","无间地狱","侵蚀·幽夜无明·噬魂","天命剑法","侵蚀·烟雨剑法·噬魂",
--             "飘渺式","同伤式","侵蚀·绝烬残光·噬魂","明光宝烛","地涌金莲","化羽为血","浪涌","侵蚀·天崩地裂·噬魂","真君显灵","当头一棒","侵蚀·当头一棒·噬魂",
--             "神针撼海","侵蚀·棒掀北斗·噬魂","兴风作浪","棍打诸神","天地洞明","力劈华山","法术防御","流沙轻音","扶摇万里","善恶有报",
--             "超级壁垒击破","超级地狱烈火","超级泰山压顶","超级水漫金山","超级奔雷咒"}
            "飞砂走石","横扫千军","金刚护法","其疾如风","五雷咒",
            "侵蚀·龙卷雨击·噬魂","狮搏","疯狂鹰击","亢龙归海","龙战于野","潜龙在渊","后发制人","侵蚀·横扫千军·噬魂","其徐如林","侵掠如火",
            "岿然如山","佛法无边","葬玉焚花","侵蚀·唧唧歪歪·噬魂","功德无量","秘传飞砂走石","风云变色","魔焰滔天",
            "秘传三昧真火","魔火焚世","三昧真火","摇头摆尾","烈火真言","风火燎原","蛊木迷瘴","落叶萧萧","风卷残云","血雨","星月之惠",
            "花语歌谣","蜜润","侵蚀·失魂符·噬魂","钟馗论道","分身术","一笑倾城","花谢花飞",
            "雨落寒沙","金击式","侵蚀·葬玉焚花·噬魂","侵蚀·五雷轰顶·噬魂","三荒尽灭","侵蚀·雷霆万钧·噬魂","雷霆汹涌","风雷韵动","鸣雷诀",
            "天雷灌注","普渡众生","波澜不惊","灵动九天","天罗地网","侵蚀·千蛛噬魂·噬魂","百鬼噬魂","碎甲符","尸腐毒","无间地狱","侵蚀·幽夜无明·噬魂","天命剑法","侵蚀·烟雨剑法·噬魂",
            "飘渺式","同伤式","侵蚀·绝烬残光·噬魂","明光宝烛","地涌金莲","化羽为血","浪涌","侵蚀·天崩地裂·噬魂","惊涛怒","龙腾","侵蚀·当头一棒·噬魂",
            "神针撼海","侵蚀·棒掀北斗·噬魂","兴风作浪","棍打诸神","天地洞明","天雷斩","灵能激发","力劈华山","法术防御","流沙轻音","扶摇万里","善恶有报",
            "超级壁垒击破","超级地狱烈火","超级泰山压顶","超级水漫金山","超级奔雷咒"}

local 门派秘技消耗={
 {道具=1,保护=1,银子=100000,经验=100000},
 {道具=2,保护=1,银子=200000,经验=200000},
 道具="菩提果",
 保护="祈福晶石",
 成功几率=30,
}
local 临时按钮={"开通战前施法","了解战前施法","恢复使用功能","暂时停用功能","查询当前技能","转换战前技能"}
function 战前施法:初始化(根)
       self.x = 45+(全局游戏宽度-800)/2-165
       self.y =75
    self.xx = 0
    self.yy = 0
    self.注释 = "超级传送"
    self.可视 = false
    self.鼠标 = false
    self.焦点 = false
    self.可移动 = true
    tp = 根
    self.窗口时间 = 0
    zts = tp.字体表.汉仪字体4
    zt = tp.字体表.普通字体
    self.进程=1

    local jn = 根._技能格子
    self.技能展示1={}
    self.技能展示2={}
    self.技能展示3={}
    for n=1,#特色法术(1) do
        self.技能展示1[n]=jn(0,0,n,"奇经八脉11111111")
    end

end

function 战前施法:打开(数据)
    if self.可视 then
        self.可视 = false
        self.资源组=nil
        return
    else
        self.数据=数据
        insert(tp.窗口_,self)
        local 资源 = tp.资源
        local 按钮 = tp._按钮
        local 自适应 = tp._自适应

        self.资源组 = {
            [1] = tp.资源:载入("pic/转门派/111.png","图片"),--自适应.创建(0,1,673,470+30,3,9), --蓝色自适应
            [2] = tp._自适应(5,1,650,450,3,9), --白色自适应
            [3] = 按钮.创建(自适应.创建(17,4,70,22,1,1),0,0,4,true,true,"  取消"),
            [4] = 按钮.创建(自适应.创建(17,4,70,22,1,1),0,0,4,true,true,"  学习"),
            [5] = 按钮.创建(自适应.创建(12,4,70,22,1,3),0,0,4,true,true,"菩提授业"),
            [6] = 按钮.创建(自适应.创建(12,4,75,22,1,3),0,0,4,true,true,"上一页"),
            [7] = 按钮.创建(自适应.创建(12,4,75,22,1,3),0,0,4,true,true,"下一页"),
            [8] = 按钮.创建(自适应.创建(12,4,75,26,1,3),0,0,4,true,true," 传 送"),
            [9] = 自适应.创建(0,1,1,400,3,9),
            [10] = 资源:载入('common/wzife.wdf',"网易WDF动画",0xB205A152),

            [11] = 按钮.创建(自适应.创建(17,4,102,22,1,1),0,0,4,true,true,"开通战前施法"),
            [12] = 按钮.创建(自适应.创建(17,4,102,22,1,1),0,0,4,true,true,"了解战前施法"),
            [13] = 按钮.创建(自适应.创建(17,4,102,22,1,1),0,0,4,true,true,"恢复使用功能"),
            [14] = 按钮.创建(自适应.创建(17,4,102,22,1,1),0,0,4,true,true,"暂时停用功能"),
            [15] = 按钮.创建(自适应.创建(17,4,102,22,1,1),0,0,4,true,true,"查询当前技能"),
            [16] = 按钮.创建(自适应.创建(17,4,102,22,1,1),0,0,4,true,true,"转换战前技能"),
            [17] = 资源:载入("pic/2.png","图片"),
            -- [17] = 资源:载入('common/wzife.wdf',"网易WDF动画",0xAB50A1CD),
        }
         self.临时按钮={}
     for n=1,#临时按钮 do
        self.临时按钮[n]=tp.资源:载入("pic/转门派/图层 3.png","图片")
     end


        self.形象={}
        self.形象1={}
        self.掉落={}
        self.特效={}

        mmww1=特色法术(1)
        for i=1,#mmww1 do
            local 临时技能=tp._技能.创建()
            临时技能:置对象(mmww1[i],2,"精美礼品")
            self.技能展示1[i]:置技能(临时技能,nil,true)
        end


        for i=1,18 do
             local n = 引擎.取所有模型(地图[i].模型)
             self.形象[i] = tp.资源:载入(n.资源,"网易WDF动画",n.站立)
             self.形象1[i] = tp.资源:载入(n.资源,"网易WDF动画",n.攻击)
             self.特效[i]= tp.资源:载入(引擎.特效库(地图[i].技能)[2],"网易WDF动画",引擎.特效库(地图[i].技能)[1])

        end
        self.数据=数据
        tp.运行时间 = tp.运行时间 + 1
        self.窗口时间 = tp.运行时间
        self.可视 = true
        self.进程={0,26}
        self.信息=1
        self.翻页=1
        self.选中=1

    end
end
function 战前施法:刷新1(数据)
    self.数据 = 数据
    self.临时数据=数据
    self.转圈时间=math.random(100,200)--战前施法刷新时间


end
function 战前施法:刷新(数据)
    self.数据 = 数据
end

function 战前施法:显示(dt,x,y)
   local xx,yy=10,30
   local xxx=0
   local yyy=0
   self.焦点=false
   self.资源组[1]:显示(self.x,self.y)
   --self.资源组[2]:显示(self.x+xx,self.y+yy)
    --self.召唤兽底图:显示(self.x+xx,self.y+yy)
    -- zts:置颜色(-1):显示(self.x+self.资源组[1].宽度/2-40,self.y+2,"战前施法")
  --  tp.窗口标题背景_:显示(self.x-86+self.资源组[1].宽度/2,self.y)
   -- 引擎.场景.字体表.标题字体:显示(self.x+self.资源组[1].宽度/2,self.y+3,"战前施法")
    if self.转圈时间 and self.转圈时间%20==0 then
         self.数据=随机法术[math.random(1,#随机法术)]


    end
    if  self.转圈时间    then
        self.转圈时间=self.转圈时间-1
        if  self.转圈时间<1 then
         self.数据=self.临时数据
         self.转圈时间=nil
     end
    end
  --  引擎.场景.字体表.标题字体:显示(self.x+578,self.y+480,"当前:"..(self.数据 or ""))
    for n=1,#self.临时按钮 do
        self.临时按钮[n]:显示(self.x+30+94,self.y-30+n*40+45)
         引擎.场景.字体表.标题字体:置颜色(0XFFFFFF00):显示(self.x+30+86+65,self.y-30+n*40+8+45,临时按钮[n])
         引擎.场景.字体表.标题字体:置颜色(0XFF000000)
        if self.临时按钮[n]:是否选中(x,y) and 引擎.鼠标弹起(0) then
           if n==1 then
             发送数据(676,{shijian="开通战前施法"})
           elseif n==2 then
             发送数据(676,{shijian="了解战前施法"})
           elseif n==3 then
             发送数据(676,{shijian="恢复使用功能"})
           elseif n==4 then
             发送数据(676,{shijian="暂时停用功能"})
           elseif n==5 then

           elseif n==6 then
            发送数据(676,{shijian="转换战前技能"})
           end
        end
    end
    -- self.资源组[11]:更新(x,y)
    -- self.资源组[12]:更新(x,y)
    -- self.资源组[13]:更新(x,y)
    -- self.资源组[14]:更新(x,y)
    -- self.资源组[15]:更新(x,y)
    -- self.资源组[16]:更新(x,y)
    -- self.资源组[11]:显示(self.x+self.资源组[1].宽度/4,self.y+400+15)
    -- self.资源组[12]:显示(self.x+self.资源组[1].宽度/4,self.y+400+30+15)
    -- self.资源组[13]:显示(self.x+self.资源组[1].宽度/4+120,self.y+400+15)
    -- self.资源组[14]:显示(self.x+self.资源组[1].宽度/4+120,self.y+400+30+15)
    -- --self.资源组[15]:显示(self.x+self.资源组[1].宽度/4+120+120,self.y+400+15)
    -- self.资源组[16]:显示(self.x+self.资源组[1].宽度/4+120+120,self.y+400+30+15)
    -- if     self.资源组[11]:事件判断() then
    --     发送数据(676,{shijian="开通战前施法"})

    -- elseif self.资源组[12]:事件判断() then
    --     发送数据(676,{shijian="了解战前施法"})

    -- elseif self.资源组[13]:事件判断() then
    --     发送数据(676,{shijian="恢复使用功能"})

    -- elseif self.资源组[14]:事件判断() then
    --     发送数据(676,{shijian="暂时停用功能"})

    -- elseif self.资源组[15]:事件判断() then
    --     --发送数据(67,{shijian="查询当前技能"})

    -- elseif self.资源组[16]:事件判断() then
    --     发送数据(676,{shijian="转换战前技能"})

    -- end
              -- for n=1,18 do
              --       if n>self.进程[1] and n<=self.进程[2] then
                      -- if xx>=600 then
                      --    xx=10
                      --    yy=yy+145+10
                      --  end
                    -- self.资源组[2]:显示(self.x+xx,self.y+yy)--------框框
                    -- zt:显示(self.x+xx+20,self.y+yy+5,地图[n].地图)----框框的门派字体
                     -- xx=xx+100+10
                      -- self.形象[n]:更新()
                      -- self.形象[n]:显示(self.x+xx-55,self.y+yy+137)
                      --   if self.形象[n]:是否选中(x,y) and 引擎.鼠标弹起(0) and  self.开始选中==nil  then
                      --      self.选中=n
                      --      self.开始选中=0
                      --   end
                    -- if self.数据[地图[n].升级技能] ==180 then
                    --     self.资源组[10]:显示(self.x+xx-90,self.y+yy+60)
                    -- end
                    -- end
            -- end

        --     for i=1,#特色法术(1) do
        --     self.技能展示1[i]:置坐标(self.x + xxx *120 + 40,self.y + yyy *45 + 40)
        --     if self.技能展示1[i].技能 ~= nil then
        --         self.技能展示1[i]:显示(x,y,self.鼠标,nil,nil,nil,灰色)
        --         zt:置颜色(0xFF111111)
        --         zt:显示(self.x + xxx *120 + 40+45,self.y + yyy *45 + 40 + 15,self.技能展示1[i].技能.名称)
        --         if self.技能展示1[i].焦点 then
        --             tp.提示:技能(x,y,self.技能展示1[i].技能)
        --         end
        --     end
        --     xxx = xxx + 1
        --     if xxx >= 5 then
        --         xxx = 0
        --         yyy = yyy + 1
        --     end
        -- end
        for i=1,#特色法术(1) do
            self.技能展示1[i]:置坐标(self.x + xxx *48 + 27+240,self.y + yyy *48 + 37+60)
            if self.技能展示1[i].技能 ~= nil then
                self.技能展示1[i]:显示(x,y,self.鼠标,nil,nil,nil,灰色)
                -- self.技能展示1[i].技能.模型:灰度级()
                -- zt:置颜色(0xFF111111)
                -- zt:显示(self.x + xxx *120 + 40+45,self.y + yyy *45 + 40 + 15,self.技能展示1[i].技能.名称)

                if self.技能展示1[i].焦点 then
                    tp.提示:技能(x,y,self.技能展示1[i].技能)
                end
                if self.数据==self.技能展示1[i].技能.名称 then
                   -- self.技能展示1[i].技能.模型:灰度级()
                self.资源组[17]:显示(self.x+xxx*48+240 + 27-8,self.y + yyy *48 + 37-7+60)--xuanzhongkuang 我猜的也是这个 就是+- 太多 我没敢动
                 -- self.召唤兽底图1:显示(self.x+380+175,self.y+370+35)
                self.技能展示1[i].技能.模型:显示(self.x+380+175+18-420,self.y+370+55-125)
                end

            end
            xxx = xxx + 1
            if xxx >= 13 then
                xxx = 0
                yyy = yyy + 1
            end



        end


              ------------------------
  if self.开始选中~=nil  then
     self.资源组[9]:置宽高(math.min(self.开始选中,400),300)
     self.资源组[9]:显示(self.x+610-self.开始选中,self.y+100)
     if self.开始选中<=500 then
        self.开始选中=self.开始选中+10
     else

        zt:置颜色(0xFFFFFFFF):显示(self.x+260+20,self.y+100+5,地图[self.选中].地图)

        self.形象1[self.选中]:更新()
        self.特效[self.选中]:更新()
        self.形象1[self.选中]:显示(self.x+190,self.y+210+40)
        self.特效[self.选中]:显示(self.x+190,self.y+210+40)
        ---
        -- zt:显示(self.x+280,self.y+140-8,"技能："..地图[self.选中].升级技能)
        zt:显示(self.x+280+20,self.y+140-8,"十八奇技："..地图[self.选中].地图)
        local lv=1
        if self.数据[地图[self.选中].升级技能]~=nil then
           lv=math.floor(self.数据[地图[self.选中].升级技能]/10)+1
        end
        -- zt:显示(self.x+280,self.y+180-8,"加成："..lv*地图[self.选中].伤害)
        -- zt:显示(self.x+280,self.y+200-8,"消耗："..门派秘技消耗.道具.."*"..门派秘技消耗[lv].道具.."  保护:"..门派秘技消耗.保护.."*"..门派秘技消耗[lv].保护)
        -- zt:显示(self.x+280,self.y+220-8,"银子:  "..门派秘技消耗[lv].银子.."   经验: "..门派秘技消耗[lv].经验)

        zt:显示(self.x+280+20,self.y+160-8,"当前层级：".. (self.数据[地图[self.选中].升级技能] or 0).."/180")
        -- zt:显示(self.x+280,self.y+180-8,"消耗："..门派秘技消耗.道具.."*"..门派秘技消耗[lv].道具)
        zt:显示(self.x+280+20,self.y+200-8,"需求银两："..((门派秘技消耗[lv].银子)/10000).."万")
        zt:显示(self.x+280+20,self.y+220-8,"需求经验："..((门派秘技消耗[lv].经验)/10000).."万")


        zt:置颜色(绿色)
        zt:显示(self.x+120,self.y+300+10,"奇技说明："..地图[self.选中].说明)
        self.资源组[3]:显示(self.x+400+20,self.y+370)
        self.资源组[4]:显示(self.x+400+20,self.y+340)
        self.资源组[5]:显示(self.x+400+20,self.y+310)
        self.资源组[4]:更新(x,y)
        self.资源组[5]:更新(x,y)
        self.资源组[3]:更新(x,y)

        if self.数据[地图[self.选中].升级技能] ==180 then
            self.资源组[10]:显示(self.x+433,self.y+125)
        end

        if self.资源组[3]:事件判断() then
           self.开始选中=nil
        elseif self.资源组[4]:事件判断() then
            -- 客户端:发送数据(1,self.选中,138,地图[self.选中].升级技能)
            发送数据(675,{参数=1,序号1=self.选中,文本=地图[self.选中].升级技能,})

        elseif self.资源组[5]:事件判断() then
            发送数据(675,{参数=2,序号1=self.选中,文本=地图[self.选中].升级技能,})

        elseif self.资源组[9]:是否选中(x,y) and 引擎.鼠标弹起(右键)  then
            self.开始选中=nil
            发送数据(675.2,{参数=0,文本="门派秘技"})
        end

        if self.资源组[5]:是否选中(x,y)  then
            tp.提示:自定义(x-42,y+27,"需消耗："..门派秘技消耗[lv].道具.."个"..门派秘技消耗.道具)
        end

     end
  end


end


function 战前施法:检查点(x,y)
    if self.资源组 ~= nil and self.资源组[1]:是否选中(x,y)   then
        return true
    end

end

function 战前施法:初始移动(x,y)
    tp.运行时间 = tp.运行时间 + 1
    if not tp.消息栏焦点 then
        self.窗口时间 = tp.运行时间
    end
    if not self.焦点 then
        tp.移动窗口 = true
    end
    if self.鼠标 and  not self.焦点 then
        self.xx = x - self.x
        self.yy = y - self.y
    end
end

function 战前施法:开始移动(x,y)
    if self.鼠标 then
        self.x = x - self.xx
        self.y = y - self.yy
    end
end

return 战前施法