-- @Author: baidwwy
-- @Date:   2024-11-05 21:04:45
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-12-13 11:18:04
-- @Author: 作者QQ381990860
-- @Date:   2023-04-11 22:31:31
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-11-06 04:44:00
-- @Author: 苍穹 QQ:490074394
-- @Date:   2021-11-01 11:27:40
-- @Last Modified by:   作者QQ381990860
-- @Last Modified time: 2023-04-10 21:08:36
-- @Author: 作者小兵 QQ51295586
-- @Date:   2021-10-19 20:41:56
-- @Last Modified by:   作者小兵 QQ51295586
-- @Last Modified time: 2021-10-23 01:34:41
--======================================================================--
-- @作者：小兵 QQ：51295586
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2021-09-29 22:45:54
--======================================================================--
local 门派秘籍 = class()
 local floor = math.floor
 local tp,zts,zt
 local format = string.format
 local insert = table.insert

 local 地图={
 [1]={地图=" 大唐官府",模型="程咬金",技能="横扫千军",升级技能="大唐官府A",说明="横扫千军附加11层剑意效果，且额\n\n外追加（层数/300）的溅射伤害。",伤害=2},
 [2]={地图=" 化生寺",模型="空度禅师",技能="金刚护法",升级技能="化生寺A",说明="金刚护法额外追加（层数*10）的物理伤害效果。\n\n作用人数额外追加（层数/36）",伤害=2},
 [3]={地图=" 方寸山",模型="菩提老祖",技能="五雷咒",升级技能="方寸山A",说明="法术伤害倍率额外追加*（1+层数/100）。\n\n即满层为2.8。",伤害=2},
 [4]={地图=" 女儿村",模型="孙婆婆",技能="似玉生香",升级技能="女儿村A",说明="葬玉焚花的伤害倍率*（1+层数/200）。",伤害=2},
 [5]={地图=" 神木林",模型="巫奎虎",技能="落叶萧萧",升级技能="神木林A",说明="法术连击率额外追加（层数/5）。",伤害=2},
 [6]={地图=" 九黎城",模型="小蚩尤",技能="三荒尽灭",升级技能="九黎城A",说明="浮空概率追加（层数/4），\n\n所有可浮空技能生效。",伤害=2},
 [7]={地图="  天宫",模型="李靖",技能="雷霆万钧",升级技能="天宫A",说明="雷霆万钧法术伤害倍率*（层数/100）。",伤害=2},
 [8]={地图="  龙宫",模型="东海龙王",技能="龙腾",升级技能="龙宫A",说明="龙腾追加（层数/25）的作用人数。",伤害=2},
 [9]={地图=" 五庄观",模型="镇元子",技能="飘渺式",升级技能="五庄观A",说明="进入战斗获得（1+层数/15）个\n\n人生娃娃状态效果",伤害=2},
 [10]={地图=" 普陀山",模型="观音姐姐",技能="灵动九天",升级技能="普陀山A",说明="灵动九天额外追加（层数*8）的法术伤害效果。\n\n作用人数额外追加（层数/45）",伤害=2},
 [11]={地图=" 花果山",模型="齐天大圣",技能="当头一棒",升级技能="花果山A",说明="当头一棒（含侵蚀）伤害倍率*（层数/100）。",伤害=2},
 [12]={地图=" 凌波城",模型="二郎神",技能="翻江搅海",升级技能="凌波城A",说明="物理暴击率追加（层数/6）。",伤害=2},
 [13]={地图=" 无底洞",模型="地涌夫人",技能="地涌金莲",升级技能="无底洞A",说明="地涌金莲额外追加（层数/36）个作用单位，\n\n最终回复结果*（层数/60）",伤害=2},
 [14]={地图=" 狮驼岭",模型="大大王",技能="狮搏",升级技能="狮驼岭A",说明="狮搏追加（层数/25）的目标人数。\n\n（取消攻击回位动作）",伤害=2},
 [15]={地图=" 魔王寨",模型="牛魔王",技能="秘传飞砂走石",升级技能="魔王寨A",说明="法术暴击率追加（层数/5）。",伤害=2},
 [16]={地图=" 盘丝洞",模型="白晶晶",技能="天罗地网",升级技能="盘丝洞A",说明="天罗地网额外追加（层数/45）个作用单位、\n\n额外追加装备伤害*（层数/100）的固定伤害。",伤害=2},
 [17]={地图="阴曹地府",模型="地藏王",技能="尸腐毒",升级技能="阴曹地府A",说明="尸腐毒额外追加（层数/36）个作用单位、\n\n伤害追加（层数*6）、持续伤害追加（层数*10）。",伤害=2},
 [18]={地图=" 天机城",模型="进阶机关人人形",技能="新_鹰击",升级技能="天机城A",说明="敬请期待···",伤害=2},



 }

local 门派秘技消耗={
 {道具=1,保护=1,银子=100000,经验=100000},
 {道具=2,保护=1,银子=200000,经验=200000},
 {道具=4,保护=1,银子=400000,经验=400000},
 {道具=8,保护=1,银子=800000,经验=800000},
 {道具=10,保护=1,银子=1000000,经验=1000000},
 {道具=20,保护=1,银子=2000000,经验=2000000},
 {道具=40,保护=1,银子=4000000,经验=4000000},
 {道具=60,保护=1,银子=6000000,经验=6000000},
 {道具=80,保护=1,银子=8000000,经验=8000000},
 {道具=100,保护=1,银子=10000000,经验=10000000},
 {道具=110,保护=2,银子=11000000,经验=11000000},
 {道具=120,保护=2,银子=12000000,经验=12000000},
 {道具=130,保护=2,银子=13000000,经验=13000000},
 {道具=140,保护=2,银子=14000000,经验=14000000},
 {道具=150,保护=2,银子=15000000,经验=15000000},
 {道具=160,保护=3,银子=16000000,经验=16000000},
 {道具=170,保护=3,银子=17000000,经验=17000000},
 {道具=180,保护=3,银子=18000000,经验=18000000},
 {道具=999,保护=3,银子=99999999,经验=99999999},

 道具="菩提果",
 保护="祈福晶石",
 成功几率=30,
}

function 门派秘籍:初始化(根)
       self.x = 45+(全局游戏宽度-800)/2
       self.y = 85
    self.xx = 0
    self.yy = 0
    self.注释 = "超级传送"
    self.可视 = false
    self.鼠标 = false
    self.焦点 = false
    self.可移动 = true
    tp = 根
    self.窗口时间 = 0
    zts = tp.字体表.汉仪字体4
    zt = tp.字体表.普通字体
    self.进程=1
end

function 门派秘籍:打开(数据)
    if self.可视 then
        self.可视 = false
        self.资源组=nil
        return
    else
        insert(tp.窗口_,self)
        local 资源 = tp.资源
        local 按钮 = tp._按钮
        local 自适应 = tp._自适应

        self.资源组 = {
            [1] = 自适应.创建(0,1,673,470+30,3,9), --蓝色自适应
            [2] = tp._自适应(4,1,105,150,3,9), --白色自适应



            -- [1] = 资源:载入('quansc.wdf',"网易WDF动画",0x00000111),
            -- [2] = 按钮.创建(自适应.创建(100,4,75,26,1,3),0,0,4,true,true),
            [3] = 按钮.创建(自适应.创建(17,4,70,22,1,1),0,0,4,true,true,"  取消"),
            [4] = 按钮.创建(自适应.创建(17,4,70,22,1,1),0,0,4,true,true,"  学习"),

            [5] = 按钮.创建(自适应.创建(12,4,70,22,1,3),0,0,4,true,true,"菩提授业"),
            [6] = 按钮.创建(自适应.创建(12,4,75,22,1,3),0,0,4,true,true,"上一页"),
            [7] = 按钮.创建(自适应.创建(12,4,75,22,1,3),0,0,4,true,true,"下一页"),
            --[7] = 资源:载入('wzife.wdf',"网易WDF动画",0x2DA9D4EC),

            [8] = 按钮.创建(自适应.创建(12,4,75,26,1,3),0,0,4,true,true," 传 送"),
            [9] = 自适应.创建(0,1,1,400,3,9),
             -- [9] = 按钮.创建(自适应.创建(100,4,75,26,1,3),0,0,4,true,true,"第二世界"),
             -- [10] = 按钮.创建(自适应.创建(100,4,75,26,1,3),0,0,4,true,true,"第三世界"),
            [10] = 资源:载入('common/wzife.wdf',"网易WDF动画",0xB205A152),
        }

        self.形象={}
        self.形象1={}
        self.掉落={}
        self.特效={}
        for i=1,18 do
             local n = 引擎.取所有模型(地图[i].模型)
             self.形象[i] = tp.资源:载入(n.资源,"网易WDF动画",n.站立)
             self.形象1[i] = tp.资源:载入(n.资源,"网易WDF动画",n.攻击)
             self.特效[i]= tp.资源:载入(引擎.特效库(地图[i].技能)[2],"网易WDF动画",引擎.特效库(地图[i].技能)[1])

        end
        self.数据=数据
        tp.运行时间 = tp.运行时间 + 1
        self.窗口时间 = tp.运行时间
        self.可视 = true
        self.进程={0,26}
        self.信息=1
        self.翻页=1
        self.选中=1

    end
end

function 门派秘籍:刷新(数据)
    self.数据 = 数据
end

function 门派秘籍:显示(dt,x,y)
   self.焦点=false
   self.资源组[1]:显示(self.x,self.y)
    -- Picture.标题:显示(self.x+self.资源组[1].宽度/2-90,self.y)
    -- zts:置颜色(-1):显示(self.x+self.资源组[1].宽度/2-40,self.y+2,"十八奇技")
    tp.窗口标题背景_:显示(self.x-86+self.资源组[1].宽度/2,self.y)
    引擎.场景.字体表.标题字体:显示(self.x+self.资源组[1].宽度/2,self.y+3,"十八奇技")
   local xx,yy=10,30
              for n=1,18 do
                    if n>self.进程[1] and n<=self.进程[2] then

                      if xx>=600 then
                         xx=10
                         yy=yy+145+10
                       end
                    self.资源组[2]:显示(self.x+xx,self.y+yy)--------框框
                    zt:显示(self.x+xx+20,self.y+yy+5,地图[n].地图)----框框的门派字体

                     xx=xx+100+10
                      self.形象[n]:更新()
                      self.形象[n]:显示(self.x+xx-55,self.y+yy+137)
                        if self.形象[n]:是否选中(x,y) and 引擎.鼠标弹起(0) and  self.开始选中==nil  then
                           self.选中=n
                           self.开始选中=0
                        end

                    if self.数据[地图[n].升级技能] ==180 then
                        self.资源组[10]:显示(self.x+xx-90,self.y+yy+60)
                    end



                    end
            end
              ------------------------
  if self.开始选中~=nil  then
     self.资源组[9]:置宽高(math.min(self.开始选中,400),300)
     self.资源组[9]:显示(self.x+610-self.开始选中,self.y+100)
     if self.开始选中<=500 then
        self.开始选中=self.开始选中+10
     else

        zt:置颜色(0xFFFFFFFF):显示(self.x+260+20,self.y+100+5,地图[self.选中].地图)

        self.形象1[self.选中]:更新()
        self.特效[self.选中]:更新()
        self.形象1[self.选中]:显示(self.x+190,self.y+210+40)
        self.特效[self.选中]:显示(self.x+190,self.y+210+40)
        ---
        -- zt:显示(self.x+280,self.y+140-8,"技能："..地图[self.选中].升级技能)
        zt:显示(self.x+280+20,self.y+140-8,"十八奇技："..地图[self.选中].地图)
        local lv=1
        if self.数据[地图[self.选中].升级技能]~=nil then
           lv=math.floor(self.数据[地图[self.选中].升级技能]/10)+1
        end
        -- zt:显示(self.x+280,self.y+180-8,"加成："..lv*地图[self.选中].伤害)
        -- zt:显示(self.x+280,self.y+200-8,"消耗："..门派秘技消耗.道具.."*"..门派秘技消耗[lv].道具.."  保护:"..门派秘技消耗.保护.."*"..门派秘技消耗[lv].保护)
        -- zt:显示(self.x+280,self.y+220-8,"银子:  "..门派秘技消耗[lv].银子.."   经验: "..门派秘技消耗[lv].经验)

        zt:显示(self.x+280+20,self.y+160-8,"当前层级：".. (self.数据[地图[self.选中].升级技能] or 0).."/180")
        -- zt:显示(self.x+280,self.y+180-8,"消耗："..门派秘技消耗.道具.."*"..门派秘技消耗[lv].道具)
        zt:显示(self.x+280+20,self.y+200-8,"需求银两："..((门派秘技消耗[lv].银子)/10000).."万")
        zt:显示(self.x+280+20,self.y+220-8,"需求经验："..((门派秘技消耗[lv].经验)/10000).."万")


        zt:置颜色(绿色)
        zt:显示(self.x+120,self.y+300+10,"奇技说明："..地图[self.选中].说明)
        self.资源组[3]:显示(self.x+400+20,self.y+370)
        self.资源组[4]:显示(self.x+400+20,self.y+340)
        self.资源组[5]:显示(self.x+400+20,self.y+280)
        self.资源组[4]:更新(x,y)
        self.资源组[5]:更新(x,y)
        self.资源组[3]:更新(x,y)

        if self.数据[地图[self.选中].升级技能] ==180 then
            self.资源组[10]:显示(self.x+433,self.y+125)
        end

        if self.资源组[3]:事件判断() then
           self.开始选中=nil
        elseif self.资源组[4]:事件判断() then
            -- 客户端:发送数据(1,self.选中,138,地图[self.选中].升级技能)
            发送数据(675,{参数=1,序号1=self.选中,文本=地图[self.选中].升级技能,})

        elseif self.资源组[5]:事件判断() then
            发送数据(675,{参数=2,序号1=self.选中,文本=地图[self.选中].升级技能,})

        elseif self.资源组[9]:是否选中(x,y) and 引擎.鼠标弹起(右键)  then
            self.开始选中=nil
            发送数据(675.2,{参数=0,文本="门派秘技"})
        end

        if self.资源组[5]:是否选中(x,y)  then
            tp.提示:自定义(x-42,y+27,"需消耗："..门派秘技消耗[lv].道具.."个"..门派秘技消耗.道具)
        end

     end
  end


end


function 门派秘籍:检查点(x,y)
    if self.资源组 ~= nil and self.资源组[1]:是否选中(x,y)   then
        return true
    end

end

function 门派秘籍:初始移动(x,y)
    tp.运行时间 = tp.运行时间 + 1
    if not tp.消息栏焦点 then
        self.窗口时间 = tp.运行时间
    end
    if not self.焦点 then
        tp.移动窗口 = true
    end
    if self.鼠标 and  not self.焦点 then
        self.xx = x - self.x
        self.yy = y - self.y
    end
end

function 门派秘籍:开始移动(x,y)
    if self.鼠标 then
        self.x = x - self.xx
        self.y = y - self.yy
    end
end

return 门派秘籍